{
    "id": "Carmarthenshire",
    "population": {
        "href": {

        },
        "_text": {

        }
    },
    "poscodes": {
        "postcode": [
            "SA14",
            "SA15",
            "SA16",
            "SA17",
            "SA18",
            "SA19",
            "SA20",
            "SA31",
            "SA32",
            "SA33",
            "SA34",
            "SA35",
            "SA38",
            "SA39",
            "SA4",
            "SA40",
            "SA44",
            "SA48",
            "SA66"
        ]
    },
    "towns": {
        "town": [
            {
                "id": "carmarthenshire#aber arad",
                "name": "Aber Arad"
            },
            {
                "id": "carmarthenshire#aber-giar",
                "name": "Aber-Giar",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Aber-Giar",
                    "_text": "This is a redirect from a title with another method of capitalisation. It leads to the title in accordance with the Wikipedia naming conventions for capitalisation, or it leads to a title that is associated in some way with the conventional capitalisation of this redirect title. This may help writing, searching and international language issues. For more information follow the category link.\nIf this redirect is an incorrect capitalization (a typo), then it is made available to aid searches, so pages that use this link should be updated to link directly to the target.\nUse this rcat to tag only mainspace redirects; when other capitalisations are in different namespaces, use {{R from modification}} instead."
                }
            },
            {
                "id": "carmarthenshire#abergorlech",
                "name": "Abergorlech",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Abergorlech",
                        "_text": "Abergorlech is a village in the Welsh principal area of Carmarthenshire. It lies on the River Cothi on the B4310 road, between Brechfa to the southwest and Llansawel to the northeast.\nThe Pont Cothi bridge, which crosses the River Cothi in the centre of the village, is a grade II* listed building.\nThe village is connected to Dafydd Gorlech (fl. c. 1410-1490), one of the poets of the nobility.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Abergorlech",
                        "_text": "Pentref bychan a phlwyf yn rhannau uchaf Ystrad Tywi, Sir Gaerfyrddin, yw Abergorlech. Saif ar aber Afon Gorlech yn Afon Cothi. Mae ar lôn y B4310 rhwng Llansawel i'r gogledd a Brechfa i'r de, tua 10 milltir i'r dwyrain o dref Llanymddyfri.\nRoedd plwyf Abergorlech gynt yn gorwedd yng nghwmwd Caeo yn y Cantref Mawr.\nCysylltir y brudiwr Dafydd Gorlech (fl. tua 1410-1490), un o Feirdd yr Uchelwyr, ag Abergorlech, er nad oes sicrwydd iddo fyw yno.\nDwy filltir i'r gogledd ceir Rhydcymerau a Mynydd Llanybydder, bro'r llenor D. J. Williams.\nCynhelir yr eisteddfod gadeiriol flynyddol leol, Eisteddfod Abergorlech, yn Neuadd y Pentref."
                    }
                ]
            },
            {
                "id": "carmarthenshire#abergwili",
                "name": "Abergwili",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Abergwili",
                        "_text": "Abergwili is a village in Carmarthenshire, Wales, near the confluence of the rivers Towy and Gwili. It is also an electoral ward."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Abergwili",
                        "_text": "Pentref a chymuned ar gyrion tref Caerfyrddin yw Abergwili.\nMae Afon Gwili yn aberu yn Afon Tywi yno. Mae ganddo 1520 o drigolion, 59% ohonynt yn siarad Cymraeg (Cyfrifiad 2001)."
                    }
                ]
            },
            {
                "id": "carmarthenshire#abernant",
                "name": "Abernant",
                "lat": "51.881176",
                "lon": "-4.416299",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Abernant",
                        "_text": "Abernant may refer to:\nAbernant, Alabama, unincorporated community in Tuscaloosa County, Alabama, USA\nAbernant, Carmarthenshire, Wales\nAbernant, Powys, Wales\nAbernant, Rhondda Cynon Taf, Wales\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Abernant",
                        "_text": "Gallai Abernant neu Aber-nant gyfeirio at:\nAber-nant, Sir Gaerfyrddin\nAbernant, Powys\nAbernant, Rhondda Cynon Taf"
                    }
                ]
            },
            {
                "id": "carmarthenshire#achddu",
                "name": "Achddu"
            },
            {
                "id": "carmarthenshire#adpar",
                "name": "Adpar",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Adpar",
                        "_text": "Adpar, formerly Trefhedyn, is a village in Ceredigion, Wales now considered as a part of Newcastle Emlyn to which it is joined by a fine bridge across the River Teifi. Adpar used to be an ancient Welsh borough in its own right."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Adpar",
                        "_text": "Hen fwrdeistref ar lan ogleddol afon Teifi yng Ngheredigion sydd bellach yn faesdref i Gastellnewydd Emlyn yw Adpar (ceir y ffurf Atpar weithiau hefyd). Mae'n rhan o blwyf a chymuned Llandyfriog, Ceredigion, er bod Castellnewydd Emlyn ei hun, dros yr afon, yn Sir Gaerfyrddin.\nHen enw Adpar oedd Trefhedyn ac roedd yn un o hen fwrdeistrefi Sir Aberteifi. Mae gan Adpar ei le yn hanes Cymru a llenyddiaeth Gymraeg fel cartref i'r argraffwasg barhaol gyntaf yng Nghymru a sefydlwyd yno yn 1718 gan Isaac Carter (m. 1741). Cyhoeddodd Carter ddau bamffledyn, 'Cân o Senn i’w hen Feistr Tobacco' gan Alban Thomas a 'Cân ar Fesur Triban ynghylch Cydwybod a’i Chynheddfau' gan awdur anhysbys yn 1719. Parhaodd y wasg hyd tua 1725 pan gafodd ei symud i dref Caerfyrddin.\nDarfu am Adpar fel bwrdeistref yn 1774 a daeth yn ddiweddarach yn faesdref i Gastellnewydd Emlyn.\nMae Adpar yn gartref i Glwb Rygbi Castell Newydd Emlyn."
                    }
                ]
            },
            {
                "id": "carmarthenshire#allt",
                "name": "Allt"
            },
            {
                "id": "carmarthenshire#alltwalis",
                "name": "Alltwalis",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Alltwalis",
                        "_text": "A village in Carmarthen, Carmarthenshire, Wales. It has a wind farm called Alltwalis Wind Farm.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Alltwalis",
                        "_text": "Pentref bychan yn Sir Gaerfyrddin yw Alltwalis. Fe'i lleolir yng ngogledd canolbarth y sir ar y ffordd A485 tuag 8 milltir i'r gogledd o dref Caerfyrddin. Mae'n rhan o blwyf eglwysig Llanfihangel-ar-Arth."
                    }
                ]
            },
            {
                "id": "carmarthenshire#ammanford",
                "name": "Ammanford",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Ammanford",
                    "_text": "Ammanford (Welsh: Rhydaman) is a town and community in the county of Carmarthenshire, Wales, with a population 5,293 according to the Office for National Statistics (2001), increasing to 5,411 at the 2011 census. Located at the end of the Amman Valley, Ammanford is a former coal mining town and serves as the main shopping centre for many villages in the surrounding area.\nAccording to the 2001 census, 75.88% of the population are competent in the Welsh language, compared to roughly 61% in Carmarthenshire as a whole and 21.8% in Wales as a whole.\nAmmanford is served by the A483 and A474 roads and Ammanford local railway station is a stop on the Heart of Wales Line with trains to Llanelli and Swansea to the south and Shrewsbury to the north.\nAmmanford is twinned with Breuillet, Essonne."
                }
            },
            {
                "id": "carmarthenshire#ashfield",
                "name": "Ashfield",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Ashfield",
                    "_text": "Ashfield is a local government district in western Nottinghamshire, England. According to the 2001 UK census, it has a population of 111,387. The district is mostly urban and contains parts of both the Nottingham Urban Area and the Mansfield Urban Area. The area has a tradition of coal mining. There are three towns in the district; the largest being Sutton-in-Ashfield. Settlements in the district include the following:\nAnnesley, Annesley Woodhouse\nFelley\nHucknall, Huthwaite\nJacksdale\nKirkby-in-Ashfield\nSelston, Stanton Hill, Sutton-in-Ashfield\nTeversal\nUnderwood\nThe district was formed on 1 April 1974, under the Local Government Act 1972, by the merger of urban districts of Hucknall, Kirkby-in-Ashfield, and Sutton-in-Ashfield and parts of Basford Rural District namely the parishes of Annesley, Felley and Selston.\nIn spring 1986, all departments, except for Direct Works, moved into purpose-built office accommodation in the centre of Kirkby-in-Ashfield. These offices provide civic accommodation for members, together with a Council Chamber and two Committee Rooms. District Offices have been maintained at Watnall Road, Hucknall, and Fox Street, Sutton-in-Ashfield, to cater for housing matters and cash receipts on a local basis."
                }
            },
            {
                "id": "carmarthenshire#babel",
                "name": "Babel",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Babel",
                        "_text": "Babel is the name used in the Hebrew Bible for the city of Babylon.\nBabel may also refer to:\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Babel",
                        "_text": "Mae Babel yn hen enw am Fabilon. Gallai gyfeirio at:\nBabilon (Babel \"Porth yr Arglwydd\"), dinas hynafol ym Mesopotamia\nTŵr Babel, tŵr chwedlonol y ceir ei hanes yn yr Hen Destament\n\nBabel (2006), ffilm\nBabel, Sir Gaerfyrddin, pentref yng ngogledd-ddwyrain y sir\nGweler hefyd\nBabell"
                    }
                ]
            },
            {
                "id": "carmarthenshire#backe",
                "name": "Backe",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Backe",
                    "_text": "Backe may refer to:"
                }
            },
            {
                "id": "carmarthenshire#bancffosfelen",
                "name": "Bancffosfelen"
            },
            {
                "id": "carmarthenshire#bancycapel",
                "name": "Bancycapel",
                "lat": "51.812342",
                "lon": "-4.279456",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Bancycapel",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Bancycapel (hefyd: Banc-y-capel). Fe'i lleolir yn ne'r sir tua 4 milltir i'r de o dref Caerfyrddin ar ffordd wledig. Mae yng nghymuned Llandyfaelog."
                }
            },
            {
                "id": "carmarthenshire#bancyfelin",
                "name": "Bancyfelin",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Bancyfelin",
                        "_text": "Bancyfelin is a village, 5 miles (8.0 km) west of Carmarthen in West Wales.\nBancyfelin is a small village in south west Wales located between St Clears and Carmarthen. The English translation of the name from the Welsh language is Hill of the Mill \/ \"Millhill\"(Banc-y-felin). There is no remnant of the mill today.\nUp until the 1980s the village was plagued by traffic jams in the summer months due to holidaymakers journeying to Tenby and Pendine Sands, however, a new dual carriageway bypass means traffic passes the village.\nThe village is located mainly on the old A40 road, with the exception of the Council Estate built on a nearby hill. The village has gradually expanded through the 1990s and 2000s with the building of houses on the outskirts taking advantage of the countryside location.\nThe village has a small primary school, a post office, a pub, a chapel and a garage. Bancyfelin also has a family run bakery called Hafod Bakery, which has been baking bread for around 60 years.\nWerndale Hospital, run by BMI Healthcare, is located at the western end of the village."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Bancyfelin",
                        "_text": "Pentref yn Sir Gaerfyrddin yw Bancyfelin, 5 milltir i'r gorllewin i Gaerfyrddin. Mae'r chwaraewr Rygbi'r Undeb Delme Thomas yn hanu o'r pentref."
                    }
                ]
            },
            {
                "id": "carmarthenshire#bancyfford",
                "name": "Bancyfford"
            },
            {
                "id": "carmarthenshire#bethlehem",
                "name": "Bethlehem",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Bethlehem",
                        "_text": "Bethlehem (Arabic: بيت لحم‎  Bayt Laḥm  \"House of Meat\" Bēt Laḥm, Hebrew: בֵּית לֶחֶם‎ Bēṯ Leḥem, Modern: Bet Leḥem [bet ˈleχem], lit. \"House of Bread\"; Ancient Greek: Βηθλεέμ [bɛːtʰle.ém]) is a Palestinian city located in the central West Bank, about 10 kilometers south of Jerusalem. Its population is approximately 25,000 people. It is the capital of the Bethlehem Governorate. The economy is primarily tourist-driven.\nIt is thought the original name was Beit Lachama, from the Canaanite god Lachama. The earliest mention of the city is in the Amarna correspondence c.1350-1330 BCE as \"Bit-Lahmi\". The Hebrew Bible identifies it as the city David was from and where he was crowned as the king of Israel. The New Testament identifies Bethlehem as the birthplace of Jesus. The city is inhabited by one of the oldest Christian communities in the world, although the size of the community has shrunk due to emigration. Bethlehem was destroyed by the Emperor Hadrian during the second-century Bar Kokhba revolt; its rebuilding was promoted by the Empress Helena, mother of Constantine the Great, who commissioned the building of its great Church of the Nativity in 327 CE. The Church was badly damaged by the Samaritans, who sacked it during the Samaritan Revolt in 529, but was rebuilt a century later by the emperor Justinian I, in very much its present form.\nBethlehem was seized by the Arab Caliphate of 'Umar ibn al-Khattāb during the Arab conquest in 637, seized again by Egypt and then the Seljuks, and, in 1099, by Crusaders, who replaced its Greek Orthodox clergy with a Latin one. In the mid-13th century, invading Mamluks demolished the city's walls, which were subsequently rebuilt in the early 16th century, after Bethlehem became part of the Ottoman Empire.\nControl of Bethlehem passed from the Ottoman Empire to the British Empire at the end of World War I. Pursuant to the proposed United Nations Partition Plan for Palestine of November 1947, Bethlehem was to be included in an international zone, controlled by Britain. The Arab League states rejected the Partition Plan, and launched the 1948 Arab-Israeli War to prevent the creation of a Jewish state. During the war Jordan forcibly seized Bethlehem and occupied it - Jordan claimed to annex the west bank territories in 1950, though this was only ever formally recognized by Britain. Bethlehem was captured by Israel in the 1967 Six-Day War, and since 1995 - per the Oslo Accords - Bethlehem has been governed by the Palestinian National Authority.\nBethlehem has a Muslim majority, but is also home to one of the largest Palestinian Christian communities. Originally, Bethlehem was a lodging point for Jewish pilgrims to Jerusalem during the three holiest days of the Jewish year. Bethlehem's chief economic sector is tourism which peaks during the Christmas season when Christians make pilgrimage to the Church of the Nativity, as they have done for almost two millennia. Bethlehem has over thirty hotels and three hundred handicraft workshops. Rachel's Tomb, an important Jewish holy site, is located at the northern entrance of Bethlehem."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Bethlehem",
                        "_text": "Mae'r erthygl hon yn ymwneud â'r dref hanesyddol yn Judaea. Am enghreifftiau eraill o'r enw gweler Bethlehem (gwahaniaethu)\nMae Bethlehem yn ddinas yn y Dwyrain Canol ar y Lan Orllewinol, lle cafodd Iesu Grist ei eni ddwy fil o flynyddoedd yn ôl, yn ôl y traddodiad Beiblaidd. Yng ngwlad Judea oedd hi yn amser Crist, gwlad yr Iddewon, ond mae mwyafrif y boblogaeth nawr yn Arabiaid ac mae'r ddinas dan reolaeth Awdurdod Palesteina. Ystyr Bethlehem mewn Hebraeg safonol yw \"tŷ bara\".\nGorwedd safle traddodiadol Beddrod Rachel, sy'n safle cysegredig pwysig yn Iddewiaeth, ar ymyl y ddinas. Mae Bethlehem yn gartref i un o'r cymunedau Cristnogol Arabaidd mwyaf yn y Dwyrain Canol. Mae'r ddinas yn gorwedd tua 10 km (6 milltir) i'r de o Jeriwsalem, ar uchder o tua 765 m (2,510 troedfedd) uwchben lefel y môr. Mae cylch dinesig Bethlehem yn cynnwys trefi llai Beit Jala a Beit Sahour.\n\nSaif Eglwys y Geni, a godwyd gan yr ymerodr Rhufeinig Cystennin Mawr yn y flwyddyn 330, yng nghanol Bethlehem dros ogof a elwir y Crypt Sanctaidd, man geni traddodiadol Iesu Grist. Hon efallai yw'r eglwys Gristnogol hynaf yn y byd sy'n dal i sefyll. Gerllaw y mae ogof arall lle treuliodd Sant Jerome, un o dadau'r eglwys, 30 mlynedd o'i oes yn cyfieithu'r Ysgrythurau i Ladin gan osod sylfaen y Beibl Fwlgat.\nMae Bethlehem yn gartref i Brifysgol Bethlehem, sefydliad Catholig pwysig a sefydlwyd gan y Fatican.\nErs rhai blynyddoedd mae Mur Diogelwch Israel yn rhwystr rhwng y ddinas a Jeriwsalem ac yn creu problemau economaidd mawr yn y ddinas. Mae twristiaeth yn arbennig wedi dioddef yn enbyd mewn canlyniad."
                    }
                ]
            },
            {
                "id": "carmarthenshire#betws",
                "name": "Betws",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Betws",
                    "_text": "Am enghreifftiau eraill o enwau lleol sy'n cynnwys y gair Betws, gweler Betws (gwahaniaethu).\nPentref bychan a chymuned yn Sir Gaerfyrddin yw'r Betws.\n↑ Defnyddir sillafiad safonol Cymdeithas Enwau Lleoedd Cymru a Gwyddoniadur Cymru; Gwasg Prifysgol Cymru; cyhoeddwyd 2008; tud 75"
                }
            },
            {
                "id": "carmarthenshire#blaenau",
                "name": "Blaenau",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Blaenau",
                    "_text": "Gallai Blaenau gyfeirio at:\nTirffurf\nBlaen (tirffurf)\nTrefi a phentrefi\nBlaenau, Blaenau Gwent (Saesneg: Blaina), tref ym Mlaenau Gwent\nBlaenau, Sir Gaerfyrddin, pentref\nBlaenau Ffestiniog, tref yng Ngwynedd\nSir\nBlaenau Gwent\nBlaenau Gwent (gwahaniaethu)\n\nArall\nBlaenau Plastics, ffatri ym Mlaenau Ffestiniog"
                }
            },
            {
                "id": "carmarthenshire#blaenwaun",
                "name": "Blaenwaun",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Blaenwaun",
                    "_text": "Blaenwaun is a small village in Carmarthenshire, Wales. It is one of the five villages of Llanwinio parish, in the diocese of St. David's. It lies 220m above sea level, making it one of the highest villages in the West Wales peninsula.\nThe village features a free house, The Lamb Inn (Tafarn Yr Oen in Welsh), a Land Rover garage, a caravan park and a honey farm. There is a phone box and a children's play area owned by Llanwino Community Council. The village's Moreia Welsh Independent Chapel was built in 1828 and remodelled in 1885.\nIt was previously home to the smallest post office in Wales, a 5m by 2.9m brick structure built in 1936 which was moved to St Fagans National History Museum, near Cardiff, in 1992. A mobile post office van now visits the village twice a week.\nDyffryn Brodyn, a 5.5 MW 11-turbine wind farm built in 1994, is adjacent to the village."
                }
            },
            {
                "id": "carmarthenshire#bolahaul",
                "name": "Bolahaul"
            },
            {
                "id": "carmarthenshire#bont fawr",
                "name": "Bont Fawr",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Bont Fawr",
                    "_text": "Bont Fawr is a tiny hamlet in Carmarthenshire, Wales."
                }
            },
            {
                "id": "carmarthenshire#brechfa",
                "name": "Brechfa",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Brechfa",
                        "_text": "Brechfa is a village in Carmarthenshire, Wales that has existed since the 6th century.\n^ 2001 Census\n^ Community Web-Site\n^ A History of Carmarthenshire Lloyd, Sir J: For The Society (Cardiff) 1935 & 1939, Vol I From Prehistoric Times to the Act of Union (1536)"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Brechfa",
                        "_text": "Pentref yng ngogledd Sir Gaerfyrddin yw Brechfa. Fe'i lleolir tua 7 milltir i'r gogledd-ddwyrain o dref Caerfyrddin, ar y B4310 tua hanner ffordd rhwng Nantgaredig a Llansawel. Gorwedda Brechfa ar lan yr afon Pîb, un o ledneintau afon Cothi, ger y man lle llifa'r afon Marles (Marlais) i lawr o fryniau Llanfihangel-rhos-y-corn.\nEnwir Fforest Brechfa ar ei ôl. Mae afon Cothi yn llifo heibio hanner milltir i'r dwyrain o'r pentref. Cysegrir eglwys Brechfa i Sant Teilo. Dyddia'r adeilad presennol i 1893 ond saif ar safle eglwys gynharach. Bu'r bardd ac arweinydd radicalaidd William Thomas (1834-1879) yn byw ym Mrechfa. Adwaenir ef yn well wrth ei enw barddol Gwilym Marles, ar ôl afon Marles.\nCeir llwybr beicio yno sy'n addas i ddechreuwyr a theuluoedd."
                    }
                ]
            },
            {
                "id": "carmarthenshire#broad oak",
                "name": "Broad Oak",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Broad Oak",
                        "_text": "Broad Oak or Broadoak may refer to one of several places in Great Britain:\nBroad Oak, Cornwall, England\nBroad Oak, Cumbria, England\nBroad Oak, East Sussex, England\nBroad Oak, Kent, England\nBroad Oak, Herefordshire, England\nBroad Oak, St Helens, England\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Broad Oak",
                        "_text": "Gallai Broad Oak gyfeirio at:\nCymru\nBroad Oak (sef Derwen-fawr), Sir Gaerfyrddin\nLloegr\nBroad Oak, Cumbria\nBroad Oak, Dwyrain Sussex (2):\nBroad Oak\nBroad Oak\n\nBroad Oak, Swydd Henffordd\nGweler hefyd\nBroadoak (gwahaniaethu)"
                    }
                ]
            },
            {
                "id": "carmarthenshire#broadlay",
                "name": "Broadlay"
            },
            {
                "id": "carmarthenshire#broadway",
                "name": "Broadway",
                "lat": "51.781075",
                "lon": "-5.077684",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Broadway",
                        "_text": "Broadway may refer to:"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Broadway",
                        "_text": "Rhodfa lydan yn Ninas Efrog Newydd yw Broadway. Er bod Broadways eraill yn Efrog Newydd, yng nghyd-destun y ddinas, cyfeiria Broadway fel arfer at Stryd Manhattan. Dyma yw'r prif dramwyfa hynaf o'r gogledd i'r de drwy'r ddinas, ac mae'n dyddio i Setlwyr Amsterdam Newydd. Mae'r enw Broadway yn gyfieithiad Saesneg o'r enw Iseldireg, Breede weg. Mae rhan o Broadway yn enwog fel uchafbwynt y diwydiant theatr Americanaidd."
                    }
                ]
            },
            {
                "id": "carmarthenshire#bronwydd arms",
                "name": "Bronwydd Arms"
            },
            {
                "id": "carmarthenshire#brook",
                "name": "Brook",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Brook",
                    "_text": "A brook is a small stream. The word may also refer to:"
                }
            },
            {
                "id": "carmarthenshire#bryn",
                "name": "Bryn",
                "lat": "51.6169859",
                "lon": "-3.7123799",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Bryn",
                        "_text": "Bryn (which is Welsh for hill) is a component ward of the Metropolitan Borough of Wigan, Greater Manchester, England. It is part of the larger town of Ashton-in-Makerfield and is geographically indistinguishable from it. It forms a separate local council ward. Served by Bryn railway station, Bryn is home to the Three Sisters Recreation Area which has been created from three large spoil tips which remain from Bryn's role in Lancashire's coal mining past. The Three Sisters Recreation Area is also the site of the Three Sisters Race Circuit, which provides race driving instruction and plays host to kart racing events and motorcycle road race meetings at clubman level.\nThe former Bryn (or Brynne) Hall was the seat of the Gerard family beginning in the thirteenth century or earlier. It was a \"safe house\" for the English Roman Catholic martyr and saint Edmund Arrowsmith and his hand was reportedly preserved there after his execution. The house, dating to the fourteenth century, has now completely collapsed and remaining stones been cleared.\nThe Unitarian Park Lane Chapel in Wigan Road was built in 1697, though its congregation was founded in 1662. It is the oldest Non-conformist chapel and congregation in the whole district. By the nineteenth century Park Lane was only one of nine non-conformist chapels in the heavily recusant area."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Bryn",
                        "_text": "Allt neu fynydd bychan yw bryn. Yn ogystal â bod yn elfen gyffredin iawn mewn enwau lleoedd ceir enghreifftiau ohono ar ben ei hun fel enw lle:\nCymru\nBryn (Bannau Brycheiniog); Cyfeirnod grid OS: SO073227\nBryn, Castell-nedd Port Talbot\nBryn, Llanelli\nBryn-y-Gefeiliau\nBryn-crug\nBryn Euryn\nBryn Iwan\nBryn Celli Ddu\nLlanfair-ar-y-bryn\nBryn Gwyn\nBrynrefail\nBryniau Clwyd\nLloegr\nBryn, Swydd Amwythig\nBryn, Wigan\nCyffredinol\nbryngaer\nEnw personol Cymraeg ydy Bryn, hefyd. Mae enghreifftiau o nod yn cynnwys:\nBryn Fôn\nBryn Terfel"
                    }
                ]
            },
            {
                "id": "carmarthenshire#bryn iwan",
                "name": "Bryn Iwan",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Bryn Iwan",
                    "_text": "Pentref bychain yng ngogledd Sir Gaerfyrddin ydy Bryn Iwan. Lleolir tua thair milltir o bentref Trelech."
                }
            },
            {
                "id": "carmarthenshire#bryn myrddin",
                "name": "Bryn Myrddin",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Bryn Myrddin",
                    "_text": "Bryn yn Sir Gaerfyrddin yw Bryn Myrddin. Ceir bryngaer gynhanesyddol ar ei gopa. Fe'i lleolir ger y Felin-wen, rhwng Abergwili a Nantgaredig tua 2.5 milltir i'r dwyrain o dref Caerfyrddin, ac i'r gogledd o'r briffordd A40 yn Nyffryn Tywi; cyfeirnod OS: SN454215."
                }
            },
            {
                "id": "carmarthenshire#brynamman",
                "name": "Brynamman",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Brynamman",
                    "_text": "Brynamman (Welsh: Brynaman) is a village sitting on the south facing side of the Black Mountain, part of the Brecon Beacons National Park. The village is split in two into Upper Brynamman and Lower Brynamman by the River Amman which also acts as the boundary between the counties of Carmarthenshire and Neath Port Talbot (the old county of Glamorganshire). Ruins of stone dwellings (possibly prehistoric), an early type of lime kiln and rectangular medieval buildings found on the mountain show that man has lived in this area for a long time.\nIn the 18th century the industrial revolution, in the form of iron and tin works and especially coal mining, transformed the area from a small, scattered farming community to a built-up, highly populated commercial centre. The Welsh language was at the fore and the successful participation in local and national eisteddfodau by numerous village people, choirs and bands put Brynamman on the map.\nIt was once a thriving village, with three bank branches on Station Road in Upper Brynamman alone. Today there are no industries in or around the village, its inhabitants having to commute to Ammanford, Swansea or Llanelli for work. The whole area has become more attractive to live in especially for those who love the countryside and the wild open areas available for walking on the Black Mountain. It is still a stronghold for the Welsh language and children are taught it in school and it is spoken by a high majority of the local people.\nBrynamman was previously known as Y Gwter Fawr (Welsh: \"The Big Gutter\"), the name was changed when the railway from Ammanford reached the village. The traveller and writer George Borrow describes aspects of Gwter Fawr in the mid-nineteenth century in his book Wild Wales which was published in 1862.\nBrynamman Golf Club (now defunct) first appeared in the mid 1920s, it continued into the 1930s."
                }
            },
            {
                "id": "carmarthenshire#bryndu",
                "name": "Bryndu"
            },
            {
                "id": "carmarthenshire#burry port (porth tywyn)",
                "name": "Burry Port (Porth Tywyn)"
            },
            {
                "id": "carmarthenshire#bwlch-newydd",
                "name": "Bwlch-newydd"
            },
            {
                "id": "carmarthenshire#bynea",
                "name": "Bynea",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Bynea",
                        "_text": "Bynea (\/ˈbɪnjə\/ BIN-yə) is a village close to the River Loughor in Carmarthenshire, Wales. It also forms a electoral ward for the purposes of elections to Carmarthenshire County Council.\nThis was an agricultural area until the turn of the twentieth century, when it became heavily industralised with coal mines and steelworks. Bynea runs into the village of Llwynhendy, and between the two there are four places of worship, and a number of pubs.\nTerry Davies, the rugby union player, is from this area and Kel Coslett the Rugby League legend was born there.\nThe village is served by Bynea railway station with trains operating to Swansea to the south and Shrewsbury to the north."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Bynea",
                        "_text": "Pentref yn agos i'r afon Llwchwr yw Bynea yn Sir Gaerfyrddin. Ardal amaethyddol oedd yma i ddechrau ac yna ar droad y ganrif diwethaf roedd yn le prysur diwydiannol gyda phwll glo ac wedi hynny gwaith dur. Erbyn heddiw mae'r diwydiannau trwm yma wedi hen ddiflannu. Mae'r pentref yn rhedeg mewn i bentref Llwynhendy a rhwng y ddau le mae yna 4 capel ac eglwys, a nifer o dafarndai. Mae Gorsaf reilffordd Bynea ar llinell Rheilffordd Calon Cymru.\nMae Terry Davies y chwaraewr rygbi yn enedigol o'r ardal ac yn dal i fyw nepell i ffwrdd."
                    }
                ]
            },
            {
                "id": "carmarthenshire#caerfyrddin (carmarthen)",
                "name": "Caerfyrddin (Carmarthen)"
            },
            {
                "id": "carmarthenshire#caio",
                "name": "Caio",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Caio",
                    "_text": "Caio may refer to:\nBrazilian footballers\nAntônio Caio da Silva Sousa\nCaio Alves\nCaio Ribeiro Decoussau\nCaio Canedo Corrêa\nWolnei Caio (born 1968)\nOther\nCaio, Carmarthenshire, a village in west Wales\nCaio Blat, Brazilian actor\nCaio Richetti, Brazilian rugby player\nCaio (moth), a moth genus"
                }
            },
            {
                "id": "carmarthenshire#capel",
                "name": "Capel",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Capel",
                        "_text": "Capel may refer to:"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Capel",
                        "_text": "Adeilad ar gyfer gwasanaethau crefyddol Cristnogol yw Capel. Daw'r gair o'r Lladin capella, bychanig y gair cappa, \"mantell\". Y cysylltiad yw mantell Sant Martin o Tours (316 - 397), a gedwid fel crair crefyddol, ac a roddodd yr enw i'r adeilad.\nYn yr Eglwys Gatholig, defnyddir \"capel\" fel term am adeilad lle gellir gweinyddu'r offeren, ond nad yw'n eglwys y plwyf. Defnyddir y term hefyd am ystafell ochr mewn eglwys. Yng Nghymru, dyma'r term arferol ar gyfer lle o addoliad Ymneilltuol, a cheir nifer fawr ohonynt."
                    }
                ]
            },
            {
                "id": "carmarthenshire#capel dewi",
                "name": "Capel Dewi",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Capel Dewi",
                        "_text": "Capel Dewi may refer to:\nCapel Dewi, Aberystwyth, a hamlet near Aberystwyth, Ceredigion, Wales\nCapel Dewi, Carmarthenshire, a village in the community of Llanarthney, Carmarthenshire, Wales\nCapel Dewi, Llandysul, a village in the community of Llandysul, Ceredigion, Wales"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Capel Dewi",
                        "_text": "Gallai Capel Dewi gyfeirio at:\nCapel Dewi, Aberystwyth, pentref ger Aberystwyth, Ceredigion\nCapel Dewi, Llandysul, pentref ger Llandysul, Ceredigion\nCapel Dewi, Sir Gaerfyrddin"
                    }
                ]
            },
            {
                "id": "carmarthenshire#capel gwynfe",
                "name": "Capel Gwynfe"
            },
            {
                "id": "carmarthenshire#capel hendre",
                "name": "Capel Hendre",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Capel Hendre",
                    "_text": "Pentref yn Sir Gaerfyrddin yw Capel Hendre. Fe'i lleolir yn ne-ddwyrain y sir tua 3 milltir i'r de-orllewin o dref Rhydaman ar y ffordd B4297. Mae'n rhan o gymuned Llandybie."
                }
            },
            {
                "id": "carmarthenshire#capel issac",
                "name": "Capel Issac"
            },
            {
                "id": "carmarthenshire#capel iwan",
                "name": "Capel Iwan",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Capel Iwan",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Capel Iwan. Fe'i lleolir tua 3 milltir a hanner i'r de o dref Castell Newydd Emlyn, yng ngogledd-orllewin y sir, am y ffin rhwng Sir Gaerfyrddin a Sir Benfro.\nLlifa afon Mamog, ffrwd fechan sy'n llifo i Afon Cuch gerllaw, heibio yn agos i Gapel Iwan."
                }
            },
            {
                "id": "carmarthenshire#capel seion",
                "name": "Capel Seion",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Capel Seion",
                    "_text": "Gall Capel Seion gyfeirio at:"
                }
            },
            {
                "id": "carmarthenshire#carmarthen (caerfyrddin)",
                "name": "Carmarthen (Caerfyrddin)"
            },
            {
                "id": "carmarthenshire#carmel",
                "name": "Carmel",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Carmel",
                        "_text": "Carmel in the Bible refers to two distinct places:\nMount Carmel, coastal mountain range in Israel overlooking the Mediterranean Sea\nCarmel (biblical settlement), an ancient Israelite town in Judea\nThe word Carmel (Hebrew language: כַּרְמֶל) means \"fresh\" (planted), or \"vineyard\" (planted) and Karmiel (Hebrew: כַּרְמִיאֵל) is a portmanteau meaning \"God's Vineyard\".\nIn modern times, the name was also given to:"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Carmel",
                        "_text": "Gallai Carmel gyfeirio at un o sawl peth:"
                    }
                ]
            },
            {
                "id": "carmarthenshire#carway",
                "name": "Carway",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Carway",
                    "_text": "For Carway, Alberta, see Carway, Alberta.\n\nCarway (Welsh: Carwe) is a village situated to the north of the town of Llanelli in the county of Carmarthenshire, Wales, in the Gwendraeth Fawr valley. It is part of the Llanelli Rural community.\nOpen-cast mining operations once operated to the north and south of the village. The northern area has been reclaimed and re-developed as the Glyn Abbey Golf Club. The former mining area south of the village at Ffos Las is currently being reclaimed and is being redeveloped with a new racecourse (opened on 18 June 2009) and housing."
                }
            },
            {
                "id": "carmarthenshire#castell-y-rhingyll",
                "name": "Castell-y-rhingyll"
            },
            {
                "id": "carmarthenshire#cefn-y-pant",
                "name": "Cefn-y-pant",
                "lat": "51.896989",
                "lon": "-4.629489",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cefn-y-pant",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Cefn-y-pant. Fe'i lleolir tua 6 milltir i'r gogledd o Hendy-gwyn ar Daf, yng ngorllewin y sir. Mae'n rhan o gymuned Llanboidy."
                }
            },
            {
                "id": "carmarthenshire#cefncaeau",
                "name": "Cefncaeau"
            },
            {
                "id": "carmarthenshire#cefneithin",
                "name": "Cefneithin",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cefneithin",
                        "_text": "Cefneithin is a village in Carmarthenshire, Wales, in the Carmarthenshire coalfield area. It lies just off the A48 road, 7 miles north west of Ammanford and 9 miles north of Llanelli. The Gwendraeth Fawr river flows nearby. It has a Post Office, shop, a village hall and primary and secondary schools.\nThe village is notable as the birthplace of three of the greatest names in Welsh rugby union, Carwyn James, Barry John and Mike Hopkins all of whom played for Cefneithin RFC.\nCefneithin was the birthplace of Ronnie Williams, of Ryan and Ronnie fame.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cefneithin",
                        "_text": "Pentref glofaol yn Sir Gaerfyrddin yw Cefneithin. Saif y pentref ar ffordd gefn ychydig i'r de o'r briffordd A48, saith milltir i'r gogledd-orllewin o dref Rhydaman. Saif yn y maes glo carreg, ac arferai'r diwydiant glo fod yn bwysig iawn yma. Llifa Afon Gwendraeth Fawr gerllaw'r pentref.\nCeir yma swyddfa'r post ac ysgol gynradd, ac yma mae Ysgol Gyfun Maes-yr-yrfa. Mae Cefneithin yn nodedig fel man geni dau o brif enwogion Rygbi'r Undeb Cymru, Carwyn James a Barry John."
                    }
                ]
            },
            {
                "id": "carmarthenshire#cenarth",
                "name": "Cenarth",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cenarth",
                        "_text": "Cenarth is a village, parish and community in Carmarthenshire, adjoining the Cenarth Falls, bordering Ceredigion and Pembrokeshire, Wales."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cenarth",
                        "_text": "Pentref a chymuned yng ngogledd-orllewin Sir Gaerfyrddin yw Cenarth. Saif yn agos i'r ffin a Sir Benfro a Sir Ceredigion, ar lan Afon Teifi, 10 km i'r dwyrain o Aberteifi a 4 km west i'r gorllewin o Gastell Newydd Emlyn. Mae Rhaeadr Cenarth yn adnabyddus. Eglwys Llawddog, Cenarth, oedd canolfan eglwysig bwysicaf cantref Emlyn.\nSaif y Ganolfan Cwrwgl Genedlaethol ger hen felin ddŵr yn dyddio o'r 17eg ganrif ar lan yr afon. Defnyddir cyryglau ar Afon Tefi yn yr ardal yma o hyd."
                    }
                ]
            },
            {
                "id": "carmarthenshire#cilgwyn",
                "name": "Cilgwyn"
            },
            {
                "id": "carmarthenshire#cilsan",
                "name": "Cilsan",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cilsan",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Cilsan. Fe'i lleolir ar lan ogleddol Afon Tywi tua 3 milltir i'r gorllewin o Landeilo, fymryn i'r de o'r A40.\nMae Cilsan yn rhan o blwyf eglwysig Llangathen."
                }
            },
            {
                "id": "carmarthenshire#cilycwm",
                "name": "Cilycwm",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Cilycwm",
                    "_text": "Cilycwm (Welsh: Cil-y-cwm, historically Cîl-y-cwm and Kîlycwm) is a village and parish located in Carmarthenshire, Wales. The community population taken at the 2011 census was 489.\nCilycwm lies on the west bank of Afon Gwenlais, a tributary of the Tywi, north of the town of Llandovery. Pont Dolauhirion, a bridge that crosses the Tywi at the south of the community was designed by William Edward's and is a copy of his famous bridge at Pontypridd. The bridge is a grade I listed structure \nThe parish church of St Michael's is also a grade I listed building."
                }
            },
            {
                "id": "carmarthenshire#cloigyn",
                "name": "Cloigyn"
            },
            {
                "id": "carmarthenshire#clunderwen",
                "name": "Clunderwen",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Clunderwen",
                    "_text": "Pentref a chymuned yn Sir Benfro yw Clunderwen (weithiau Clynderwen yn Saesneg). Saif ar y briffordd A478 rhwng Arberth a phentref Crymych, ychydig i'r gogledd o Arberth.\nDechreuodd y pentref fel gorsaf ar Reilffordd Gorllewin Cymru yn y 19eg ganrif. Tyfodd y pentref presennol o gwmpas yr orsaf. Arferai Clunderwen fod yn Sir Gaerfyrddin, ond yn 2001 daeth yn rhan o Sir Benfro."
                }
            },
            {
                "id": "carmarthenshire#cothi",
                "name": "Cothi"
            },
            {
                "id": "carmarthenshire#court henry",
                "name": "Court Henry"
            },
            {
                "id": "carmarthenshire#croesyceilog",
                "name": "Croesyceilog"
            },
            {
                "id": "carmarthenshire#cross hands",
                "name": "Cross Hands",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cross Hands",
                        "_text": "Cross Hands is a village in Carmarthenshire, Wales about 12 miles from Carmarthen.\nCross Hands Public Hall is one of only three of its kind in Wales. The Public Hall was erected in 1920 and designed by an unknown Italian Designer in the classic Art Deco Style. Fully restored, the Public Hall has a fully functioning stage and cinema screen and is protected as a Grade 2 listed building.\nThe continuous built up area which includes the villages of Cross Hands, Gorslas, Cefneithin and Pen-y-groes had a population of 5,717 in 2011.\nCross hands is a growing residential and employment area and includes the established Cross Hands Food Park to the south west of the A48. A new business park - the Cross Hands Business Park is being developed to the northest of the A48 which the local authority hopes will create 1,000 jobs."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cross Hands",
                        "_text": "Pentref yn Nghwm Gwendraeth yn Sir Gaerfyrddin yw Cross Hands. Ni ymddengys fod enw Cymraeg iddo.\nSaif Cross Hands gerllaw cyffordd y priffyrdd A48 a'r A476, tua 12 milltir i'r dwyrain o dref Caerfyrddin ac i'r gogledd o Lanelli. Ceir parc busnes ar gyrion y pentref, ynghyd a gwasanaethau ar gyfer teithwyr ar yr A48. Yn ôl un stori, cafodd y pentref ei enw oherwydd mai yma y byddai swyddogion carchar yn cyfarfod i gyfnewid carcharorion rhwng carchardai Caerfyrddin ac Abertawe.\nYn weinyddol, mae Cross Hands yn rhan o ward Llannon, sydd hefyd yn cynnwys pentrefi Tymbl a Llannon.\nGerllaw ceir Parc Coetir y Mynydd Mawr."
                    }
                ]
            },
            {
                "id": "carmarthenshire#cross inn",
                "name": "Cross Inn",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cross Inn",
                    "_text": "Ceir tri lle o'r enw Cross Inn yng Nghymru:\nCross Inn, canolbarth Ceredigion, pentref tua 6 milltir i'r dwyrain o Aberaeron\nCross Inn, de Ceredigion, pentref ger Ceinewydd\nCross Inn, Rhondda Cynon Taf, pentref yn Rhondda Cynon Taf"
                }
            },
            {
                "id": "carmarthenshire#crosshands",
                "name": "Crosshands"
            },
            {
                "id": "carmarthenshire#crugybar",
                "name": "Crugybar",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Crugybar",
                    "_text": "Crugybar is a village in Carmarthenshire located between Talley and Pumsaint. It is roughly of equal distance from Lampeter, Llandovery and Llandeilo.\nIt is within the parish of Llanwrda.\nThe Grade II listed, independent Congregational Chapel\/Eglwys Annibynnol was established c1688 and most recently refitted in 1893.\nAt the far end of the village with the Bridgend Inn is the local petrol station that doubles as the village shop, Down Home Stoves and Felin Newydd, a water-driven corn mill. The mill is no longer open to the public. When the mill was renovated back to working order in the 1980s, writing was found on the walls with reference to the then Davies family owners whose daughter and son-in-law emigrated to Patagonia, Argentina in the late 19th century.\nBehind the Bridgend Inn runs a one-way street, a continuation of the road from Caio to Crugybar and likely to have been used by drovers taking livestock from Carmarthenshire on to the English border towns for sale."
                }
            },
            {
                "id": "carmarthenshire#crwbin",
                "name": "Crwbin",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Crwbin",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Crwbin. Fe'i lleolir yn ne'r sir tua 7 milltir i'r gogledd-ddwyrain o dref Cydweli a thua'r un pellter i'r de o dref Caerfyrddin ar y ffordd B4306. Mae'n rhan o ardal Cwm Gwendraeth ac yng nghymuned Llangyndeyrn."
                }
            },
            {
                "id": "carmarthenshire#cwm capel",
                "name": "Cwm Capel"
            },
            {
                "id": "carmarthenshire#cwm-cou",
                "name": "Cwm-cou",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwm-cou",
                    "_text": "Pentref yn ne Ceredigion yw Cwm-cou (ceir y llurguniad Saesneg Cwmcoy ar rai mapiau). Fe'i lleolir ar y ffordd B5470 tua milltir a chwarter i'r gogledd-orllewin o dref Castell Newydd Emlyn.\nGorwedd y pentref wrth droed y bryniau isel ar lan ogleddol Afon Teifi lle daw Afon Dulas i lawr o'r gogledd i'w chymer ar afon Teifi."
                }
            },
            {
                "id": "carmarthenshire#cwm-mawr",
                "name": "Cwm-mawr"
            },
            {
                "id": "carmarthenshire#cwm-miles",
                "name": "Cwm-miles",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwm-miles",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Cwm-miles. Mae tarddiad yr enw yn ansicr ac ar hyn o bryd nid yw wedi cael ei dderbyn fel enw Cymraeg swyddogol gan Gyngor Sir Gaerfyrddin. Fe'i lleolir tua 5 milltir i'r gogledd-orllewin o Hendy-gwyn ar Daf, yn ne-orllewin y sir, ar ffordd wledig rhwng Efail-wen a Henllan Amgoed."
                }
            },
            {
                "id": "carmarthenshire#cwmann",
                "name": "Cwmann",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Cwmann",
                    "_text": "Cwmann is a small village in Wales near Lampeter, just on the Ceredigion border with Carmarthenshire. Cwmann is on the Carmarthenshire side of the border.\nCwmann is home to the Cwmanne Tavern.\nCwmann sits on the banks of the River Teifi (known in Welsh as \"Afon Teifi\")."
                }
            },
            {
                "id": "carmarthenshire#cwmbach",
                "name": "Cwmbach",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Cwmbach",
                    "_text": "Cwmbach is a village and community near Aberdare, in the county borough of Rhondda Cynon Taf, Wales. Cwmbach means 'Little Valley' in Welsh (Cwm = valley, Bach = little).\nAccording to the 2011 census, Cwmbach has a population of 4,283.\nPrior to the industrial revolution, Cwmbach consisted of a number of farms and homesteads; in the mid-19th century it became a significant coal mining community."
                }
            },
            {
                "id": "carmarthenshire#cwmdu",
                "name": "Cwmdu",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cwmdu",
                        "_text": "Cwmdu may refer to:\nCwmdu, Swansea\nCwmdu, Carmarthenshire\nCwmdu, Powys"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwmdu",
                        "_text": "Gallai Cwmdu neu Cwm-du gyfeirio at:\nCwmdu, Abertawe\nCwmdu, Powys\nCwm-du, Sir Gaerfyrddin\nGweler hefyd\nLlanfihangel Cwm Du gyda Bwlch a Chathedin"
                    }
                ]
            },
            {
                "id": "carmarthenshire#cwmduad",
                "name": "Cwmduad",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cwmduad",
                        "_text": "Cwmduad (Welsh \"Cwm\" valley + \"duad\" (river Duad)) is a village in Carmarthenshire, West Wales.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwmduad",
                        "_text": "Pentref bychan yn Sir Gaerfyrddin yw Cwmduad. Fe'i lleolir yng ngorllewin y sir ar y ffordd A484 tua hanner ffordd rhwng Llandysul, i'r gogledd, a thref Caerfyrddin i'r de. Mae'n rhan o blwyf eglwysig a chymuned Cynwyl Elfed.\nSaif y pentref ar lan afon Duad, un o ledneintiau Afon Gwili."
                    }
                ]
            },
            {
                "id": "carmarthenshire#cwmdwr",
                "name": "Cwmdwr"
            },
            {
                "id": "carmarthenshire#cwmfelin boeth",
                "name": "Cwmfelin Boeth"
            },
            {
                "id": "carmarthenshire#cwmfelin mynach",
                "name": "Cwmfelin Mynach",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Cwmfelin Mynach",
                    "_text": "Cwmfelin Mynach is a tiny Carmarthenshire village. It has a population of only 64 residents.\nThe river Gronw runs through the centre of the village under a stone bridge. In the medieval period the river was used to drive a corn mill. 'Cwmfelin Mynach' means Valley (cwm) of the Monks' (Mynach) Mill (Felin). It was founded in the 6th century by the Cistercian monks or Whitefriars. These monks gave their name to the nearby town, Whitland. Outside Whitland, it is the oldest Cistercian monastery in the UK. Much of the limestone has been looted or used for other buildings after Henry VIII's dissolution of the monasteries. Some of the stone from Whitland Priory is suspected to have been used for the building of St. Brynach's Church, Llanboidy.\nNotable curiosities in this bilingual Welsh and English speaking village include the practice of baptising in the river. The river Gronw which starts at Blaenwaun (one of the highest inhabited villages in the West Wales peninsula) runs through Cwmfelin Mynach. At the lowest point in the village, persons are brought down stone steps and immersed in the river. The steps, quarried from local slate, can still be seen near the apex of the 'U' bend on a minor country lane heading north east (co-oridinates aproxminately lat 51°53'44.11\"N. Long 4°34'20.75\"W).\nRemnants of two small disused slate quarries can still be seen, hidden within trees and vegetation.\nThe remains of a cock-fighting bunker is visible deep in a beechwood. This practise has not gone on for many years."
                }
            },
            {
                "id": "carmarthenshire#cwmffrwd",
                "name": "Cwmffrwd",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Cwmffrwd",
                    "_text": "Cwmffrwd is a village in Carmarthenshire, Wales, located around two miles (3.2 km) south of Carmarthen.\nCwmffrwd is mainly a 20th-century settlement dominating the small river Nant Cwmffrwd, with some 19th-century elements. Its main access road, Heol Nantyglasdwr, connects the village to the A484 and leads directly into the main residential street, Maesglasnant.\nThe village is known in the English-speaking world for having a name spelled without vowels. In the Welsh language, however, the name is considered to have seven letters rather than eight ('ff' is treated as a single letter), while both 'w's are considered vowels.\nIt has never been clarified if the stone bridge over the river Nant Pibwr north of Cwmffrwd, at the old highway leading to Carmarthen, had been built on remains of Roman foundations."
                }
            },
            {
                "id": "carmarthenshire#cwmgors",
                "name": "Cwmgors",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Cwmgors",
                    "_text": "Cwmgors is a village in the county of Glamorgan, and administered as part of the borough of Neath Port Talbot, Wales. It is part of the community of Gwaun-cae-Gurwen. It lies within the unitary authority of Neath Port Talbot and the ceremonial county of West Glamorgan. Its nearest postal town is Ammanford so addresses in Cwmgors will read as though the village were in the unitary authority of Carmarthenshire and the ceremonial county of Dyfed.\nCwmgors sits in the Neath constituency and is thus represented in Parliament by Peter Hain and in the National Assembly for Wales by Gwenda Thomas, Bethan Jenkins, Peter Black, Byron Davis, and Suzy Davies.\nIts church, Llanfair, falls under the Diocese of St David's. Its Welsh-medium primary school feeds to three local comprehensive schools, namely Ysgol Gyfun Ystalyfera for fully Welsh-medium education, Ysgol Uwchradd Dyffryn Aman for Welsh- and English-medium education, and Cwmtawe Community Comprehensive School for English-medium education. There are few other amenities in the village, so residents would usually travel to Gwaun-cae-Gurwen for essentials, and to the nearby towns of Ammanford or Pontardawe for other items. Swansea is situated 13 miles from the village."
                }
            },
            {
                "id": "carmarthenshire#cwmgwili",
                "name": "Cwmgwili",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwmgwili",
                    "_text": "Pentref yn Sir Gaerfyrddin yw Cwmgwili. Fe'i lleolir yn ne-ddwyrain y sir tua 4 milltir i'r gorllewin o dref Rhydaman ger y ffordd A48. Mae'n rhan o gymuned Llandybie."
                }
            },
            {
                "id": "carmarthenshire#cwmhiraeth",
                "name": "Cwmhiraeth",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwmhiraeth",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Cwmhiraeth. Fe'i lleolir ar ffordd wledig tua milltir i'r de-orllewin o Ddre-fach Felindre, yng ngogledd-orllewin y sir."
                }
            },
            {
                "id": "carmarthenshire#cwmifor",
                "name": "Cwmifor",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwmifor",
                    "_text": "Pentref bychan yng nghanol Sir Gaerfyrddin yw Cwmifor. Fe'i lleolir tua 3 milltir a hanner i'r gogledd-ddwyrain o Landeilo, ar ffordd yr A40 i gyfeiriad Llanymddyfri. Y pentref agosaf yw Maenordeilo.\nLlifa Afon Tywi heibio i'r de o'r pentref. Mae'n rhan o blwyf Llandeilo Fawr."
                }
            },
            {
                "id": "carmarthenshire#cwmisfael",
                "name": "Cwmisfael",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwmisfael",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Cwmisfael. Fe'i lleolir yn ne'r sir tua hanner ffordd rhwng Cross Hands a thref Caerfyrddin ar groesffordd wledig. Y pentref agosaf yw Llanddarog, tua milltir i'r gogledd. Mae'n rhan o ardal Cwm Gwendraeth."
                }
            },
            {
                "id": "carmarthenshire#cwmpengraig",
                "name": "Cwmpengraig",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Cwmpengraig",
                    "_text": "Cwmpengraig is a rural hamlet in Wales, located in the Teifi Valley approximately 1.5 miles (2.4 km) from the village of Drefach Velindre.\n\n"
                }
            },
            {
                "id": "carmarthenshire#cwrt-y-cadno",
                "name": "Cwrt-y-cadno",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwrt-y-cadno",
                    "_text": "Pentref yn Sir Gaerfyrddin yw Cwrt-y-cadno neu Cwrtycadno. Lleolir ar lôn gefn, i'r gogledd o Pumsaint a Llandre oddi ar ffordd yr A842 rhwng Llanbedr Pont Steffan a Llanwrda. Dynodir canol y pentref gan Gapel Methodistiaidd Cwrt-y-cadno, a adeiladwyd tua 1800.\nBu Cwrt-y-cadno yn groesffordd bwysig unwaith, gan ei fod ar lwybr y porthmyn o Geredigion i farchnad Smithfield yn Lloegr. Yng Nghwrtycadno byddai'r gwartheg yn cael eu pedoli er mwyn amddiffyn eu carnau, a lle bu dŵr a phorfa ar gael ar gyfer y gyr. Roedd hen-deidiau Geraint Griffiths yn ofaint yn ffermydd Cwrt a Nant Gwasanaeth am sawl cenhedlaeth.\nAr ddiwedd y 18fed ganrif a dechrau'r ganrif olynol, roedd Cwrt-y-cadno yn adnabyddus trwy Gymru fel cartref y Dr John Harries (m. 1839), gŵr anghyffredin a ystyrid yn ddewin, neu Ddyn Hysbys, a allai wella afiechydon o bob math, tawelu ysbrydion drwg a darogan y dyfodol. Credid fod ganddo lyfr o swyngyfareddau.\nMae'r Afon Cothi yn llifo drwy'r pentref; yma mae'n dechrau lledaenu wedi tarddu tua pum milltir i'r gogledd.\nMae plant y pentref yn mynychu'r ysgol gynradd Gymraeg leol, Ysgol Gynradd Caio."
                }
            },
            {
                "id": "carmarthenshire#cydweli (kidwelly)",
                "name": "Cydweli (Kidwelly)"
            },
            {
                "id": "carmarthenshire#cynheidre",
                "name": "Cynheidre",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cynheidre",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin, de Cymru, yw Cynheidre. Gorwedd tua 5 milltir i'r gogledd-orllewin o dref Llanelli, ger Pontyberem.\nMae Afon Lliedi yn tarddu gerllaw, ar lethrau Mynydd Sylen."
                }
            },
            {
                "id": "carmarthenshire#cynin",
                "name": "Cynin"
            },
            {
                "id": "carmarthenshire#cynwyl elfed",
                "name": "Cynwyl Elfed",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cynwyl Elfed",
                        "_text": "Cynwyl Elfed (sometimes Conwyl) is a village and community in the county of Carmarthenshire, Wales. The community includes the villages of Cynwyl Elfed, Blaenycoed and Cwmduad. It is situated about 5 miles (8.0 km) north of Carmarthen and had a population of 953 in 2001, increasing to 1,044 at the 2011 Census.\nThe area around the village has yielded a significant number of Roman artefacts, including a statue of Diana. It was the most important centre of the commote of Elfed in the Middle Ages.\nCynwyl Elfed transmitting station stands on high ground to the north of the village."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cynwyl Elfed",
                        "_text": "Pentref, cymuned a phlwyf eglwysig yn Sir Gaerfyrddin yw Cynwyl Elfed. Saif ar y briffordd A484 i'r gogledd o dref Caerfyrddin, ger Afon Gwili. Cynwyl Elfed oedd canolfan bwysicaf cwmwd Elfed yn yr Oesoedd Canol."
                    }
                ]
            },
            {
                "id": "carmarthenshire#cywyn",
                "name": "Cywyn"
            },
            {
                "id": "carmarthenshire#dafen",
                "name": "Dafen",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Dafen",
                    "_text": "Dafen may refer to:"
                }
            },
            {
                "id": "carmarthenshire#dinas",
                "name": "Dinas",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Dinas",
                        "_text": "Dinas may refer to :\nDinas (weevil), a beetle genus in the tribe Sciaphilini"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Dinas",
                        "_text": "Dinas yw lle trefol."
                    }
                ]
            },
            {
                "id": "carmarthenshire#dre-fach",
                "name": "Dre-fach"
            },
            {
                "id": "carmarthenshire#drefach",
                "name": "Drefach",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Drefach",
                    "_text": "Gall Dre-fach neu Drefach gyfeirio at:\nDre-fach, Ceredigion\nDre-fach, Cwm Gwendraeth\nDre-fach Felindre"
                }
            },
            {
                "id": "carmarthenshire#dryslwyn",
                "name": "Dryslwyn",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Dryslwyn",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw'r Dryslwyn. Fe'i lleolir ar lan ogleddol Afon Tywi tua hanner ffordd rhwng Caerfyrddin i'r gorllewin a Llandeilo i'r dwyrain. Fymryn i'r gogledd ceir pentref Felindre.\nAr graig ger y pentref ceir adfeilion Castell y Dryslwyn, a fu am gyfnod yn safle prif lys tywysogion Deheubarth. Codwyd y castell gwreiddiol gan Rhys Gryg, un o feibion yr Arglwydd Rhys, yn y 1220au."
                }
            },
            {
                "id": "carmarthenshire#dyffryn",
                "name": "Dyffryn",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Dyffryn",
                        "_text": "Dyffryn or Duffryn may refer to one of these places in Wales:\nDuffryn housing estate in Newport\nDyffryn, Bridgend\nDyffryn Cennen, Carmarthenshire\nDyffryn, Ceredigion\nDyffryn Cellwen, Neath Port Talbot\nDyffryn Clydach, Neath Port Talbot\nDyffryn, Pembrokeshire\nDyffryn, Vale of Glamorgan\nDyffryn Gardens"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Dyffryn",
                        "_text": "Am y pentref yn Ynys Môn, gweler Y Fali; am yr ystad yng Nghasnewydd gweler Dyffryn, Casnewydd: gweler hefyd Cwm.\n\nTirffurf yw dyffryn, sef ardal o dir sydd yn is na thir cyfagos, ac yn amrywio o ran arwynebedd o ychydig filltiroedd sgwâr i gannoedd o filltiroedd sgwâr. Mae'n arferol, er nad yn angenrheidiol, i ddyffryn gynnwys afon yn llifo trwyddo, a'r afon yn rhoi enw i'r dyffryn."
                    }
                ]
            },
            {
                "id": "carmarthenshire#efailwen",
                "name": "Efailwen"
            },
            {
                "id": "carmarthenshire#felin newydd",
                "name": "Felin Newydd"
            },
            {
                "id": "carmarthenshire#felindre",
                "name": "Felindre",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Felindre",
                        "_text": "Felindre (English: Velindre) is a rural village in south Wales. The village can be found in the far north of Swansea, in the electoral ward of Mawr.\nThe nearby Lower Lliw Reservoirs are a popular venue for walking and fishing. The water mill in the village was working until the late 1960s, there was also an abbatoir and a post office in the village. It also had three shops, and two mobile shops which used to come around the village twice a week. Again this was in the late 60's and 70's. The school in the village is Welsh speaking. There is also a public house in the village, the Shepherds Inn.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Felindre",
                        "_text": "Ceir sawl pentref yng Nghymru o'r enw Felindre:\nFelindre, Ceredigion\nFelindre, Powys (2):\nFelindre, Maldwyn\nFelindre, Brycheiniog\n\nFelindre, Sir Abertawe\nFelindre, Sir Gaerfyrddin (4):\nFelindre, ger Llangadog\nFelindre, ger Llanegwad\nFelindre, ger Llansadwrn\nFelindre, ger Gastell Newydd Emlyn\n\nGweler hefyd\nDre-fach Felindre"
                    }
                ]
            },
            {
                "id": "carmarthenshire#felinfoel",
                "name": "Felinfoel",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Felinfoel",
                    "_text": "Felinfoel (Welsh: Felin-foel) is a small village and community council ward on the River Lliedi on the northern border of Llanelli, Carmarthenshire, West Wales, with a population of about 2,000.\nThe Felinfoel Brewery, home of Double Dragon Ale, is the oldest in Wales. It was the first brewery outside the US to sell beer in cans.\nThe village is renowned for its close community and ties with many famous names that have starred in past Llanelli RFC line-ups. The rugby union fly-half Phil Bennett, who played for Llanelli, Wales and the British Lions, is one of Felinfoel's most famous residents.\nFelinfoel is part of the Llanelli Rural ward of Carmarthenshire County Council. It is generally considered a suburb of the town of Llanelli."
                }
            },
            {
                "id": "carmarthenshire#felingwmisaf",
                "name": "Felingwmisaf"
            },
            {
                "id": "carmarthenshire#felingwmuchaf",
                "name": "Felingwmuchaf"
            },
            {
                "id": "carmarthenshire#ferryside",
                "name": "Ferryside",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Ferryside",
                    "_text": "Ferryside (Welsh: Glan y Fferi) is a village in the community of St Ishmael, Carmarthenshire, Wales. It is 8.5 miles (13.7 km) south of Carmarthen near the mouth of the River Tywi and close to sandy beaches. Originally a ferry crossing, then becoming a fishing village, it has developed as a holiday and retirement area. The village has its own lifeboat station and was the first village in the UK to switch from analogue to digital television."
                }
            },
            {
                "id": "carmarthenshire#ffairfach",
                "name": "Ffairfach",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Ffairfach",
                    "_text": "Ffairfach is a village half a mile south of the market town of Llandeilo in the eastern part of Carmarthenshire, Wales. It is located close to the confluence of the Afon Cennen and the River Towy."
                }
            },
            {
                "id": "carmarthenshire#ffaldybrenin",
                "name": "Ffaldybrenin",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ffaldybrenin",
                        "_text": "Ffaldybrenin is a community formed around the Parish Church in Carmarthenshire, Wales. In the late 1800s Church and State separated but the same area is now represented as a local authority by the Ffaldybrenin Community Council and the Church by the Parochial Church Council."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ffaldybrenin",
                        "_text": "Pentref bychan yn Sir Gaerfyrddin yw Ffaldybrenin (hefyd: Ffald-y-brenin). Fe'i lleolir yng ngogledd y sir ar ffordd wledig tua 2 milltir i'r gorllewin o Ffarmers, a thua 5 milltir i'r de-ddwyrain o dref Llanbedr Pont Steffan.\nCodwyd capel Ffald-y-brenin yn 1833, capel sydd â'i le yn hanes Methodistiaeth Sir Gâr.\nTreuliodd y golygydd James Rhys Jones (1813-1889), a adnabyddir yn well fel 'Kilsby Jones' neu 'Kilsby', gyfnod fel ysgolfeistr yn Ffald-y-brenin."
                    }
                ]
            },
            {
                "id": "carmarthenshire#ffarmers",
                "name": "Ffarmers",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ffarmers",
                        "_text": "Ffarmers is a village near Lampeter, in the north of Carmarthenshire, Wales. It was named after the old \"Farmers' Arms\" public house, which is now closed. The double \"f\" in the name comes from the Welsh language spelling of the \"f\" sound in \"farmers\". The village stands on the old Roman road, Sarn Helen, which was used by cattle drovers to take their livestock from Wales to Smithfield market in London.\nThe small rivers Afon Twrch and Afon Fanafas flow to the south of the village and join the River Tywi between Llandeilo and Carmarthen."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ffarmers",
                        "_text": "Pentref yn Sir Gaerfyrddin ger Llanbedr Pont Steffan ydy Ffarmers. Cafodd ei enwi ar ôl tafarn y \"Farmers' Arms\", ond mae'r dafarn ei hun wedi cau ers blynyddoedd. Mae'r pentref ar hen ffordd rhufeinig (o'r enw Sarn Helen), ac roedd pobl yn pasio trwy'r pentref wrth fynd â'u gwartheg i farchnadoedd Lloegr.\nMae'r afonydd bychain Afon Twrch ac Afon Fanafas yn llifo ger y pentref, tuag at y de, ac yn ymuno ag Afon Tywi rhwng Llandeilo a Chaerfyrddin."
                    }
                ]
            },
            {
                "id": "carmarthenshire#fforest",
                "name": "Fforest",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Fforest",
                    "_text": "Fforest is a Welsh word and frequent place-name element meaning 'forest'.\nFor the Carmarthenshire village, west of Pontarddulais, see Hendy\nFor the hill north of Llandovery, Carmarthenshire, see Fforest (Carmarthenshire)"
                }
            },
            {
                "id": "carmarthenshire#ffynnon",
                "name": "Ffynnon",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Ffynnon",
                    "_text": "Tarddiad neu fan lle mae dŵr yn codi o'r ddaear ydy ffynnon; twll yn y ddaear, fel arfer.\nTyfodd rhai trefi yn ystod y 19eg ganrif o amgylch ffynhonnau iachusol, trefi megis Llandrindod ym Mhowys gan y credir eu bônt yn iachusol."
                }
            },
            {
                "id": "carmarthenshire#ffynnon-ddrain",
                "name": "Ffynnon-ddrain",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Ffynnon-ddrain",
                    "_text": "Ffynnon-ddrain is a settlement in Carmarthenshire, Wales."
                }
            },
            {
                "id": "carmarthenshire#five roads",
                "name": "Five Roads",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Five Roads",
                    "_text": "Five Roads (Welsh: Pum Heol) is a hamlet in Carmarthenshire, Wales near the town of Llanelli.\nIt is situated on the B4309 Llanelli to Carmarthen road, about five miles from the former and ten miles from the latter.\nThe name of the village comes from the fact that there are five roads leading off what is known as The Square, the central portion of the village centred on the main road.\nThe village has two pubs, The Stag, situated centrally on the main road, and the Waun Wyllt 1\/4 mile distant in the neighbouring hamlet of Horeb, which abuts Five Roads.\nThe Stag pub is famous as the meeting place of the Rebecca Rioters who gathered there to plan raids in the 18th Century. Prior to its refurbishment in 2007 the pub operated a two-bar system with the names of the Bar and Lounge reflecting its Rebecca history, being named the Dai'r Cantwr Bar and Shoni Sguborfawr Lounge after two of the ringleaders.\nA blue plaque was unveiled at the pub in 2008 as part of anniversary celebrations.\nFive Roads is home to many famous individuals.\nThe roads which make up the Five Roads are: Rehoboth Road, Horeb Road, Heol Hen, and the entrance and exit of the Main Road, known as Ynys-y-Cwm Road on the Llanelli side and Eclipse Terrace on the Carmarthen side."
                }
            },
            {
                "id": "carmarthenshire#foel-gastell",
                "name": "Foel-gastell"
            },
            {
                "id": "carmarthenshire#four roads",
                "name": "Four Roads"
            },
            {
                "id": "carmarthenshire#furnace",
                "name": "Furnace",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Furnace",
                    "_text": "A furnace is a device used for high-temperature heating. The name derives from Greek word fornax, which means oven.\nIn American English and Canadian English usage, the term furnace on its own refers to the household heating systems based on a central furnace (known either as a boiler, or a heater in British English), and sometimes as a synonym for kiln, a device used in the production of ceramics. In British English, a furnace is an industrial furnace used for many things, such as the extraction of metal from ore (smelting) or in oil refineries and other chemical plants, for example as the heat source for fractional distillation columns.\nThe term furnace can also refer to a direct fired heater, used in boiler applications in chemical industries or for providing heat to chemical reactions for processes like cracking, and is part of the standard English names for many metallurgical furnaces worldwide.\nThe heat energy to fuel a furnace may be supplied directly by fuel combustion, by electricity such as the electric arc furnace, or through induction heating in induction furnaces."
                }
            },
            {
                "id": "carmarthenshire#garnant",
                "name": "Garnant",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Garnant",
                        "_text": "Garnant is a Welsh mining village in the valley of the River Amman in Carmarthenshire, north of Swansea. Like the neighbouring village of Glanamman it experienced a coal-mining boom in the 19th and early 20th centuries, but the last big colliery closed in 1936 and coal has been extracted fitfully since then. The village has the only Commissioners' church built in southwest Wales, traditionally a Methodist region."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Garnant",
                        "_text": "Pentref yn ne-ddwyrain Sir Gaerfyrddin yw Garnant, tua 5 milltir i'r dwyrain o Rydaman ar yr A474. Yn ystod blynyddoedd cynnar yr ugeinfed ganrif roedd Garnant yn lle diwydiannol gyda gwaith tun a nifer o byllau glo. Mae'n gorffwys ar ochr y Mynydd Du, ac yn y rhan fwyaf gorllewinol o Barc Cenedlaethol Bannau Brycheiniog. Mae ganddo gwrs golff cyhoeddus ac ysgol gymunedol newydd."
                    }
                ]
            },
            {
                "id": "carmarthenshire#gellywen",
                "name": "Gellywen"
            },
            {
                "id": "carmarthenshire#glan-y-mor",
                "name": "Glan-y-mor"
            },
            {
                "id": "carmarthenshire#glanaman",
                "name": "Glanaman",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Glanaman",
                    "_text": "Pentref yn ne-ddwyrain Sir Gaerfyrddin yw Glanaman (Seisnigiad: Glanamman). Mae 81% o'r tua 2,000 o drigolion yn medru'r iaith Gymraeg (Cyfrifiad 2001), ac mae'r Gymraeg yn rhan bwysig o fywyd beunyddiol y pentref. Rhed Afon Aman trwy ganol y pentref, sydd yn gwahanu wardiau Tir Coed a Grenig."
                }
            },
            {
                "id": "carmarthenshire#glandy cross",
                "name": "Glandy Cross"
            },
            {
                "id": "carmarthenshire#glanmwrwg",
                "name": "Glanmwrwg"
            },
            {
                "id": "carmarthenshire#glascoed",
                "name": "Glascoed",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Glascoed",
                    "_text": "Glascoed is a village in Monmouthshire, south east Wales, United Kingdom."
                }
            },
            {
                "id": "carmarthenshire#golden grove",
                "name": "Golden Grove",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Golden Grove",
                    "_text": "Golden Grove may refer to:\nPlacenames\nGolden Grove, Antigua and Barbuda, in St. John's parish\nGolden Grove, Carmarthenshire, Wales, a mansion\nsurrounded by Gelli Aur country park\n\nGolden Grove, Jamaica, a village\nGolden Grove, South Australia, a suburb of Adelaide\nOther\nGolden Grove (ship), storeship of the \"First Fleet\" to Australia\nGolden Grove Mine, a large copper, gold, lead, silver and zinc mine in Western Australia\nGolden Grove, a devotional work composed in 1655 by Jeremy Taylor (1613-1667) while living at Gelli Aur"
                }
            },
            {
                "id": "carmarthenshire#gorslas",
                "name": "Gorslas",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Gorslas",
                    "_text": "Gorslas is a community located in Carmarthenshire, Wales. The village is located along the A476 road, just North West of Cross Hands. The village population at the 2011 census is 4,066. Neighbouring villages are Cefneithin and Penygroes. The community is bordered by the communities of: Llanarthney; Llanfihangel Aberbythych; Llandybie; Llannon; Pontyberem; and Llanddarog, all being in Carmarthenshire."
                }
            },
            {
                "id": "carmarthenshire#graig",
                "name": "Graig",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Graig",
                        "_text": "Graig may refer to:\nGraig, Newport, an electoral ward and coterminous community of Newport, South Wales\nGraig, Pontypridd, a historic district of Pontypridd, South Wales\nGraig, Llanarmon-yn-Ial, a Site of Special Scientific Interest in Clwyd, North Wales"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Graig",
                        "_text": "Gall Graig gyfeirio at:\nGraig, Casnewydd\nGraig, Pontypridd, Rhondda Cynon Taf"
                    }
                ]
            },
            {
                "id": "carmarthenshire#greynor",
                "name": "Greynor"
            },
            {
                "id": "carmarthenshire#gwaun-cae-gurwen",
                "name": "Gwaun-Cae-Gurwen",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Gwaun-Cae-Gurwen",
                    "_text": "Gwaun-Cae-Gurwen (Welsh: Gwauncaegurwen) is a village in Neath Port Talbot, South West Wales. Gwaun-Cae-Gurwen is a parish made up of the electoral wards of Gwaun-Cae-Gurwen and Lower Brynamman.\n\n"
                }
            },
            {
                "id": "carmarthenshire#gwaun-leision",
                "name": "Gwaun-Leision"
            },
            {
                "id": "carmarthenshire#gwendraeth fach",
                "name": "Gwendraeth Fach"
            },
            {
                "id": "carmarthenshire#gwernogle",
                "name": "Gwernogle",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Gwernogle",
                    "_text": "Pentref bychan yng ngogledd Sir Gaerfyrddin yw Gwernogle. Fe'i lleolir tua 3 milltir i'r gorllewin o bentref Brechfa, yn y fforest o'r un enw, a thua 9 milltir i'r gogledd-ddwyrain o dref Caerfyrddin.\nGorwedd ym mhlwyf Llanfihangel-rhos-y-corn, ardal o fryniau isel a choedwigoedd mawr, ar lannau afon Clydach, un o ledneintiau afon Cothi, sy'n llifo trwy gwm dwfn yng nghanol y plwyf.\nGanwyd y bardd Lewys Glyn Cothi yn yr ardal tua'r flwyddyn 1425, ond ni wyddys ym mha ran o'r plwyf.\nBrodor o Wernogle oedd yr Undodwr radicalaidd a llenor Thomas Evans (Tomos Glyn Cothi), a aned yng Nghapel Sant Silyn, ger Gwernogle, yn 1764."
                }
            },
            {
                "id": "carmarthenshire#gwyddgrug",
                "name": "Gwyddgrug",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Gwyddgrug",
                        "_text": "Gwyddgrug is a small village in Carmarthenshire, West Wales. It is located on the main A485 road south of New Inn.\n\n^ Pencader and District Regeneration Group"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Gwyddgrug",
                        "_text": "Gweler hefyd Yr Wyddgrug (Sir y Fflint).\nPentref bychan yn Sir Gaerfyrddin yw Gwyddgrug. Fe'i lleolir yng ngogledd canolbarth y sir ar y ffordd A485 tua 11 milltir i'r gogledd o dref Caerfyrddin, hanner ffordd rhwng y dref honno a Llanbedr Pont Steffan. Mae'n rhan o blwyf eglwysig Llanfihangel-ar-Arth."
                    }
                ]
            },
            {
                "id": "carmarthenshire#halfpenny furze",
                "name": "Halfpenny Furze"
            },
            {
                "id": "carmarthenshire#halfway",
                "name": "Halfway",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Halfway",
                        "_text": "Halfway or Half Way may refer to:\nCanada\nHalfway Cove, Nova Scotia\nIreland\nHalfway, County Cork\nUnited Kingdom\nHalfway, Berkshire, England\nHalfway, Carmarthenshire, Wales\nHalfway, Cambuslang, Scotland\nHalfway, Glasgow, Scotland\nHalfway, Sheffield, England\nUnited States\nHalf Way, California\nHalfway, Kentucky (disambiguation)\nHalfway, Maryland\nHalfway, Missouri\nHalfway, Oregon\nOther uses\nHalfway, a brand of folding bicycle made by Giant Manufacturing"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Halfway",
                        "_text": "Gallai Halfway gyfeirio at un o sawl beth:"
                    }
                ]
            },
            {
                "id": "carmarthenshire#hebron",
                "name": "Hebron",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Hebron",
                        "_text": "Hebron (Arabic:  الخليل  al-Khalīl; Hebrew:  חֶבְרוֹן , Standard Hebrew: Ḥevron; ISO 259-3: Ḥebron) is a Palestinian city located in the southern West Bank, 30 km (19 mi) south of Jerusalem. Nestled in the Judaean Mountains, it lies 930 meters (3,050 ft) above sea level. It is the largest city in the West Bank, and the second largest in the Palestinian territories after Gaza, and home to around 175,000 to 250,000 Palestinians, and between 500 and 850 Jewish settlers concentrated in Otniel settlement and around the old quarter. The city is divided into two sectors: H1, controlled by the Palestinian Authority and H2, roughly 20% of the city, administered by Israel. The settlers are governed by their own municipal body, the Committee of the Jewish Community of Hebron. The city is most notable for containing the traditional burial site of the biblical Patriarchs and Matriarchs, within the Cave of the Patriarchs. It is therefore considered the second-holiest city in Judaism after Jerusalem. The city is venerated by Jews, Christians, and Muslims for its association with Abraham. It is viewed as a holy city in Islam and Judaism.\nHebron is a busy hub of West Bank trade, responsible for roughly a third of the area's gross domestic product, largely due to the sale of marble from quarries. It is locally well known for its grapes, figs, limestone, pottery workshops and glassblowing factories, and is the location of the major dairy product manufacturer, al-Junaidi. The old city of Hebron is characterized by narrow, winding streets, flat-roofed stone houses, and old bazaars. The city is home to Hebron University and the Palestine Polytechnic University.\nHebron is detached to cities of ad-Dhahiriya, Dura, Yatta, the surrounding villages with no borders. Hebron Governorate is the largest Palestinian governorate with its population of 600,364 (2010)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Hebron",
                        "_text": "Gweler hefyd Hebron (gwahaniaethu).\nDinas ar y Lan Orllewinol yw Hebron (Hebraeg: חברון Chevron; Arabeg: الخليل Al Khalil). Ers dechrau 1997, mae 80% o'r ddinas dan reolaeth Awdurdod Cenedlaethol Palesteina a'r gweddill yn cael ei rheoli gan Israel. Roedd y boblogaeth yn 2006 tua 167,000, bron i gyd yn Balestiniaid, ac eithio tua 600 o Iddewon.\nMae Hebron yn un o ddinasoedd hynaf y Dwyrain Canol. Gerllaw Hebron mae Ogof y Patriarchiaid, lle dywedir bod Abraham, Sara, Isaac a Rebecca wedi eu claddu. Mae'n fangre sanctaidd mewn Iddewiaeth, Cristnogaeth ac Islam. Yn Hebron y cyhoeddwyd Dafydd yn frenin teyrnas Israel ac oddi yno y bu'n teyrnasu hed nes iddo goncro Jeriwsalem.\nYn 1929, lladdwyd 69 o Iddewon gan y Palestiniaid, a gorfodwyd y gweddill o'r boblogaeth Iddewig i ffoi. Yn 1994 lladdwyd 29 o bobl oedd yn gweddio ym Mosg Ibrahimi gan Baruch Goldstein, meddyg Americanaidd-Israelaidd, ac anafwyd 125 arall."
                    }
                ]
            },
            {
                "id": "carmarthenshire#hendy",
                "name": "Hendy",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Hendy",
                        "_text": "Hendy (Welsh: Yr Hendy, meaning \"the old house\") is a village in the community of Llanedi, Carmarthenshire, Wales, situated on the border between Carmarthenshire and Swansea. It lies on the Afon Gwili just across the River Loughor from the town of Pontarddulais and, together with Fforest to its north, forms part of a continuous built up area centred on Pontarddulais. Most of the village sits between the M4 Motorway junction 48 and the A48 road (Fforest Road) north of the motorway."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Hendy",
                        "_text": "Gallai Hendy gyfeirio at:\nYr Hendy, pentref yn Sir Gaerfyrddin, ger Pontarddulais\nHendy-gwyn ar Dâf, tref yn Sir Gaerfyrddin"
                    }
                ]
            },
            {
                "id": "carmarthenshire#henllan",
                "name": "Henllan",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Henllan",
                        "_text": "Henllan is a village in Denbighshire, Wales with a population of approximately 750 (OfNS\/2004) and lies in the countryside, approximately 2.25 miles north-west of the walled-town of Denbigh.The population had increased to 862 at the 2011 census."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Henllan",
                        "_text": "Gallai Henllan gyfeirio at un o sawl pentref:\nHenllan, Sir Ddinbych\nHenllan, Sir Gaerfyrddin\nHenllan, Ceredigion\nHenllan, Powys\nGweler hefyd\nHenllan Amgoed, pentref yn Sir Gaerfyrddin\nHenllan Dyfrig a Theilo, Hentland yn Swydd Henffordd\nHenllan Fallteg, cymuned yn Sir Gaerfyrddin"
                    }
                ]
            },
            {
                "id": "carmarthenshire#henllan amgoed",
                "name": "Henllan Amgoed",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Henllan Amgoed",
                        "_text": "Henllan Amgoed is a small village near Whitland, Carmarthenshire and forms part of the community of Henllanfallteg. The village is home to a chapel and a graveyard. Henllan Amgoed was served by a small local primary school until its closure in 2004, with the pupils moved to an amalgamated school, Ysgol Bro Brynach, in Llanboidy.\nHenllan Amgoed takes its name from the ancient commote of Amgoed, and is the only village to retain the name of the past division. In 1697 a Nonconformist congregation formed in the village, one of the earliest in Carmarthenshire.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Henllan Amgoed",
                        "_text": "Pentref bychan hanesyddol yng ngorllewin Sir Gaerfyrddin, de-orllewin Cymru, yw Henllan Amgoed. Mae yng nghymuned Henllan Fallteg.\nGorwedd y pentref ar lôn wledig tua 3 milltir i'r gogledd o'r Hendy-gwyn ar Daf.\nYn yr Oesoedd Canol bu'n brif ganolfan eglwysig cwmwd Amgoed, un o wyth cwmwd Cantref Gwarthaf. Yn wreiddiol roedd y cwmwd yn rhan o deyrnas Dyfed, ond yn ddiweddarach daeth yn rhan o deyrnas Deheubarth.\nBu Jeremy Owen (fl. 1704-1744), awdur Golwg ar y Beiau, yn weinidog Ymneilltuol yn Henllan Amgoed am gyfnod. Yn y llyfr hwnnw ceir ymateb Owen i'r rhwyg yn yr eglwys Bresbyteraidd yn yr ardal a arweiniodd at un o ddadleuon diwinyddol poethaf y 18fed ganrif, rhwng pleidwyr Uchel ac Isel Calfiniaeth."
                    }
                ]
            },
            {
                "id": "carmarthenshire#heol-ddu",
                "name": "Heol-ddu"
            },
            {
                "id": "carmarthenshire#hermon",
                "name": "Hermon",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Hermon",
                    "_text": "Ceir sawl lle o'r enw Hermon, a enwir ar ôl mynydd sanctaidd yn y Beibl, Mynydd Hermon, gan gynnwys:\nHermon (Sir Gaerfyrddin)\nHermon (Sir Benfro)\nHermon (Ynys Môn)"
                }
            },
            {
                "id": "carmarthenshire#hiraeth",
                "name": "Hiraeth",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Hiraeth",
                        "_text": "Hiraeth, pronounced [hɨraɪ̯θ], is a Welsh word that has no direct English translation. The University of Wales, Lampeter attempts to define it as homesickness tinged with grief or sadness over the lost or departed. It is a mix of longing, yearning, nostalgia, wistfulness, or an earnest desire for the Wales of the past.\nOxford and Merriam Webster define Hiraeth as: (noun) \"a homesickness for a home you cannot return to, or that never was\".\nHiraeth bears considerable similarities with the Portuguese concept of saudade (a key theme in Fado music), Brazilian Portuguese \"banzo\" (more related to homesickness), Galician morriña, Romanian dor."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Hiraeth",
                        "_text": "Teimlad o alar, gofid a cholled am fod oddi cartref neu o golli rhywun yw hiraeth (Cernyweg: hyreth, Llydaweg: hiraezh, Hen Wyddeleg: sirecht). Gair cyfansawdd ydyw: \"hir\" ac \"aeth\". Ynghlwm yn y gair hefyd mae'r elfen o ddymuniad neu ddyhead dwys. Ceir geiriau tebyg mewn Galisieg,(Morriña) , ac mewn Portiwgaleg (Saudade).\nCofnodwyd y gair am y tro cyntaf yn y 13eg ganrif yn Y Gododdin: Blwydyn hiraether gwyr gatraetham maeth ysmeu.\nMae Hiraeth hefyd yn ffilm gan Graham Bowers, ac yn enw ar sawl darn o farddoniaeth."
                    }
                ]
            },
            {
                "id": "carmarthenshire#horeb",
                "name": "Horeb",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Horeb",
                        "_text": "Horeb may refer to:\nMount Horeb, possibly another name for the Biblical Mount Sinai\nMount Horeb, Wisconsin, in Dane County, Wisconsin\nMount Horeb Sasthamcotta, ashram in Kerala, India\nHoreb, Carmarthenshire, Wales\nHoreb, Ceredigion, Wales\nHoreb, Flintshire, Wales"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Horeb",
                        "_text": "Gallai Horeb gyfeirio at un o sawl lle:\nYn y Beibl:\nHoreb, mynydd yn y Dwyrain Canol (lleoliad ansicr)\nPentrefi yng Nghymru:\nHoreb (Ceredigion)\nHoreb (Sir Gaerfyrddin)\nHoreb (Sir y Fflint)\nYn ogystal mae Horeb yn enw ar sawl capel yng Nghymru."
                    }
                ]
            },
            {
                "id": "carmarthenshire#idole",
                "name": "Idole",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Idole",
                    "_text": "Idole is a village in Carmarthenshire. Within the village is the Ysgol Y Fro school for juniors."
                }
            },
            {
                "id": "carmarthenshire#iet-y-bwlch",
                "name": "Iet-y-bwlch"
            },
            {
                "id": "carmarthenshire#johnstown",
                "name": "Johnstown",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Johnstown",
                    "_text": "Johnstown may refer to:"
                }
            },
            {
                "id": "carmarthenshire#kidwelly (cydweli)",
                "name": "Kidwelly (Cydweli)"
            },
            {
                "id": "carmarthenshire#laugharne",
                "name": "Laugharne",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Laugharne",
                    "_text": "Laugharne \/ˈlɑrn\/ (Welsh: Talacharn) is a town in Carmarthenshire, Wales, lying on the estuary of the River Tâf. It is known for having been the home of Dylan Thomas from 1949 until his death in 1953, and is thought to have been an inspiration for the fictional town of Llareggub in Under Milk Wood. The Township was originally known as Abercorran, but this was changed to Laugharne after the Civil War, in honour of Major-General Rowland Laugharne, a renowned local army officer, who had commanded a Parliamentarian army, before rebelling in 1648."
                }
            },
            {
                "id": "carmarthenshire#llanarthney",
                "name": "Llanarthney",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Llanarthney",
                    "_text": "Llanarthney (Welsh: Llanarthne) is a village and community in Carmarthenshire, Wales, located 12 kilometres to the east of Carmarthen and 10 kilometres to the south-west of Llandeilo. It has a population of 738, of whom 61% are Welsh-speaking (2001 UK Census). At the 2011 Census the population had reduced slightly to 765.\nThe community is bordered by the communities of: Llanegwad; Llangathen; Llanfihangel Aberbythych; Gorslas; Llanddarog; Llangunnor; and Abergwili, all being in Carmarthenshire.\n\n"
                }
            },
            {
                "id": "carmarthenshire#llanboidy",
                "name": "Llanboidy",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanboidy",
                        "_text": "Llanboidy is a fine western provenance located deep in the heart of the Welsh country. It is best known for a date in 1996, when a young young was born destined to go onto great things, to become captain of Llamboidy FC. He was Chrissy the colonel."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanboidy",
                        "_text": "Pentref a chymuned yn Sir Gaerfyrddin yw Llanboidy, 6 km i'r gogledd o Hendy-gwyn ar Daf."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llandawke",
                "name": "Llandawke"
            },
            {
                "id": "carmarthenshire#llanddarog",
                "name": "Llanddarog",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanddarog",
                        "_text": "Llanddarog is a community located in Carmarthenshire, Wales.The community population at the 2011 census was 1,198.\nThe community is bordered by the communities of: Llanarthney; Gorslas; Pontyberem; Llangyndeyrn; and Llangunnor, all being in Carmarthenshire.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanddarog",
                        "_text": "Pentref a chymuned yn Sir Gaerfyrddin yw Llanddarog. Saif y pentref fymryn i'r de o'r briffordd A48, tua hanner y ffordd rhwng Caerfyrddin a Rhydaman. Cysegrwyd yr eglwys, sy'n dyddio o 1856, i Sant Twrog. Mae tafarn yr Hydd Gwyn yn nodedig o fod a tho gwellt. Llifa Afon Gwendraeth Fach ychydig i'r de o'r pentref.\nHeblaw pentref Llanddarog, mae'r gymuned hefyd yn cynnwys pentref Porth-y-rhyd. Roedd poblogaeth y gymuned yn 2001 yn 1,095, gyda 73.51% yn medru rhywfaint o Gymraeg."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llanddowror",
                "name": "Llanddowror",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanddowror",
                        "_text": "Llanddowror (Welsh: Maes-y-lan) is a community and also a small, historic, relatively unspoilt village two miles from the town of St. Clears in Carmarthenshire in West Wales.\nThe community lies on the northern shore of Carmarthen Bay. It is bordered by the communities of: Pendine; Eglwyscummin; St Clears; and Laugharne Township, all being in Carmarthenshire."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanddowror",
                        "_text": "Pentref a chymuned yn Sir Gaerfyrddin yw Llanddowror, 3 km i'r de-orllewin o Sanclêr ar yr A477. Roedd 796 o bobl yn byw yng nghymuned Llanddowror (sy'n cynnwys New Mill a Llanmilo hefyd), 28% ohonynt yn siarad Cymraeg (Cyfrifiad 2001).\nMae Llanddowror yn enwog fel cartref Griffith Jones, sylfaenydd yr Ysgolion Cylchynol Cymreig yn y 18fed ganrif, am y rhan fwyaf o'i oes (1716 - 1761).\nCeir stori anhebygol i'r pentref fenthyg ei enw i Landour yn ne-orllewin yr Himalaya yng Ngogledd India yng n ghyfnod y British Raj'. Fe'i sefydlwyd yn 1827 fel ysbyty ar gyfer milwyr Prydeinig y cyfnod."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llandeilo",
                "name": "Llandeilo",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llandeilo",
                        "_text": "Llandeilo is a community and town in Carmarthenshire, Wales, situated at the crossing of the River Towy by the A483 on a 19th-century stone bridge. Its population is 1,731, increasing to 1,795 at the 2011 Census. It is adjacent to the westernmost point of the Brecon Beacons National Park.\nThe town is served by Llandeilo railway station on the Heart of Wales Line."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llandeilo",
                        "_text": "Erthygl am bentref yn Sir Gaerfyrddin yw hon; am leoedd eraill yn dwyn yr enw \"Llandeilo\", gweler Llandeilo (gwahaniaethu)\nMae Llandeilo yn dref ac yn gymuned yng nghanol Sir Gaerfyrddin. Fe'i henwir ar ôl yr hen eglwys i Sant Teilo. Yn yr Oesoedd Canol roedd yn cael ei hadnabod fel Llandeilo Fawr a gorweddai yng nghwmwd Maenor Deilo, heb fod ymhell o safle Castell Dinefwr, sedd frenhinol tywysogion y Deheubarth. Mae Gorsaf reilffordd Llandeilo ar linell Rheilffordd Calon Cymru."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llandilo-yr-ynys",
                "name": "Llandilo-yr-ynys"
            },
            {
                "id": "carmarthenshire#llandovery (llanymddyfri)",
                "name": "Llandovery (Llanymddyfri)"
            },
            {
                "id": "carmarthenshire#llandybie",
                "name": "Llandybie",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Llandybie",
                    "_text": "Llandybie (Welsh: Llandybïe, 'Saint Tybie's Church') is a community which includes a large village of the same name situated two miles north of Ammanford in Carmarthenshire, Wales.\nAccording to the United Kingdom Census 2001, Llandybie village itself is home to a population of 3,800, while the community – which also includes the villages of Blaenau, Caerbryn, Capel Hendre, Cwmgwili, Pentregwenlais, Penybanc, Pen-y-groes, and Saron – has 8,800 inhabitants, increasing to 10,994 at the 2011 census.\nIt was in Llandybie, in 1943, that the mineral Brammallite was found for the first time. Llandybie hosted the National Eisteddfod of Wales in 1944.\nThe village is served by Llandybie railway station on the Heart of Wales Line and the A483 road which is the main road. Llandybie Community Primary School is located in the north-easterly fringe of the village.\nThe community is bordered by the communities of: Dyffryn Cennen; Cwmamman; Betws; Ammanford; Llanedi; Llannon; Gorslas; and Llanfihangel Aberbythych, all being in Carmarthenshire."
                }
            },
            {
                "id": "carmarthenshire#llandyfan",
                "name": "Llandyfan"
            },
            {
                "id": "carmarthenshire#llandyfriog",
                "name": "Llandyfriog",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Llandyfriog",
                    "_text": "Llandyfriog is a community in the county of Ceredigion, Wales, and is 66.5 miles (107.1 km) from Cardiff and 187.8 miles (302.3 km) from London. In 2011 the population of Llandyfriog was 1773 with 54.7% of them able to speak Welsh.\n\nThe community includes the villages of Bangor Teifi, Trebedw, Bryndioddef-isaf, Glyncaled, Berthyfedwen and Pont Ceri. Castell Pistog fortified mound lies in the community.\n\n"
                }
            },
            {
                "id": "carmarthenshire#llandysul",
                "name": "Llandysul",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llandysul",
                        "_text": "Llandysul is a small town and community in the county of Ceredigion, Wales. As a community it consists of the villages of Capel Dewi, Horeb, Pont Sian, Pren-gwyn, Tregroes, Rhydowen and the village of Llandysul itself. At the 2001 census the community had a population of 1484, reducing to 1,439 at the 2011 Census. Llandysul lies in the valley of the River Teifi and is visited for its fishing and canoeing.\nLlandysul is also known as the home of Gwasg Gomer, one of the most prominent publishers of Welsh-interest and Welsh language books in Wales. The town is twinned with Plogonnec (Plogoneg) in Brittany, France."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llandysul",
                        "_text": "Am y pentref ym Mhowys, gweler Llandysul, Powys.\nTref fechan ar lan Afon Teifi yn ne Ceredigion yw Llandysul. Mae ganddi 2821 o drigolion, a 70% ohonynt yn siarad Cymraeg (Cyfrifiad 2001). Lleolir Gwasg Gomer, un o weisg a chyhoeddwyr mwyaf Cymru, yno. Gorwedd ar yr A486. Mae'r pentref hefyd yn boblogaidd ymysg canŵyr a cherddwyr afon."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llanegwad",
                "name": "Llanegwad",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanegwad",
                        "_text": "Llanegwad is a community located in Carmarthenshire, Wales. The population taken at the 2011 census was 1,473.\nLlanegwad is built up mainly of small farms and detached homes. The community is bordered by the communities of: Llanfihangel Rhos-y-Corn; Llanfynydd; Llangathen; Llanarthney; Abergwili; and Llanllawddog, all being in Carmarthenshire.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanegwad",
                        "_text": "Pentref a chymuned yn Sir Gaerfyrddin yw Llanegwad. Saif y pentref ar y briffordd A40 yn yr ongl a ffurfir lle mae Afon Cothi yn ymuno ag Afon Tywi, tua hanner y ffordd rhwng Caerfyrddin a Llandeilo.\nHeblaw pentref Llanegwad ei hun, mae'r Gymuned yn cynnwys Nantgaredig, Pontargothi, Cwrt-henri, a Felingwm."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llanelli",
                "name": "Llanelli",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanelli",
                        "_text": "Llanelli (\"St Elli's Parish\"; Welsh pronunciation: [ɬaˈnɛɬi]), the largest town in both the county of Carmarthenshire and the preserved county of Dyfed, Wales, sits on the Loughor estuary on the West Wales coast, approximately 10 miles (16 km) west-northwest of Swansea and 12 miles (19 km) south-east of the county town, Carmarthen. The town is famous for its proud rugby tradition and is a centre of tinplate production.\nIn the mid-20th century, Llanelli was the largest town in the world where more than half the population spoke a Celtic language. It is ranked the 7th largest urban area in Wales. According to the 2011 UK Census returns, 23.7% of Llanelli town residents could speak the Welsh language.\nLlanelli is surrounded by a number of villages and communities in the Llanelli Rural district. Some of these communities, especially ones that immediately surround the town, are often unofficially referred to as Llanelli."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanelli",
                        "_text": "Pwnc yr erthygl hon yw tref Llanelli. Am ddefnydd arall o'r enw Llanelli gweler y dudalen gwahaniaethu ar Lanelli.\nLlanelli yw tref fwyaf Sir Gaerfyrddin a de orllewin Cymru, wedi'i lleoli ar aber Afon Lliedi rhyw ddeuddeng milltir i'r gorllewin o Abertawe ac rhyw ugain milltir i'r de o Gaerfyrddin. Mae Caerdydd 72.1 km i ffwrdd o Llanelli ac mae Llundain yn 281.6 km. Y ddinas agosaf ydy Abertawe sy'n 15.2 km i ffwrdd. Mae Llanelli hefyd yn gymuned.\nTyfodd y dref yn y 19eg ganrif o amgylch y pyllau glo a'r gweithfeydd tun. Mae’r dref yn enwog am ei thraddodiad rygbi balch.\nMae Llanelli hefyd wedi’i hamgylchynu gan nifer o drefi a phentrefi bach a adweinir fel Llanelli Rural. Mae’r rhan fwyaf o'r rhain yn cael eu hystyried yn rhan o dref Llanelli."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llanfallteg",
                "name": "Llanfallteg",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanfallteg",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Llanfallteg. Fe'i lleolir tua 4 milltir i'r gogledd-orllewin o Hendy-gwyn ar Daf, yn ne-orllewin y sir, ar ffordd wledig rhwng Clunderwen a Henllan Amgoed. Mae'n cynnwys Gorllewin Llanfallteg.\nMae'r pentref yn rhan o gymuned Henllan Fallteg."
                }
            },
            {
                "id": "carmarthenshire#llanfallteg west",
                "name": "Llanfallteg West"
            },
            {
                "id": "carmarthenshire#llanfihangel-ar-arth",
                "name": "Llanfihangel-ar-arth"
            },
            {
                "id": "carmarthenshire#llanfihangel-uwch-gwili",
                "name": "Llanfihangel-uwch-Gwili",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanfihangel-uwch-Gwili",
                    "_text": "Pentref yn Sir Gaerfyrddin yw Llanfihangel-uwch-Gwili. Fe'i tua 5 milltir i'r dwyrain o dref Caerfyrddin. Cyfeiria 'Gwili' at Afon Gwili. Y pentref agosaf yw Nantgaredig, ar yr A40 llai na milltir i'r de.\nMae'n un o sawl lle yng Nghymru a enwir ar ôl Sant Mihangel."
                }
            },
            {
                "id": "carmarthenshire#llanfynydd",
                "name": "Llanfynydd",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanfynydd",
                        "_text": "Llanfynydd is a village, parish and community in Carmarthenshire, Wales. The population of the community taken at the 2011 census was 499. It lies some 10 miles north-east of the county town, Carmarthen.\nThe community is bordered by the communities of: Llansawel; Talley; Manordeilo and Salem; Llangathen; Llanegwad; and Llanfihangel Rhos-y-Corn, all being in Carmarthenshire.\n^ \"Community population 2011\". Retrieved 15 April 2015."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanfynydd",
                        "_text": "Gallai Llanfynydd gyfeirio at:\nLlanfynydd, pentref a chymuned yn Sir Gaerfyrddin\nLlanfynydd, pentref a chymuned yn Sir y Fflint"
                    }
                ]
            },
            {
                "id": "carmarthenshire#llangadog",
                "name": "Llangadog",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llangadog",
                        "_text": "Llangadog is a community located in Carmarthenshire, Wales, which includes the villages of Llangadog, Bethlehem and Capel Gwynfe. A notable local landscape feature is Y Garn Goch with two Iron Age hill forts.\nLlangadog was the administrative centre of the commote of Perfedd and had a castle, destroyed in 1204. Although the borough declined in the Middle Ages, Llangadog retained its market, which was frequented by drovers into the 19th century.\n\nThe railway station on the Heart of Wales Line provides regular train services via Arriva Trains Wales. The station had a siding for accessing the Co-op Wholesale Society creamery, allowing milk trains to access the site. After railway access was ceased in the late 1970s, the creamery continued to operate until 2005, when it closed with the loss of 200 jobs. The site has since been redeveloped as a pet food factory.\n^ \"Community population 2011\". Retrieved 15 April 2015. \n^ a b The Welsh Academy Encyclopedia of Wales. Cardiff: University of Wales Press 2008.\n^ BBC NEWS | Wales | South West Wales | 200 jobs lost as creamery closes\n^ Venture Wales - Pet food manufacturer to open new production facility"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llangadog",
                        "_text": "Pentref a chymuned yn Sir Gaerfyrddin yw Llangadog. Saif yn nyffryn Tywi, hanner ffordd rhwng Llandeilo a Llanymddyfri, ac ar ochr gorllewinol Parc Cenedlaethol Bannau Brycheiniog. Amaethyddiaeth yw'r prif ddiwydiant, ac mae'r boblogaeth tua 1,000. Cysegrwyd yr eglwys i Sant Cadog.\nBu Gwynfor Evans yn byw yno am flynyddoedd lawer."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llangain",
                "name": "Llangain",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Llangain",
                    "_text": "Llangain is a community and village in Carmarthenshire, West Wales, United Kingdom. Located to the west of the River Towy, the community contains three standing stones, and two chambered tombs as well as the ruins of 15th century great house, Castell Moel. In 2001 the community's population was recorded at 574, decreasing slightly to 573 at the 2011 census.\n^ Davies, John; Jenkins, Nigel; Menna, Baines; Lynch, Peredur I., eds. (2008). The Welsh Academy Encyclopaedia of Wales. Cardiff: University of Wales Press. p. 492. ISBN 978-0-7083-1953-6. \n^ \"Community population 2011\". Retrieved 16 April 2015."
                }
            },
            {
                "id": "carmarthenshire#llangathen",
                "name": "Llangathen",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llangathen",
                        "_text": "Llangathen is a community located in Carmarthenshire, Wales. The population taken at the 2011 census was 507.\nThe parish church of St Cathen is a Grade II* listed building \nWithin the parish is the country house of Aberglasney, also a Grade II* listed building\nThe community is bordered by the communities of: Manordeilo and Salem; Llandeilo; Llanfihangel Aberbythych; Llanarthney; Llanegwad; and Llanfynydd, all being in Carmarthenshire."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llangathen",
                        "_text": "Pentref a chymuned yn Sir Gaerfyrddin yw Llangathen. Saif ychydig i'r gorllewon o dref Llandeilo, ac i'r de o'r briffordd A40 rhwng Llandeilo a Chaerfyrddin. Mae Afon Tywi ychydig i'r de o'r pentref. Bu pobl yn byw yn yr ardal ers o leiaf Oes yr Haearn, ond datblygodd pentref Llangathen ei hun o dan nawdd teulu Phillipse o Aberglasney yn ystod y 19eg ganrif. Dyddia'r eglwys o'r Canol oesoedd, ac mae'n gysegredig i Sant Cathen. Ceir cofeb nodedig i'r Esgob Anthony Rudd o Dyddewi ynddi, sy'n dyddio o ddechrau'r 17eg ganrif.\nGerllaw mae gerddi enwog Aberglasney, ac ychydig i'r dwyrain mae Castell Dinefwr."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llangeler",
                "name": "Llangeler",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llangeler",
                        "_text": "Llangeler is a hamlet located in north Carmarthenshire, Wales. The name is believed to refer to St. Gelert. Llangeler parish covers a wide area including to the west, the textile village of Dre-fach Felindre and to the east, Pontyweli which adjoins Llandysul on the Carmarthenshire side of the River Teifi. The population of the parish was 3,222 at the Census of 2001, increasing to 3,427 at the 2011 census.\nThe community is bordered by the communities of: Llanfihangel-ar-Arth; Cynwyl Elfed; Cenarth; and Newcastle Emlyn, all being in Carmarthenshire; and by Llandyfriog and Llandysul in Ceredigion."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llangeler",
                        "_text": "Pentref a chymuned yn Sir Gaerfyrddin yw Llangeler. Saif i'r dwyrain o Gastell Newydd Emlyn, rhwng Dre-fach Felindre a Llandysul ac ar lan ddeheuol Afon Teifi. Mae mynwent gron yr eglwys yn awgrymu ei bod yn sefydliad hynafol dros ben, a cheir ffynnon sanctaidd gerllaw.\nTua kilometr i'r gogledd-ddwyrain saif Castell Pistog, sef hen domen o'r Oesoedd Canol."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llangendeirne",
                "name": "Llangendeirne",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Llangendeirne",
                    "_text": "This is a redirect from a title with a different spelling. Pages that link to this redirect may be updated to link directly to the target page if that results in an improvement of the text. Do not \"fix\" such links if they are not broken. Also, these links should not be replaced with piped links. For more information follow the category link."
                }
            },
            {
                "id": "carmarthenshire#llangennech",
                "name": "Llangennech",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llangennech",
                        "_text": "Llangennech is a village in the area of Llanelli, Carmarthenshire, Wales.\nIt is governed by Carmarthenshire County Council and Llanelli Rural council. It falls in the Llanelli parliament Constituency. Llangennech is also the name of an electoral ward coterminous with the village and has its own community council. It was formerly a coal mining community, with several local collieries mining steam coal. There is also a large Labour tradition in the village emanating from the mine workers. There was formerly a large Royal Navy depot in the village, which was closed in MoD restructuring.\nLlangennech also have a strong rugby union team, Llangennech RFC, that feed many players into Llanelli RFC and then on to the Llanelli Scarlets regional rugby union team.\nThe town is served by Llangennech railway station on the Heart of Wales Line with trains to Swansea to the south and Shrewsbury to the north.\nThe community is bordered by the communities of: Llanelli Rural; Llannon; and Llanedi, all being in Carmarthenshire; and by Grovesend and Waungron and Gorseinon in the City and County of Swansea.\n^ \"Ward population 2011\". Retrieved 16 April 2015."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llangennech",
                        "_text": "Pentref bychan a chymuned yn Sir Gaerfyrddin yw Llangennech. Fe'i lleolir ar B4297 tua 4 milltir i'r gogledd-ddwyrain o Lanelli, ar y ffordd i Bontarddulais, ac ar Reilffordd Calon Cymru. Mae ar lan orllewinol aber Afon Llwchwr."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llanglydwen",
                "name": "Llanglydwen",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanglydwen",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Llanglydwen. Fe'i lleolir tua 6 milltir a hanner i'r gogledd o Hendy-gwyn ar Daf, yng ngorllewin y sir, ar ffordd ger yr A478. Mae'n rhan o gymuned Llanboidy."
                }
            },
            {
                "id": "carmarthenshire#llangunnor",
                "name": "Llangunnor",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Llangunnor",
                    "_text": "Llangunnor is a community located in Carmarthenshire, Wales. It is the southern suburb of Carmarthen town and consists mainly of typical suburban housing which has expanded in recent years. It has a small shop, two chapels, a church and a Primary School. It is made up of the villages and hamlets of Nantycaws, Pensarn, Login and Pibwrlwyd."
                }
            },
            {
                "id": "carmarthenshire#llangynin",
                "name": "Llangynin",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llangynin",
                        "_text": "Llangynin is a community located in Carmarthenshire, Wales. The Welsh language name of the village means \"the church of St. Cynin\" The population of the community taken at the 2011 census was 284.\nSt Cynin's church is a grade II* listed building which stands some 2 km south of the centre of the village.\nThe community is bordered by the communities of: Llanwinio; Meidrim; St Clears; and Llanboidy, all being in Carmarthenshire."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llangynin",
                        "_text": "Pentref a chymuned yn Sir Gaerfyrddin yw Llangynin. Saif ychydig i'r gogledd-orllewin o Sanclêr. Yn 2001 roedd poblogaeth Ward Cymuned Llangynin yn 270, gyda 67% ohonynt ym medru Cymraeg."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llangynog",
                "name": "Llangynog",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llangynog",
                        "_text": "Llangynog (grid reference SJ053261) lies at the confluence of the Afon Eirth and the Afon Tanat at the foot of the Berwyn range in Powys, Wales. The population is c. 300.\nIt lies at the foot of the Milltir Cerrig mountain pass on the B4391 road, which runs between Llan Ffestiniog and Llanfyllin (though the B4391 road number 'disappears' between the western end of Llyn Celyn and Bala).\nIt is surrounded by mountains and is a popular base for walkers. Llangynog has a down-hill mountain bike course, and a crown green bowling club, who play in the Oswestry League.\nIt was the western terminus of the Tanat Valley Light Railway (Llynclys - Llangynog) (15 miles); it opened on 5 January 1904 and closed (passenger traffic) in 1951.\nIt is close to the pilgrimage shrine of Saint Melangell at the church of Pennant Melangell (grid reference SJ024265). Lake Vyrnwy is a short drive away. Bala Lake, Powys Castle in Welshpool and Oswestry take around half an hour by car. Wrexham, Chester, New Town and Shrewsbury are all under an hour away. The seaside town of Barmouth is also within easy reach by car.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llangynog",
                        "_text": "Ceir mwy nag un lle o'r enw Llangynog:\nLlangynog (Powys)\nLlangynog (Sir Gaerfyrddin)\nLlangynog (Swydd Henffordd)"
                    }
                ]
            },
            {
                "id": "carmarthenshire#llanllwch",
                "name": "Llanllwch",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanllwch",
                        "_text": "Llanllwch is a small hamlet in Wales approximately two miles west of Carmarthen."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanllwch",
                        "_text": "Pentref yng nghanolbarth Sir Gaerfyrddin ydy Llanllwch neu Llan-llwch (Cyfeirnod OS: SN3818). Mae wedi ei leoli tua ddwy filltir i'r gorllewin o dref hanesyddol Caerfyrddin, ger y ffordd A40 a'r rheilffordd o Gaerfyrddin i sir Benfro.\nMae yno wasanaeth bws yn rhedeg yn ddyddiol o'r pentref a gwasanaeth parcio a theithio yn Nantyci hanner milltir allan o'r pentref sy'n teithio i Gaerfyrddin pob pymtheg munud. Ceir eglwys sy'n cynnal gwasanaethau wythnosol ac mae milfeddygfa newydd Caerfyrddin yn y pentref."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llanllwni",
                "name": "Llanllwni",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanllwni",
                        "_text": "Llanllwni is a village and community located in Carmarthenshire, Wales. The village lies along the A485 highway, stretching for about 2.5 mi (4.0 km), to the south-west of Llanybydder. To the south of the village lies Llanllwni Mountain. The 16th-century parish church, formerly dedicated to St. Llwni, is now dedicated to St. Luke and is a grade II* listed building.\nBesides Llanllwni village, the community extends to the southern bank of the River Teifi and includes the summit of Mynydd Llanybydder, 1,338 ft (408 m) high. The community is bordered by the communities of: Llanybydder; Llanfihangel Rhos-y-Corn; and Llanfihangel-ar-Arth, all being in Carmarthenshire; and by Llandysul and Llanwenog in Ceredigion. The 2001 census recorded a population of 676, with 72.19% of the community able to speak some Welsh. The population taken at the 2011 Census had decreased to 638.\nTo the north of the village are Norwood Gardens, which are open to the public for much of the year. To the south west of the village is the listed building and listed garden of Maesycrugiau Manor. Now being used for accommodation."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanllwni",
                        "_text": "Pentref a chymuned yn Sir Gaerfyrddin yw Llanllwni. Saif y pentref ar hyd y briffordd A485, yn ymestyn am tua 4 km, fymryn i'r de-orllewin o Lanybydder. I'r de o'r pentref mae Mynydd Llanllwni. Cysegrwyd yr eglwys, yn dyddio o'r 16eg ganrif, i Sant Luc, ond gynt i Sant Llwni.\nHeblaw pentref Llanllwni, mae'r gymuned yn ymestyn hyd at lan ddeheuol Afon Teifi ac yn cynnwys copa Mynydd Llanybydder (408 m). Yn ôl cyfrifiad 2001 roedd gan y gymuned boblogaeth o 676 gyda 72.19% ohonynt yn medru rhywfaint o Gymraeg."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llanmiloe",
                "name": "Llanmiloe",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Llanmiloe",
                    "_text": "Llanmiloe is a village situated on the A4066 road in the south west of Carmarthenshire, Wales, between the villages of Laugharne to the north-east and Pendine to the south-west.\n\n"
                }
            },
            {
                "id": "carmarthenshire#llannon",
                "name": "Llannon",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llannon",
                        "_text": "For the village in Ceredigion, see Llanon (Llan-non).\nLlannon is a small village and community in the county of Carmarthenshire, Wales. It is located on the A476 road 11 miles south east of the county town, Carmarthen, between Tumble and Swiss Valley.\nThe community of Llannon, contains Llannon village, Tumble and Cross Hands. The community is bordered by the communities of: Gorslas; Llandybie; Llanedi; Llangennech; Llanelli Rural; and Pontyberem, all being in Carmarthenshire.\n^ Davies, John; Jenkins, Nigel (2008). The Welsh Academy Encyclopaedia of Wales. Cardiff: University of Wales Press. p. 503. ISBN 978-0-7083-1953-6."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llannon",
                        "_text": "Gall Llannon (neu Llanon) gyfeirio at fwy nag un lle:\nLlan-non (hefyd 'Llanon'), pentref yng Ngheredigion\nLlan-non, pentref yn Sir Gaerfyrddin"
                    }
                ]
            },
            {
                "id": "carmarthenshire#llanpumsaint",
                "name": "Llanpumsaint",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanpumsaint",
                        "_text": "Llanpumsaint (Welsh \"Llan\" church + \"pum\" five + \"saint\" saint(s)) is a village and community in Carmarthenshire, Wales. In the 2001 UK Census, Llanpumsaint community had a population of 595. It is not to be confused with Pumsaint, a small village some distance away on the River Cothi.\nLlanpumsaint community comprises the neighbouring hamlet of Nebo, the Hindu community and temple at Skanda Vale and a number of farms.\nAccording to the 2001 Census, 50% of those living in Llanpumsaint community are able to speak, read and write Welsh, this is well above the 39% average recorded for Carmarthenshire in the same census."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanpumsaint",
                        "_text": "Gweler hefyd Pumsaint.\nPentref bychan, cymuned a phlwyf yn Sir Gaerfyrddin yw Llanpumsaint. Fe'i lleolir tua 6 milltir i'r gogledd o dref Caerfyrddin ar groesffordd wledig. Llifa Afon Gwili heibio i'r pentref ac mae Nant Cwm Cerwyn yn ymuno â hi yno. Yn ôl cyfrifiad 2001, mae ganddo boblogaeth o tua 595.\nEnwir y pentref a'r plwyf ar ôl pum mab Cynyr Farfdrwch o Gynwyl Gaio, un o ddisgynyddion Cunedda Wledig, sef Ceitho, Gwynno, Gwynoro, Celynin a Gwyn.\nYn ôl traddodiad bu safle’r eglwys newydd yn safle paganaidd cyn hynny. Ceir pum pwll ar Nant Cwm Cerwyn a enwir ar ôl y saint. Roeddent yn gyrchfa pererindod yn yr Oesoedd Canol, yn arbennig ar Ŵyl Dewi.\nYn ôl cyfrifiad 2001, mae 50% o'r rheini sy'n byw yng nghymuned Llanpumsaint yn medru siarad, darllen, ac ysgrifennu Cymraeg; mae hyn cryn dipyn yn uwch na'r cyfartaledd o 39% dros Sir Gaerfyrddin a gofnodwyd yn yr un cyfrifiad."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llansadurnen",
                "name": "Llansadurnen"
            },
            {
                "id": "carmarthenshire#llansadwrn",
                "name": "Llansadwrn",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llansadwrn",
                        "_text": "Llansadwrn is a small village in Carmarthenshire, Wales.\nIt is located in the countryside of the River Tywi river valley, about half way between Llanymddyfri to the north-east, and Llandeilo to the south-west, just off the A40 road.\nAccording to tradition, it was founded by an early Christian saint, Sadwrn (fl. around 460 AD).\nFour miles to the west of the village are the ruins of Talley Abbey (Welsh: Abaty Talyllychau).\nThree miles to the west is the hamlet of Waunclunda and a fort above, little information is available about this fort.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llansadwrn",
                        "_text": "Gall Llansadwrn gyfeirio at un o ddau bentref yng Nghymru:\nLlansadwrn yn Sir Gaerfyrddin\nLlansadwrn ar Ynys Môn\nGweler hefyd\nSadwrn"
                    }
                ]
            },
            {
                "id": "carmarthenshire#llansaint",
                "name": "Llansaint",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Llansaint",
                    "_text": "Llansaint is a village of farmsteads and cottages that is located in Carmarthenshire, Wales. It includes a cluster of 19th century stone-built houses around the church, and it is surrounded by farmsteads and modern residential development."
                }
            },
            {
                "id": "carmarthenshire#llansawel",
                "name": "Llansawel",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llansawel",
                        "_text": "Llansawel is a community located in Carmarthenshire, Wales. The population of the community taken at the 2011 census was 438."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llansawel",
                        "_text": "Gall Llansawel gyfeirio at un o ddau le yng Nghymru:\nLlansawel, Castell-nedd Port Talbot, Briton Ferry yn Saesneg\nLlansawel, Sir Gaerfyrddin"
                    }
                ]
            },
            {
                "id": "carmarthenshire#llansteffan",
                "name": "Llansteffan",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llansteffan",
                        "_text": "Llansteffan, formerly also anglicized as Llan- or Lanstephan, is a village on the coast of Carmarthenshire in south-west Wales. It lies on the western side of the River Tywi estuary, some seven miles below the county town of Carmarthen and opposite the village of Ferryside.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llansteffan",
                        "_text": "Pentref bychan a chymuned yn Sir Gaerfyrddin yw Llansteffan. Mae'n gorwedd yn ne'r sir ar aber Afon Tywy, tua 7 milltir i'r de-orllewin o Gaerfyrddin."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llanwinio",
                "name": "Llanwinio",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanwinio",
                        "_text": "Llanwinio is a community located in Carmarthenshire, Wales. It is divided into two sections-the Eastern Division and the Western Division. The population is 1035; 422 in the Eastern and 613 in the Western Division. The population recorded at the 2011 Census was 448 only.\nLlanwinio is 2.7 miles (4.3 km) north of the hamlet of Gellywen, home of Ainon Baptist Church, built in 1828 and re-built in 1880.[1]"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanwinio",
                        "_text": "Pentref a chymuned yn Sir Gaerfyrddin yw Llanwinio. Saif yng ngorllewin y sir, i'r gogledd o Sanclêr. Cysegrwyd eglwys Llawinio, yn dyddio o 1846, i Sant Gwynlo.\nHeblaw pentref Llanwinio ei hun, mae'r gymuned yn cynnwys pentrefi Cwm-bach, Cwmfelinmynach a Blaen-waun. Mae'r gymuned yn ymestyn i'r gorllewin at y ffîn a Sir Benfro. Yn ôl cyfrifiad 2001 roedd gan y gymuned boblogaeth o 432 gyda 69.52% ohonynt yn medru rhywfaint o Gymraeg."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llanwrda",
                "name": "Llanwrda",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanwrda",
                        "_text": "Llanwrda is a parish and village on the River Towy, in the county of Carmarthenshire in west Wales, situated some 4 miles (6.5 km) southwest of Llandovery.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanwrda",
                        "_text": "Pentref, plwyf a chymuned yn Sir Gaerfyrddin yw Llanwrda. Saif y pentref ger cyffordd y briffordd A40 a'r A482, tua hanner y ffordd rhwng Llandeilo a Llanymddyfri, ger glan Afon Dulais, sy'n ymuno ag Afon Tywi ychydig i'r de-ddwyrain o'r pentref. Mae gan y pentref orsaf ar Reilffordd Calon Cymru.\nHeblaw pentref Llanwrda ei hun, mae'r gymuned yn cynnwys pentref Porth-y-rhyd. Yn ôl cyfrifiad 2001 roedd gan y gymuned boblogaeth o 513 gyda 66.47% ohonynt yn medru rhywfaint o Gymraeg."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llanybri",
                "name": "Llanybri",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Llanybri",
                    "_text": "Llanybri is a rural farming village occupying the peninsula between the estuaries of the River Towy and the River Taf Carmarthenshire, in south-west Wales.\n\n"
                }
            },
            {
                "id": "carmarthenshire#llanybydder",
                "name": "Llanybydder",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanybydder",
                        "_text": "Llanybydder (Welsh pronunciation: [ˌɬanəˈbəðɛr], sometimes formerly spelt Llanbydder) is a market town straddling the River Teifi in Carmarthenshire, West Wales, with a population of 1,423, almost three quarters of whom are Welsh-speaking according to the United Kingdom Census 2001. The population had increased to 1,638 at the 2011 Census. The nearest university is the University of Wales, Trinity Saint David, located in the nearest town, Lampeter (Llanbedr Pont Steffan). Mynydd Llanllwni (408 m) and Mynydd Pencarreg (415 m) are mountains to the east\/south east of Llanybydder.\nThe name may be a corruption of 'Llanbedr', the church dedicated to St Peter; or of 'Llanybyddair', the church of the Ambuscade."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanybydder",
                        "_text": "Tref farchnad hanesyddol a chymuned ar ochr Sir Gaerfyrddin o lannau Afon Teifi, 9 km (5.5 milltir) o Lanbedr Pont Steffan yw Llanybydder. Saif ar y briffordd A485 rhwng Llanbedr a Chaerfyrddin.\nMae Cymuned Llanybydder yn cynnwys pentref gwledig Rhydcymerau a leolir 8.5 cilometr (5 milltir) i'r de-ddwyrain, dros Fynydd Llanybydder."
                    }
                ]
            },
            {
                "id": "carmarthenshire#llanyfaelog",
                "name": "Llanyfaelog"
            },
            {
                "id": "carmarthenshire#llanymddyfri (llandovery)",
                "name": "Llanymddyfri (Llandovery)"
            },
            {
                "id": "carmarthenshire#llettyrychen",
                "name": "Llettyrychen"
            },
            {
                "id": "carmarthenshire#llwyn-teg",
                "name": "Llwyn-teg"
            },
            {
                "id": "carmarthenshire#llwynhendy",
                "name": "Llwynhendy",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llwynhendy",
                        "_text": "Llywnhendy is a village on the edge of Llanelli in Carmarthenshire, Wales with a population of 4,276.\nIt is bordered by Bynea, Pemberton, Penceilogi, and the Bryn. It is an old village with strong industrial roots. The (now closed) steel-works in nearby Bynea was a major employer until the decline of the steel industry."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llwynhendy",
                        "_text": "Pentref diwydiannol ar gyrion Llanelli yn Sir Gaerfyrddin yw Llwynhendy. Mae yng nghymuned Llanelli Wledig. Ceir Ysgol Gymraeg Brynsierfel yno. Yng Nghyfrifiad 2001 roedd ganddo boblogaeth o 4,276.\nMae'r pentref yn rhedeg mewn i bentref Bynea a rhwng y ddau le mae yna 4 capel ac eglwys, a nifer o dafarndai."
                    }
                ]
            },
            {
                "id": "carmarthenshire#login",
                "name": "Login",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Login",
                        "_text": "In computer security, a login or logon or sign in refers to the credentials required to obtain access to a computer system or other restricted area. Logging in or on and signing in or on is the process by which individual access to a computer system is controlled by identifying and authenticating the user through the credentials presented by the user.\nOnce a user has logged in, they can then log out or log off or sign out when access is no longer needed. To log out is to close off one's access to a computer system after having previously logged in."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Login",
                        "_text": "Pentref bychan yn Sir Gaerfyrddin yw Login. Fe'i lleolir tua 6 milltir i'r gogledd-orllewin o Hendy-gwyn ar Daf, yng ngorllewin y sir, ar ffordd wledig rhwng Efail-wen a Llanboidy. Mae'n rhan o gymuned Cilymaenllwyd.\n↑ ENWAU LLEOEDD SIR GÂR"
                    }
                ]
            },
            {
                "id": "carmarthenshire#loughor",
                "name": "Loughor",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Loughor",
                    "_text": "Loughor (\/ˈlʌxər\/) (Welsh: Casllwchwr) is a town in the City and County of Swansea, Wales, within the historic county boundaries of Glamorgan, Wales. It lies on the estuary of the River Loughor. The town has a community council called Llwchwr. In 2014, it was rated one of the most attractive postcode areas to live in Wales."
                }
            },
            {
                "id": "carmarthenshire#machynys",
                "name": "Machynys",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Machynys",
                    "_text": "Machynys, or Machynys Peninsula is a coastal area in south Llanelli, formerly occupied by a tinplate works and housing for its workers. After the works' closure, the housing was emptied in the mid-1960s and the site remained largely derelict awaiting abortive regeneration plans.\nThe site has been transformed beyond recognition since 1960. It is now home to the Machynys Peninsula Golf and Country Club which hosted the Wales Ladies Championship of Europe from 2005-2008. To the west of the golf course lies a recent development, Nicklaus Village (Welsh: Pentre Nicklaus), that consists of 175 New England style homes. Machynys is part of the Welsh Assembly Government's Llanelli Waterside regeneration plan.\nThe Llanelli Millennium Coastal Park, which includes National Cycle Network route 4, runs along the coast of Machynys. There are scenic views of the Gower Peninsula and the Bury Estuary from along the coast.\nMachynys translates from the Welsh as \"Monk's Island\", and thus, local legend holds that the area was home to a monastery built by Saint Piro in 513, although there is no concrete evidence of its existence. It is further assumed from its name that Machynys was once an island, at least at high tide. It was shown as an island on a map of the Stepney Estate as late as 1761. Machynys lies in the Llanelli Town Council and Carmarthenshire County Council ward of Glanymor."
                }
            },
            {
                "id": "carmarthenshire#maerdy",
                "name": "Maerdy",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Maerdy",
                        "_text": "Maerdy (Welsh: Y Maerdy) is a village and community in the county borough of Rhondda Cynon Taf, and within the historic county boundaries of Glamorgan, Wales, lying at the head of the Rhondda Fach Valley."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Maerdy",
                        "_text": "Gallai (Y) Maerdy gyfeirio at:\nY Maerdy, Conwy\nY Maerdy, Sir Fynwy\nMaerdy, Sir Gaerfyrddin\nY Maerdy, Rhondda Cynon Taf"
                    }
                ]
            },
            {
                "id": "carmarthenshire#maesgwynne",
                "name": "Maesgwynne"
            },
            {
                "id": "carmarthenshire#maesybont",
                "name": "Maesybont",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Maesybont",
                    "_text": "Maesybont is a small village near Gorslas in west Wales. The community consists of one school, a Welsh chapel with graveyard and several homes. The houses are widely dispersed, with an average of 1-acre (4,000 m2) of land apiece. Many of the homes in the village of Maesybont are large by European standards, differentiated predominantly by having Fritzl Barns, rather than traditional Dutch Barns. The local community benefits from a smallholding 100m down from the Chapel, which sells the highest quality free range eggs. \"Maesybont\" is roughly translated as \"Bridge over the field\"."
                }
            },
            {
                "id": "carmarthenshire#manordeilo",
                "name": "Manordeilo",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Manordeilo",
                    "_text": "Manordeilo is a village in Carmarthenshire, Wales."
                }
            },
            {
                "id": "carmarthenshire#mansant",
                "name": "Mansant"
            },
            {
                "id": "carmarthenshire#marros",
                "name": "Marros",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Marros",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Marros. Fe'i lleolir yn ne-orllewin eithaf y sir tua 7 milltir i'r gorllewin o Dalacharn ar ffordd wledig sy'n cysylltu Talacharn gydag Amroth yn Sir Benfro. Saif milltir o lan Bae Caerfyrddin. Mae'n rhan o gymuned Eglwys Gymyn."
                }
            },
            {
                "id": "carmarthenshire#meidrim",
                "name": "Meidrim",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Meidrim",
                        "_text": "Meidrim is a community some 8 miles (13 km) west of Carmarthen and 3.3 miles (5.3 km) north of St Clears in Carmarthenshire, Wales. Meidrim (formerly also spelled 'Mydrim') and its twin village of Drefach are situated either side of the Afon Dewi Fawr at the point where this small river is crossed by the B4298 road and meets with the B4299 road.\nMeidrim has a parish church, a Nonconformist chapel, a pub, a primary school, a village green or common and a park. It also boasts a number of self-catering cottages in the surrounding area making it popular for tourists visiting Pembrokeshire National Park and the Brecon Beacons as well as a number of local walks.\nThe etymological root of Meidrim is contested though 'Mei' and 'trum' might equal May Ridge. Another possibility is 'Meidr' or 'Beidr' meaning track and 'im' meaning little. On the other hand, it may be a reference to an early Christian Saint named Nailtrum, or as mentioned in a 12th-century poem, its meaning may be \"half of the shoulder\" of a hill. A false etymology which has been cited is its stemming from a corruption of \"My Dream\"."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Meidrim",
                        "_text": "Pentref a chymuned yn Sir Gaerfyrddin yw Meidrim (weithiau Meidrym). Saif ar gyffordd y B4299 a'r B4298, ychydig i'r gogledd o Sanclêr ac wyth milltir i'r gorllewin o dref Caerfyrddin. Mae'r boblogaeth tua 603, a cheir yno ysgol, dwy dafarn, eglwys a chapel. Codwyd y pentref mewn man lle’r oedd modd pontio Afon Dewi Fawr."
                    }
                ]
            },
            {
                "id": "carmarthenshire#meinciau",
                "name": "Meinciau",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Meinciau",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Meinciau. Fe'i lleolir yn ne'r sir tua 5 milltir i'r gogledd-ddwyrain o dref Cydweli ar y ffordd B4309. Mae'n rhan o ardal Cwm Gwendraeth ac yng nghymuned Llangyndeyrn."
                }
            },
            {
                "id": "carmarthenshire#merthyr",
                "name": "Merthyr",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Merthyr",
                    "_text": "Gweler hefyd y dudalen gwahaniaethu Merthyr (gwahaniaethu).\nMerthyr (o'r Lladin martyr) yw un sy'n marw dros ei (h)egwyddorion, ei ffydd neu rhywbeth y mae'n credu ynddo. Yn wreiddiol defnyddid y gair mewn cyd-destun Cristnogol i ddisgrifio credadyn sy'n barod i ddioddef angau dros ei ffydd yn hytrach nag ymwrthod â hi. Mae'r gair heddiw yn cael ei ddefnyddio ar gyfer pobl sy'n dioddef angau yn enw crefyddau eraill, e.e. Bwdhaeth, neu yn enw argyhoeddiadau gwleidyddol a.y.y.b. Merthyroleg yw'r gair am astudio hanes merthyron."
                }
            },
            {
                "id": "carmarthenshire#milo",
                "name": "Milo",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Milo",
                    "_text": "Milo may refer to:"
                }
            },
            {
                "id": "carmarthenshire#morfa",
                "name": "Morfa",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Morfa",
                        "_text": "Morfa may refer to:\nConwy Morfa, North Wales, United Kingdom\nMorfa, Swansea, South Wales, United Kingdom\nMorfa (drug), a highly potent opiate analgesic drug"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Morfa",
                        "_text": "Erthygl am y tirffurff yw hon. weler hefyd Morfa (gwahaniaethu).\nDarn o wastatir isel, gan amlaf ar lan y môr ac yn enwedig ger aber afon, a orchuddir gan ddŵr o dro i dro, yw morfa. Mae'r defnydd o'r gair yn amrywio a gellir ei gymhwyso i ddisgrifio unrhyw gorstir neu gors, neu ros gwlyb neu weundir ar lan aber. Y term agosaf yn Saesneg yw salt-marsh neu sea marsh (er bod y term geiriadurol 'morfa hallt' wedi cael ei fachu am hynny).\nEr ei fod yn dir diffrwyth ar un olwg, mae morfeydd yn gynefin bwysig i fywyd gwyllt, yn enwedig planhigion ac adar."
                    }
                ]
            },
            {
                "id": "carmarthenshire#morfa bach",
                "name": "Morfa Bach"
            },
            {
                "id": "carmarthenshire#myddfai",
                "name": "Myddfai",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Myddfai",
                        "_text": "Myddfai is a small village and community in Carmarthenshire, Wales. It is situated south of Llandovery in the Brecon Beacons, and has a population of 415, decreasing to 398 at the 2011 census.\nThe village is a popular tourist destination on the western edge of the Brecon Beacons, famous for the history and heritage of the Physicians of Myddfai and the Legend of ‘The Lady of The Lake’ and provides a central location to visit a wide range of interesting places, such as gardens, castles and The Heart of Wales Railway."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Myddfai",
                        "_text": "Pentref a chymuned yn Sir Gaerfyrddin yw Myddfai. Saif ar odre gogleddol y Mynydd Du ac ychydig i'r de o dref Llanymddyfri, gyda Mynydd Myddfai i'r dwyrain."
                    }
                ]
            },
            {
                "id": "carmarthenshire#myddyn-fych",
                "name": "Myddyn-fych"
            },
            {
                "id": "carmarthenshire#mynyddygarreg",
                "name": "Mynyddygarreg"
            },
            {
                "id": "carmarthenshire#myrtle hill",
                "name": "Myrtle Hill",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Myrtle Hill",
                    "_text": "Myrtle Hill can refer to:\nBoligee Hill, a house on the National Register of Historic Places, now known as Myrtle Hill.\nMyrtle Hill (United Kingdom), a populated place.\nMyrtle Hill (Owingsville, Kentucky), a house on the National Register of Historic Places.\nMyrtle Hill Cemetery, was a site of The 1793 Battle of Hightower and on the National Register of Historic Places."
                }
            },
            {
                "id": "carmarthenshire#nant",
                "name": "Nant",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Nant",
                    "_text": "This is a redirect from a title with another method of capitalisation. It leads to the title in accordance with the Wikipedia naming conventions for capitalisation, or it leads to a title that is associated in some way with the conventional capitalisation of this redirect title. This may help writing, searching and international language issues. For more information follow the category link.\nUse this rcat to tag only mainspace redirects; when other capitalisations are in different namespaces, use {{R from modification}} instead."
                }
            },
            {
                "id": "carmarthenshire#nant-y-bai",
                "name": "Nant-y-Bai"
            },
            {
                "id": "carmarthenshire#nant-y-ffin",
                "name": "Nant-y-ffin"
            },
            {
                "id": "carmarthenshire#nantgaredig",
                "name": "Nantgaredig",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Nantgaredig",
                        "_text": "Nantgaredig is a village in Carmarthenshire, Wales.\nThe village is most notable for being the home of the actor Julian Lewis Jones. It is also the home of the Welsh rugby union footballer Mefin Davies who plays as a hooker in the Wales national rugby union team and the Ospreys.\nThe winner of the 1990 Cheltenham Gold Cup, Norton's Coin, was trained by Sirrel Griffiths at his farm at Nantgaredig.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Nantgaredig",
                        "_text": "Pentref yn Sir Gaerfyrddin yw Nantgaredig. Fe'i lleolir ar bwys y ffordd A40, tua 5 milltir i'r dwyrain o dref Caerfyrddin. Llifa Afon Tywi heibio i'r de o'r pentref. Y pentrefi agosaf yw Pont-ar-Gothi a Llanfihangel-uwch-Gwili.\nMae'r pentref yn gartref i Glwb Rygbi Nantgaredig.\nCeir Ysgol Gynradd Nantgaredig yn y pentref."
                    }
                ]
            },
            {
                "id": "carmarthenshire#nantycaws",
                "name": "Nantycaws"
            },
            {
                "id": "carmarthenshire#neuadd",
                "name": "Neuadd"
            },
            {
                "id": "carmarthenshire#new inn",
                "name": "New Inn",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/New Inn",
                        "_text": "New Inn is a village and community of approximately 3,000 households located to the south east of Pontypool, within the County Borough of Torfaen in Wales, within the historic boundaries of Monmouthshire."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/New Inn",
                        "_text": "Gallai New Inn gyfeirio at:\nNew Inn, pentref a chymuned ym mwrdeisdref sirol Torfaen\nNew Inn, pentref yn Sir Gaerfyrddin"
                    }
                ]
            },
            {
                "id": "carmarthenshire#newcastle emlyn",
                "name": "Newcastle Emlyn",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Newcastle Emlyn",
                    "_text": "Newcastle Emlyn (Welsh: Castell Newydd Emlyn) is a town straddling the border of the counties of Ceredigion and Carmarthenshire in west Wales (though officially it is in Carmarthenshire) and lying on the River Teifi.\nAdpar is the part of the town that lies on the Ceredigion side of the River Teifi. It was formerly called Trefhedyn and was an ancient Welsh borough in its own right."
                }
            },
            {
                "id": "carmarthenshire#newchurch",
                "name": "Newchurch",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Newchurch",
                    "_text": "Newchurch is the name of several places in the United Kingdom:\nNewchurch, Blaenau Gwent, Wales\nNewchurch, Carmarthenshire, Wales\nNewchurch, Herefordshire, England\nNewchurch, Isle of Wight, England\nNewchurch, Kent, England\nNewchurch, Lancashire, England\nNewchurch, Monmouthshire, Wales\nNewchurch, Powys, Wales\nNewchurch, Staffordshire, England\nNewchurch in Pendle, Lancashire"
                }
            },
            {
                "id": "carmarthenshire#oaklands",
                "name": "Oaklands",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Oaklands",
                    "_text": "Oaklands may refer to:\nPlaces\nOaklands, Carmarthenshire, Wales\nOaklands, Gauteng, a suburb of Johannesburg, South Africa\nOaklands, Hertfordshire, England\nOaklands, New South Wales, a town in Australia\nOaklands, New Zealand, a suburb of Christchurch, New Zealand\nOaklands, County Tyrone, a townland in County Tyrone, Northern Ireland\nInstitutions\nOaklands College, in Hertfordshire, England\nOaklands Catholic School, in Hampshire, England\nHistoric houses\nOaklands, a mansion that is today home to De La Salle College in Toronto\nOaklands, a plantation estate in Murfreesboro, Tennessee, now operated as Oaklands Historic House Museum\nRelated names\nOaklands Park, South Australia\nOaklands Junction, suburb of Melbourne, Australia\nOaklands railway station, Adelaide, South Australia"
                }
            },
            {
                "id": "carmarthenshire#pant-y-caws",
                "name": "Pant-y-Caws"
            },
            {
                "id": "carmarthenshire#pantyffynnon",
                "name": "Pantyffynnon",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pantyffynnon",
                        "_text": "Pantyffynnon is a small village in Carmarthenshire, Wales, half a mile south-west of Ammanford, and a mile east of Tycroes. It lies between the rivers Loughor and Amman at the foot of Mynydd y Betws.\nThe village is served by Pantyffynnon railway station on the Heart of Wales Line."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pantyffynnon",
                        "_text": "Pentref bychan yn ne Sir Gaerfyrddin yw Pantyffynnon. Mae'n rhan o gymuned Rhydaman.\nMae'n gorwedd tua milltir i'r de-orllewin o dref Rhydaman yn rhan isaf Dyffryn Aman. Fe'i lleolir rhwng afonydd Llwchwr ac Aman ac wrth droed Mynydd y Betws. Mae Gorsaf reilffordd Pantyffynnon ar llinell Rheilffordd Calon Cymru."
                    }
                ]
            },
            {
                "id": "carmarthenshire#pemberton",
                "name": "Pemberton",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Pemberton",
                    "_text": "Pemberton may refer to:"
                }
            },
            {
                "id": "carmarthenshire#pembrey",
                "name": "Pembrey",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Pembrey",
                    "_text": "Pembrey (Welsh: Pen-bre) is a village in Carmarthenshire, Wales, situated between Burry Port and Kidwelly, overlooking Carmarthen Bay.\n^ \"Pembrey ward population 2011\". Retrieved 16 April 2015."
                }
            },
            {
                "id": "carmarthenshire#pen-twyn",
                "name": "Pen-twyn"
            },
            {
                "id": "carmarthenshire#pen-y-banc",
                "name": "Pen-y-banc",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Pen-y-banc",
                    "_text": "Pentref bychan yng nghanol Sir Gaerfyrddin yw Pen-y-banc. Fe'i lleolir tua milltir a hanner i'r gogledd-orllewin o Landeilo, ar ffordd wledig sy'n dringo i gyfeiriad Capel Isaac i'r gogledd."
                }
            },
            {
                "id": "carmarthenshire#pen-y-bont",
                "name": "Pen-y-bont",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Pen-y-bont",
                    "_text": "Gallai Pen-y-bont neu Penybont gyfeirio at:\nPen-y-bont ar Ogwr, neu 'Pen-y-bont', tref yn ne Cymru (gweler hefyd Pen-y-bont ar Ogwr (gwahaniaethu)\nPen-y-bont, Maldwyn, pentref ym Mhowys\nPenybont, Powys, pentref a chymuned ym Mhowys\nPenybont, Ceredigion, pentrefan yng Ngheredigion\nPen-y-bont, Sir Gaerfyrddin\nPen-y-bont, ger Caerfyrddin\nPen-y-bont, ger Llanymddyfri\n\nPen-y-bont-fawr, pentref ym Mhowys"
                }
            },
            {
                "id": "carmarthenshire#pen-y-fai",
                "name": "Pen-y-fai",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Pen-y-fai",
                    "_text": "Pentref ym mwrdeistref sirol Pen-y-bont ar Ogwr yw Pen-y-fai. Fe'i lleolir i'r gogledd-orllewin o dref Pen-y-bont ar Ogwr ei hun, ar bwys y ffordd A4063. Poblogaeth: tua 2,000.\nCeir capel ymneilltuol, eglwys (Eglwys yr Holl Saint), siop a thafarn yn y pentref. Mae plant y pentref yn mynychu'r ysgol gynradd leol."
                }
            },
            {
                "id": "carmarthenshire#pen-y-fan",
                "name": "Pen-y-fan"
            },
            {
                "id": "carmarthenshire#pen-y-groes",
                "name": "Pen-y-groes"
            },
            {
                "id": "carmarthenshire#penboyr",
                "name": "Penboyr",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Penboyr",
                    "_text": "Penboyr is a hamlet in the county of Carmarthenshire, Wales consisting of a number of houses, smallholdings, farms and a church."
                }
            },
            {
                "id": "carmarthenshire#pencader",
                "name": "Pencader",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pencader",
                        "_text": "Pencader may refer to:\nPencader, Carmarthenshire, Wales\nPencader Hundred, an unincorporated subdivision of New Castle County, Delaware, in the United States"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pencader",
                        "_text": "Pentref bychan gwledig yng ngogledd Sir Gaerfyrddin yw Pencader. Gorwedd ar groesffordd ar lôn y B4459, tua 5 milltir i'r de-ddwyrain o Landysul ar lan un o ledneintiau llai Afon Teifi. Mae'n rhan o gymuned Llanfihangel-ar-Arth."
                    }
                ]
            },
            {
                "id": "carmarthenshire#pencarreg",
                "name": "Pencarreg",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pencarreg",
                        "_text": "Pencarreg is a village located in Carmarthenshire, Wales, 4 miles (6.4 km) to the south-west of Lampeter.\nSettlement is primarily grouped around the A485 road from Lampeter to Carmarthen. The population in the United Kingdom Census 2001 was 1,120, increasing to 1,169 at the 2011 Census."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pencarreg",
                        "_text": "Pentref a chymuned yn Sir Gaerfyrddin yw Pencarreg. Saif ar lan ddeheuol Afon Teifi, ychydig i'r gogledd-ddwrain o dref Llanybydder, ar y briffordd A485 rhwng Llanybydder a Llanbedr Pont Steffan. Mae'r eglwys wedi ei hadeiladu ar graig uwchben y pentref, a saif Llyn Pencarreg gerllaw. I'r dwyrain cyfyd llethrau Mynydd Pencarreg.\nBu Gwynfor Evans yn byw yn Nhalar Wen yma am flynyddoedd, a bu farw yno yn 2005. Mae'r gymuned yn cynnwys pentref Cwmann."
                    }
                ]
            },
            {
                "id": "carmarthenshire#penceiliogi",
                "name": "Penceiliogi"
            },
            {
                "id": "carmarthenshire#pendine (pentywyn)",
                "name": "Pendine (Pentywyn)"
            },
            {
                "id": "carmarthenshire#peniel",
                "name": "Peniel",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Peniel",
                        "_text": "Peniel may refer to: I have seen God face to face and my life is preserved. Gen 32:30\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Peniel",
                        "_text": "Gallai Peniel gyfeirio at un o nifer o leoedd:\nFfurf arall ar Penuel, lle a grybwyllir yn Genesis 32\nPeniel, Sir Gaerfyrddin\nPeniel, Sir Ddinbych"
                    }
                ]
            },
            {
                "id": "carmarthenshire#penplas",
                "name": "Penplas"
            },
            {
                "id": "carmarthenshire#penrhiwgoch",
                "name": "Penrhiwgoch"
            },
            {
                "id": "carmarthenshire#pensarn",
                "name": "Pensarn",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pensarn",
                        "_text": "Pensarn is a suburb of Abergele in Conwy County Borough, Wales. It has a population of around 2,000.\nThe name Pensarn means 'end of the causeway' in English. The crossing of Morfa Rhuddlan was facilitated by a causeway near the sea, located at this point. This causeway was later flanked by the holiday developments along the coast.\nPensarn is served by Abergele and Pensarn railway station, the A55 and National Cycle Route 5"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pensarn",
                        "_text": "Gweler hefyd: Pen-sarn (Ardudwy, Gwynedd) a Penysarn (Ynys Môn).\nPentref glan môr ym mwrdeisdref sirol Conwy yw Pensarn. Saif yng nghymuned Abergele ar arfordir gogledd-ddwyrain Cymru, rhwng Abergele i'r de-orllewin a Thywyn, Bae Cinmel a'r Rhyl i'r dwyrain. Rhed yr A549 trwy'r pentref ac mae Rheilffordd Arfordir Gogledd Cymru yn mynd trwyddo. Ceir gorsaf rheilffordd yno."
                    }
                ]
            },
            {
                "id": "carmarthenshire#pentowin",
                "name": "Pentowin"
            },
            {
                "id": "carmarthenshire#pentre",
                "name": "Pentre",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Pentre",
                    "_text": "Pentre is a village and community, near Treorchy in Rhondda valley, falling within the county borough of Rhondda Cynon Taf, Wales. The village's name is taken from the Welsh word Pentref, which translates as homestead, though Pentre is named after a large farm that dominated the area before the coming of industrialisation. The community takes in the neighbouring village of Ton Pentre."
                }
            },
            {
                "id": "carmarthenshire#pentre-cwrt",
                "name": "Pentre-cwrt",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Pentre-cwrt",
                    "_text": "This is a redirect from a title with a different spelling. Pages that link to this redirect may be updated to link directly to the target page if that results in an improvement of the text. Do not \"fix\" such links if they are not broken. Also, these links should not be replaced with piped links. For more information follow the category link."
                }
            },
            {
                "id": "carmarthenshire#pentre-gwenlais",
                "name": "Pentre-Gwenlais"
            },
            {
                "id": "carmarthenshire#pentre-poeth",
                "name": "Pentre-Poeth"
            },
            {
                "id": "carmarthenshire#pentre-ty-gwyn",
                "name": "Pentre-ty-gwyn"
            },
            {
                "id": "carmarthenshire#pentrebach",
                "name": "Pentrebach",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pentrebach",
                        "_text": "Pentrebach (sometimes written Pentre-Bach) (translation: small village) is a village in Merthyr Tydfil County Borough, Wales. It lies on the east side of the River Taff opposite Abercanaid, South of Merthyr and North of Troedyrhiw. To the east of the village lies the Mynydd Cilfach-yr-Encil which rises up to 445 m. Pentrebach can be translated as \"Little Village\"\nPentrebach is part of the Plymouth electoral ward which covers Pentrebach, Abercanaid and Troedyrhiw. The village was founded at the time that John Guest built the Plymouth Ironworks in 1763. The name Guest became part of the Guest, Keen and Nettelfold company (GKN). In 1818 Anthony Hill took over ownership of the business. His House was later used as an old people's home, and today has been converted into a Brewers Fayre Restaurant with a Premier Inn attached.\n\nThe original Merthyr Tramroad, built in 1802, ran alongside the site of the modern day village, on it way from Pennydarren to Abercynon, though very little of the village had been built at that time. A tunnel still exists, which can be visited on the Merthyr Road. Locomotives had to tip their chimneys while going though this tunnel due to the tunnel clearance.\nPentrebach has its own railway station. This opened in 1886 on the standard gauge Taff Vale Railway which runs from Cardiff to Merthyr alongside the River Taff. The original purpose of the railway was to carry iron ore to Cardiff Docks.\nIn 1862, on the south side of the Village, The South Duffryn Colliery was opened with two shafts which were 250 m deep. At the height of the production there were some 1300 men employed there. An opencast mine was also located on the mountainside above the village.\nThe Plymouth Ironworks closed in 1882 and the South Duffryn Colliery ceased production in 1940.\n\nAfter the war, new industries were attracted to the village. In 1945, the Kayser Bondor Factory opened making underwear, followed in 1948 by the establishment of the Hoover factory manufacturing washing machines. The factory later went on the produce the Sinclair C5 battery-powered three-wheeler car. On Friday, 6 March 2009, Hoover confirmed that it was to cease production of washing machines and other laundry products at the factory. Linde has set up a factory in the village on a site where the South Duffryn Colliery was located.\nPentrebach has two clubs: The Hills Plymouth Cricket Club, and the Pentrebach Working men's club. Pentrebach also has a chapel, Jerusalem Chapel, Greenfield School and an Integrated Children's Centre.\nThe mountain above Pentrebach has become popular with hang glider pilots in recent years."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pentrebach",
                        "_text": "Pentref ym mwrdeisdref sirol Merthyr Tudful yw Pentrebach, weithiau Pentre-bach.\nSaif i'r de o ganol tref Merthyr Tudful, yr ochr arall o Afon Taf i bentref Abercannaid ac i'r gogledd o bentref Troed-y-rhiw. I'r dwyrain o'r pentref mae Mynydd Cilfach-yr-Encil (445 m.).\nTyfodd y pentref wedi i John Guest sefydlu Gwaith Haearn Plymouth yn 1763. Roedd rheilffordd wreiddiol Trevethick, a adeiladwyd yn 1804, yn arwain trwy'r pentref ar ei ffordd rhwng Penydarren ac Abercynon. Mae twnel yn yn dal i'w weld yma. Agorwyd Glofa South Duffryn yn 1862."
                    }
                ]
            },
            {
                "id": "carmarthenshire#pentrefelin",
                "name": "Pentrefelin",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Pentrefelin",
                    "_text": "Mae Pentrefelin yn enw ar sawl lle yng Nghymru:\nPentrefelin, Ceredigion\nPentrefelin, Conwy\nPentrefelin, Gwynedd\nPentrefelin, Powys\nPentrefelin, Sir Gaerfyrddin\nPentrefelin, Ynys Môn, ar gyrion Amlwch\nGweler hefyd:\nPentre'r Felin (gwahaniaethu)"
                }
            },
            {
                "id": "carmarthenshire#pentywyn (pendine)",
                "name": "Pentywyn (Pendine)"
            },
            {
                "id": "carmarthenshire#penybanc",
                "name": "Penybanc"
            },
            {
                "id": "carmarthenshire#penybedd",
                "name": "Penybedd"
            },
            {
                "id": "carmarthenshire#pibwrlwyd",
                "name": "Pibwrlwyd"
            },
            {
                "id": "carmarthenshire#pinged",
                "name": "Pinged",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Pinged",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Pinged. Fe'i lleolir yn ne'r sir tua 2 filltir i'r gogledd o bentref Pen-bre ar y ffordd B4317."
                }
            },
            {
                "id": "carmarthenshire#plashett",
                "name": "Plashett"
            },
            {
                "id": "carmarthenshire#pont-ar-gothi",
                "name": "Pont-ar-gothi",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Pont-ar-gothi",
                    "_text": "This is a redirect from a title with another method of capitalisation. It leads to the title in accordance with the Wikipedia naming conventions for capitalisation, or it leads to a title that is associated in some way with the conventional capitalisation of this redirect title. This may help writing, searching and international language issues. For more information follow the category link.\nIf this redirect is an incorrect capitalization (a typo), then it is made available to aid searches, so pages that use this link should be updated to link directly to the target.\nUse this rcat to tag only mainspace redirects; when other capitalisations are in different namespaces, use {{R from modification}} instead."
                }
            },
            {
                "id": "carmarthenshire#pont-ar-llechau",
                "name": "Pont-ar-llechau",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Pont-ar-llechau",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Pont-ar-llechau. Fe'i lleolir yn nwyrain y sir tua 4 milltir i'r de o dref Llangadog, ar ffordd yr A4069.\nGorwedd y pentref wrth odrau gorllewinol y Mynydd Du ac mae'n rhan o Barc Cenedlaethol Bannau Brycheiniog. Llifa afon Sawddle, un o ledneintiau Afon Tywi, heibio i'r pentref."
                }
            },
            {
                "id": "carmarthenshire#pont-henri",
                "name": "Pont-Henri",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Pont-Henri",
                    "_text": "This is a redirect from a title with another method of capitalisation. It leads to the title in accordance with the Wikipedia naming conventions for capitalisation, or it leads to a title that is associated in some way with the conventional capitalisation of this redirect title. This may help writing, searching and international language issues. For more information follow the category link.\nIf this redirect is an incorrect capitalization (a typo), then it is made available to aid searches, so pages that use this link should be updated to link directly to the target.\nUse this rcat to tag only mainspace redirects; when other capitalisations are in different namespaces, use {{R from modification}} instead."
                }
            },
            {
                "id": "carmarthenshire#pont-newydd",
                "name": "Pont-newydd"
            },
            {
                "id": "carmarthenshire#pontamman",
                "name": "Pontamman"
            },
            {
                "id": "carmarthenshire#pontantwn",
                "name": "Pontantwn",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Pontantwn",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Pontantwn (hefyd Pont-antwn). Fe'i lleolir yn ne'r sir tua 6 milltir i'r gogledd-ddwyrain o dref Cydweli a thua'r un pellter i'r de o dref Caerfyrddin ar y ffordd B4309. Mae'n rhan o ardal Cwm Gwendraeth ac yng nghymuned Llangyndeyrn.\n↑ ENWAU LLEOEDD SIR GÂR"
                }
            },
            {
                "id": "carmarthenshire#pontarsais",
                "name": "Pontarsais",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Pontarsais",
                    "_text": "Pontarsais is a village in Carmarthenshire, Wales."
                }
            },
            {
                "id": "carmarthenshire#pontbren araeth",
                "name": "Pontbren Araeth"
            },
            {
                "id": "carmarthenshire#pontyates",
                "name": "Pontyates",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Pontyates",
                    "_text": "Pontyates (Welsh: Pont-iets) is a village situated in the Gwendraeth Valley halfway between Carmarthen and Llanelli in Carmarthenshire, West Wales.\n\n"
                }
            },
            {
                "id": "carmarthenshire#pontyberem",
                "name": "Pontyberem",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pontyberem",
                        "_text": "Pontyberem is a village situated in the Gwendraeth Valley halfway between Carmarthen and Llanelli in Carmarthenshire, Wales. As of the 2001 Census, the population was recorded as 2829, reducing to 2,768 at the 2011 Census."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pontyberem",
                        "_text": "Ffurfiwyd plwyf newydd o'r enw Pontyberem yn 1919 yn dilyn tyfiant y diwydiant glo. Y pwll glo hynaf oedd Glynhebog a chafwyd fod y glo o'r ansawdd gorau yn y byd.\nPentref diwydiannol a chymuned yng Nghwm Gwendraeth Fawr yw Pontyberem. Mae ardal Cyngor Cymuned Pontyberem yn gartref i 2,800 o bobl ac yn cynnwys pentref Bancffosfelen, a leolir ar lethr dwyreiniol Mynydd Llangyndeyrn. Yn ôl Cyfrifiad 2001, roedd 81.28% (1961:91% :1991:80.5%) o'r boblogaeth yn meddu ar un neu fwy o sgiliau yn yr iaith Gymraeg, gyda 60.83% yn gallu siarad, darllen ac ysgrifennu yn Gymraeg.\nGanwyd y gantores boblogaidd, Dorothy Squires mewn gwersyll ar gyrion Pontyberem. Mae Gwenda Owen y gantores a enillodd yr Ŵyl Ban-Geltaidd i Gymru ym 1995 gyda Chân yr Ynys Werdd yn enedigol o'r pentref.\nYm Mhontyberem mae pencadlys Menter Cwm Gwendraeth, y fenter iaith gyntaf i'w sefydlu yng Nghymru."
                    }
                ]
            },
            {
                "id": "carmarthenshire#porth tywyn (burry port)",
                "name": "Porth Tywyn (Burry Port)"
            },
            {
                "id": "carmarthenshire#porthyrhyd",
                "name": "Porthyrhyd"
            },
            {
                "id": "carmarthenshire#pumsaint",
                "name": "Pumsaint",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pumsaint",
                        "_text": "Pumsaint is a village in Carmarthenshire, Wales situated half way between Llanwrda and Lampeter on the A482 in the valley of the River Cothi. It forms part of the extensive estate of Dolaucothi which is owned by the National Trust.\n\nIts name means Five Saints derived from the Welsh Pum(p) meaning Five and Saint meaning Saint. The name is derived from the stone block at the nearby gold mines, opposite Ogofau Lodge, which has four sides, each of which has hollows probably caused by pestle impacts. It was used as an anvil for crushing gold ore in the Roman period. Excavations in the 1990s of the area adjacent to the stone showed that the stone was originally horizontal and used as an anvil for a water powered crushing mill. There are many parallels from Spanish mines of the Roman period with similar stone anvils. It is also sometimes known as the Pumpsaint."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pumsaint",
                        "_text": "Pentref yn Sir Gaerfyrddin yw Pumsaint neu Pumpsaint. Lleolir hanner ffordd rhwng Llanwrda a Llanbedr Pont Steffan ar ffordd yr A482 yn nyffryn yr Afon Cothi. Mae'n ffurfio rhan o ystad helaeth Dolaucothi ac mae'n eiddo i'r Ymddiriedolaeth Genedlaethol.\nMae plant y pentref yn mynychu Ysgol Gynradd Caio gerllaw."
                    }
                ]
            },
            {
                "id": "carmarthenshire#pwll",
                "name": "Pwll",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pwll",
                        "_text": "Pwll is a small coastal village, located between Llanelli and Burry Port. It has a local shop, Post Office, a few pubs, a primary school and local football and cricket teams. The village is concentrated along the north of the A484. The land rises away from the coast providing a view of the Gower Peninsula."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pwll",
                        "_text": "Gallai pwll gyfeirio at:\nTirffurf\nLlyn bychan, weithiau mewn afon\nPwll Ceris, Afon Menai\n\nTwll o ryw fath\nMwyngloddio\nPwll glo\nPwll Mawr, de Cymru\n\nPentrefi\nPwll, Sir Gaerfyrddin\nhefyd:\nPwllcrochan, Sir Benfro\nPwlldefaid, Gwynedd\nPwll-glas, Sir Ddinbych\nPwllgloyw, Powys\nPwllheli, Gwynedd\nPwllmeurig, Sir Fynwy\nPwll-trap, Sir Gaerfyrddin\nPwll-y-glaw, Castell-nedd Port Talbot\nNofio\nPwll nofio\nPwll Cenedlaethol Cymru\n\nGweler hefyd\nBrwydr Pwll Melyn\nLlan-y-pwll, Sir Wrecsam\nLlanfihangel-y-pwll, Bro Morgannwg"
                    }
                ]
            },
            {
                "id": "carmarthenshire#pwll-trap",
                "name": "Pwll-trap",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Pwll-trap",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Pwll-trap. Fe'i lleolir tua milltir i'r gorllewin o Sanclêr, yn ne-orllewin y sir, ar ffordd wledig rhwng Sanclêr a'r A40.\n↑ ENWAU LLEOEDD SIR GÂR"
                }
            },
            {
                "id": "carmarthenshire#pysgotwr fawr",
                "name": "Pysgotwr Fawr"
            },
            {
                "id": "carmarthenshire#ram",
                "name": "Ram",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ram",
                        "_text": "Ram, ram, or RAM may refer to:"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ram",
                        "_text": "Gallai Ram gyfeirio at un o sawl peth:\nLleoedd\nRam, pentref yn Sir Gaerfyrddin\nRam, tref yn Serbia\nEraill\nRAM, math o gof mewn cyfrifiadureg\nRam, albwm gan Paul McCartney"
                    }
                ]
            },
            {
                "id": "carmarthenshire#red roses",
                "name": "Red Roses",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Red Roses",
                    "_text": "Red Roses (Welsh: Rhos-goch, \"red moor\") is a village in Carmarthenshire, Wales."
                }
            },
            {
                "id": "carmarthenshire#rhandirmwyn",
                "name": "Rhandirmwyn",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Rhandirmwyn",
                    "_text": "Rhandirmwyn (or Rhandir-mwyn) is a small village in the north east of Carmarthenshire, Wales. Located in the upper Towy valley, 3 km north of Cilycwm village, it extends on both sides of the river. It lies in the parish of Llanfair-ar-y-bryn.\nThe Nantymwyn Lead Mine, above the village, was in existence since Roman times, and closed in 1932. Tourism is now the main industry."
                }
            },
            {
                "id": "carmarthenshire#rhos",
                "name": "Rhos",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Rhos",
                        "_text": "Rhos (meaning \"moorland\" in Welsh) may refer to the following places in Wales:\nRhos, Neath Port Talbot a village in Neath Port Talbot, Wales\nRhos-on-Sea (or Llandrillo-yn-Rhos), a village on the outskirts of Colwyn Bay, north Wales\nRhosllannerchrugog, a village in the County Borough of Wrexham in northeast Wales\nHistoric subdivisions\nRhos (north Wales), a cantref and prior to that a small kingdom in medieval mid-north Wales\nRhos, later the Hundred of Roose, a cantref around Milford Haven in southwest Wales"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Rhos",
                        "_text": "Am y cantref yn Sir Benfro, gweler Rhos. Gweler hefyd Rhos (gwahaniaethu)\nCantref yn Y Berfeddwlad yng ngogledd Cymru oedd Rhos (gorllewin Sir Ddinbych a dwyrain sir Conwy heddiw). Ymddengys yn bosibl fod Rhos yn un o fân deyrnasoedd Cymru yn y cyfnod ôl-Rufeinig a ddaeth yn rhan o deyrnas Gwynedd."
                    }
                ]
            },
            {
                "id": "carmarthenshire#rhosaman",
                "name": "Rhosaman",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Rhosaman",
                    "_text": "Pentref bychan yn ne-ddwyrain Sir Gaerfyrddin, Cymru yw Rhosaman. Fe'i enwir ar ôl rhosdir ar lan afon Aman, sy'n llifo trwy'r pentref. Mae yng nghymuned Cwarter Bach.\nMae Rhosaman yn sefyll ar bwys ffordd yr A4068, tua milltir a hanner i'r de-ddwyrain o dref Brynaman. I'r gogledd ceir y Mynydd Du. Y pentref agosaf yw Cwmllynfell, tua milltir i'r de-ddwyrain."
                }
            },
            {
                "id": "carmarthenshire#rhosmaen",
                "name": "Rhosmaen"
            },
            {
                "id": "carmarthenshire#rhosyn-coch",
                "name": "Rhosyn-coch"
            },
            {
                "id": "carmarthenshire#rhydaman",
                "name": "Rhydaman",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Rhydaman",
                    "_text": "Mae Rhydaman (Saesneg: Ammanford) yn dref a chymuned yn ne-ddwyrain Sir Gaerfyrddin. Mae ganddi 5,107 o drigolion, 75.88% ohonynt yn siarad Cymraeg (Cyfrifiad 2001). Mae Gorsaf reilffordd Rhydaman ar llinell Rheilffordd Calon Cymru."
                }
            },
            {
                "id": "carmarthenshire#rhydargaeau",
                "name": "Rhydargaeau",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Rhydargaeau",
                        "_text": "Rhydargaeau is a village in Carmarthenshire, Wales. It lies along the A485 road which connects it to Pontarsais in the north and Peniel and Carmarthen, 3.8 miles (6.1 km) to the south. The village is located in the community of Llanllawddog. The village pub is the Bluebell and Rhydargaeau also contains a Baptist church and Upper Llawddog Pump House.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Rhydargaeau",
                        "_text": "Pentref bychan yn Sir Gaerfyrddin yw Rhydargaeau. Fe'i lleolir yng nghanolbarth y sir ar y ffordd A485 tua 5 milltir i'r gogledd o dref Caerfyrddin."
                    }
                ]
            },
            {
                "id": "carmarthenshire#rhydcymerau",
                "name": "Rhydcymerau",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Rhydcymerau",
                        "_text": "Rhydcymerau is a small village 8.5 kilometres to the south-east of Llanybydder, around the side of Mynydd Llanybydder, in Carmarthenshire, south-west Wales.\nRhydcymerau is the birthplace of prominent Welsh writer and nationalist David John Williams, one of three saboteurs of the Penyberth bombing school in 1936. Two of his autobiographical volumes, Hen Dŷ Ffarm (“The Old Farmhouse”, 1953) and Yn Chwech ar Hugain Oed (“Twenty-Six Years Old”, 1959) give a portrait of life in this small town at the turn of the twentieth century.\nRhydcymerau is part of the community of Llanybydder, and has a chapel and a closed primary school."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Rhydcymerau",
                        "_text": "Lleolir pentref bach Rhydcymerau 8.5 cilometr i'r de-ddwyrain o dref Lanybydder yr ochr draw i Fynydd Llanybydder, yn Sir Gaerfyrddin, de-orllewin Cymru. Mae'n rhan o gymuned Llanybydder.\nMae gan Rhydcymerau gapel, tŷ tafarn ac ysgol gynradd."
                    }
                ]
            },
            {
                "id": "carmarthenshire#rhydyfelin",
                "name": "Rhydyfelin",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Rhydyfelin",
                        "_text": "Rhydyfelin (Welsh pronunciation: [r̥ɨdəˈvɛlɪn], Mill Ford) is a large village and part of the community of Pontypridd, a town about two miles to its north west, in the county borough of Rhondda Cynon Taf. It is on the eastern bank of the River Taff close to the A470, and historically was in the parish of Eglwysilan.\nRhydyfelin grew from a rural hamlet to a thriving village in the 19th century, due to its location on the Glamorganshire Canal which took iron from Merthyr Tydfil to the city of Cardiff, and linking to this Dr. Richard Griffiths' canal and tramway which took coal from the Rhondda Valleys. Also of note was the nearby Iron and Tin works at Treforest. Other minor works included an ironworks on the site of the tram shed buildings.\nNeighbouring villages are Hawthorn, Treforest and Glyntaff. The village is split into two electoral wards: the lower largely historic part of the village is in Hawthorn ward along with the settlement of Upper Boat which comprises some of the nearby Treforest Estate, while the largely modern housing estates of upper Rhydyfelin are in the ward of Rhydyfelen Central and Ilan. Rhydyfelin is also known as Rhydfelen, which means Yellow ford in the Welsh language.\nRhydyfelin was once served by two railway stations- one on the Cardiff Railway, and one on the Pontypridd, Caerphilly and Newport Railway. After the Grouping, the former Cardiff Railway halt became Rhydyfelin Low Level Halt and the halt of the Pontypridd, Caerphilly and Newport Railway became Rhydyfelin High Level Halt. The halts closed in 1931 and 1953 respectively."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Rhydyfelin",
                        "_text": "Gall Rhydyfelin gyfeirio at un o ddau bentref yng Nghymru:\nRhydyfelin, Ceredigion\nRhydyfelin, Rhondda Cynon Taf\nRhydyfelin, Powys"
                    }
                ]
            },
            {
                "id": "carmarthenshire#rhydywrach",
                "name": "Rhydywrach"
            },
            {
                "id": "carmarthenshire#salem",
                "name": "Salem",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Salem",
                        "_text": "Salem often refers to:\nSalem, Massachusetts, a city in the U.S. state of Massachusetts\nSalem witch trials of 1692, which took place there\n\nSalem, Oregon, the capital of the U.S. state of Oregon\nSalem, Tamil Nadu, a city in India\nSalem (name), people with the name\nSalem may also refer to:"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Salem",
                        "_text": "Enw o'r Beibl ydy Salem.\nGweler Salem (cyfeiriad Beiblaidd) ((sa'lem) Hebraeg am \"heddwch\")"
                    }
                ]
            },
            {
                "id": "carmarthenshire#sandy",
                "name": "Sandy",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Sandy",
                        "_text": "Sandy may refer to:"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Sandy",
                        "_text": "Gallai Sandy gyfeirio at:\nDaearyddiaeth\nSandy, Sir Gaerfyrddin, pentref ger Llanelli\nSandy, Swydd Bedford, pentref yn Lloegr\nSandy Ground, porthladd yn Anguilla\nEnw personol\nSandy Casar, seiclwr Ffrengig\nSandy Mewies, Aelod Cynulliad\nSandy Shaw, cantores"
                    }
                ]
            },
            {
                "id": "carmarthenshire#sardis",
                "name": "Sardis",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Sardis",
                    "_text": "Sardis (\/ˈsɑrdɪs\/) or Sardes (\/ˈsɑrdiːz\/; Lydian: Sfard; Ancient Greek: Σάρδεις Sardeis; Old Persian: 𐎿𐎱𐎼𐎭 Sparda) was an ancient city at the location of modern Sart (Sartmahmut before 19 October 2005) in Turkey's Manisa Province. Sardis was the capital of the ancient kingdom of Lydia, one of the important cities of the Persian Empire, the seat of a proconsul under the Roman Empire, and the metropolis of the province Lydia in later Roman and Byzantine times. As one of the Seven churches of Asia, it was addressed by the author John of the Book of Revelation in the Holy Bible in terms which seem to imply that its population was notoriously soft and fainthearted. Its importance was due, first to its military strength, secondly to its situation on an important highway leading from the interior to the Aegean coast, and thirdly to its commanding the wide and fertile plain of the Hermus.\n^ Rhodes, P.J. A History of the Classical Greek World 478-323 BC. 2nd edition. Chichester: Wiley-Blackwell, 2010, p. 6."
                }
            },
            {
                "id": "carmarthenshire#saron",
                "name": "Saron",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Saron",
                        "_text": "Saron may refer to:\nSaron, Western Cape, a town in South Africa\nSaron, Thiruvannamalai,a township in the Indian district of Thiruvannamalai\nSaron (Cantabria, Spain) a village of Santa Maria de Cayón Municipalitie\nSaron, a mythical king who gave his name to the Saronic Gulf\nA Biblical name also written as Sharon\nSaron Läänmäe (born 1996), Estonian footballer\n\nSaron (instrument), an instrument in the Indonesian gamelan ensemble\nSaron, Carmarthenshire, a small mining village in West Wales near Ammanford\nSaron, a small village in Denbighshire, Wales\nSaron, Gwynedd, a hamlet near Caernarfon (grid reference SH4659)\nSaron Gas, original name of hard rock band Seether\nBedehuset Saron, a Gospel Hall in Bryne, Norway\nSARON, Swiss Average Rate Overnight, an interest rate statistic\nSaron, a genus of shrimp"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Saron",
                        "_text": "Gall Saron (o'r Hebraeg: שָׁרוֹ, Šaron) gyfeirio at:\nGwastadedd Saron yn Israel.\nSaron, pentref yn Sir Ddinbych\nSaron, pentref yn Sir Gaerfyrddin gerllaw Rhydaman\nSaron, pentref yn Sir Gaerfyrddin gerllaw Castell Newydd Emlyn\nSaron, pentref yng Ngwynedd i'r de o Gaernarfon\nSaron, pentref yng Ngwynedd gerllaw Bethel\nHefyd:\nRhosyn Saron (Hypericum calycinum), planhigyn"
                    }
                ]
            },
            {
                "id": "carmarthenshire#siloh",
                "name": "Siloh"
            },
            {
                "id": "carmarthenshire#st clears",
                "name": "St Clears",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/St Clears",
                    "_text": "St Clears (\/səntˈklɛərz\/ sənt-KLAIRZ; Welsh: Sanclêr) is a small town on the River Tâf in Carmarthenshire, Wales. According to the 2001 UK census, it has a population of 2,820 people, most of whom are Welsh-speaking, although there is a marked difference between the southern and northern ends of the town in percentage terms. The population had increased to 2,995 at the 2011 census."
                }
            },
            {
                "id": "carmarthenshire#swiss valley",
                "name": "Swiss Valley"
            },
            {
                "id": "carmarthenshire#sylen",
                "name": "Sylen",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Sylen",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Sylen. Fe'i lleolir yn ne'r sir tua 5 milltir i'r gogledd o dref Llanelli ar ffordd wledig. Y pentref agosaf yw Cynheidre.\nEnwir Mynydd Sylen ar ôl y pentref."
                }
            },
            {
                "id": "carmarthenshire#taf",
                "name": "Taf",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Taf",
                    "_text": "This is a redirect from a title with another method of capitalisation. It leads to the title in accordance with the Wikipedia naming conventions for capitalisation, or it leads to a title that is associated in some way with the conventional capitalisation of this redirect title. This may help writing, searching and international language issues. For more information follow the category link.\nUse this rcat to tag only mainspace redirects; when other capitalisations are in different namespaces, use {{R from modification}} instead."
                }
            },
            {
                "id": "carmarthenshire#talley",
                "name": "Talley",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Talley",
                    "_text": "Talley (Welsh: Talyllychau) is a small village in Carmarthenshire, Wales.The population taken at the 2011 census was 494.\nIt is the site of the ruined Talley Abbey, a former Premonstratensian foundation destroyed in about 1536 during the Dissolution of the Monasteries.\n^ \"Community population 2011\". Retrieved 16 April 2015."
                }
            },
            {
                "id": "carmarthenshire#talog",
                "name": "Talog",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Talog",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Talog. Fe'i lleolir ar ffordd wledig tua 6 milltir i'r gogledd-orllewin o Gaerfyrddin, yng ngogledd y sir."
                }
            },
            {
                "id": "carmarthenshire#talsarn",
                "name": "Talsarn"
            },
            {
                "id": "carmarthenshire#tanerdy",
                "name": "Tanerdy",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Tanerdy",
                    "_text": "This is a redirect from a subtopic of the target article. For more information follow the category link."
                }
            },
            {
                "id": "carmarthenshire#tanglwst",
                "name": "Tanglwst"
            },
            {
                "id": "carmarthenshire#tavernspite",
                "name": "Tavernspite",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Tavernspite",
                        "_text": "Tavernspite is a small village about 6 miles (9.7 km) southeast of Narberth in Pembrokeshire, southwest Wales. It lies on the B4314 Pendine to Templeton road, close to the border with Carmarthenshire."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Tavernspite",
                        "_text": "Pentref yn Sir Benfro yw Tavernspite. Ymddengys nad oes enw Cymraeg am y pentref. Fe'i lleolir yn ne-ddwyrain Sir Benfro am y ffin â Sir Gaerfyrddin, ar groesffordd wledig tua hanner ffordd rhwng Arberth (Sir Benfro) i'r gorllewin a Sanclêr (Sir Gaerfyrddin) i'r dwyrain.\nCeir Ysgol Gynradd Gymunedol Tavernspite yn y pentref."
                    }
                ]
            },
            {
                "id": "carmarthenshire#teifi",
                "name": "Teifi"
            },
            {
                "id": "carmarthenshire#temple bar",
                "name": "Temple Bar",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Temple Bar",
                        "_text": "Temple Bar may refer to:\nTemple Bar, London, a spot in London\nTemple Bar, Dublin, a cultural quarter in Dublin\nTemple Bar TradFest, a traditional Irish music and cultural festival at the location above\nTemple Bar Gallery and Studios, at the location above\n\nTemple Bar, Lake Mead, a site on the Arizona side of Lake Mead\nTemple Bar Marina, a marina on Lake Mead in the U.S. state of Arizona\nTemple Bar Airport, airport at the location above\n\nTemple Bar, Ceredigion, a village in Ceredigion, Wales\nTemple Bar (magazine), a British literary magazine published 1860 to 1906\nMory's or \"Mory's Temple Bar\", a private club in New Haven, Connecticut near the Yale campus"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Temple Bar",
                        "_text": "Gall Temple Bar gyfeirio at:\nTemple Bar (Llundain)\nTemple Bar (Dulyn)\nTemple Bar (Ceredigion)\nTemple Bar Magazine, cylchgrawn llenyddol Prydeinig a gyhoeddwyd o 1860 hyd 1906"
                    }
                ]
            },
            {
                "id": "carmarthenshire#tir-y-dail",
                "name": "Tir-y-dail",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Tir-y-dail",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Tir-y-dail. Fe'i lleolir yn ne-ddwyrain y sir tua milltir i'r gogledd o dref Rhydaman, ar ffordd yr A483, a thua 3 milltir i'r de o bentref Llandybie."
                }
            },
            {
                "id": "carmarthenshire#trapp",
                "name": "Trapp",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Trapp",
                    "_text": "Trapp is a surname. Notable people with the surname include:\nA. A. Trapp, Manitoba politician\nAlbert Trapp, Manitoba politician\nElisabeth von Trapp, folk singer, granddaughter of Georg and Agatha von Trapp\nGeorg Ludwig von Trapp, naval officer and head of the singing family immortalized in the musical The Sound of Music.\nJames Trapp, former American sprinter and American football player\nJohn Trapp, English Anglican Bible commentator\nKevin Trapp, German football goalkeeper\nMaria von Trapp, stepmother and matriarch of the Trapp Family Singers\nMaria F. von Trapp, member of the Trapp Family Singers\nMartin E. Trapp, Oklahoma politician\nPetr Trapp, a Czech footballer\nWerner von Trapp, member of the Trapp Family Singers\nWil Trapp, American professional soccer player\nFictional characters:\nCaptain Edward Trapp, a fictional hero of Brian Callison's 4-book series"
                }
            },
            {
                "id": "carmarthenshire#tre-gynwer",
                "name": "Tre-gynwer"
            },
            {
                "id": "carmarthenshire#tre-vaughan",
                "name": "Tre-vaughan"
            },
            {
                "id": "carmarthenshire#trelech",
                "name": "Trelech",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Trelech",
                        "_text": "Trelech (Welsh: Tre-lech) is a village in the parish of Tre-lech a'r Betws, Carmarthenshire, in south-west Wales, lying some 10 miles north-west of Carmarthen and 6.5 miles south of Newcastle Emlyn.\n\nThe population taken at the 2011 census was 745.\nThe village is home to the Welsh-medium Ysgol Hafodwenog (Hafodwenog Community Primary School), which has around 60 pupils aged 4 to 11, and was opened in 1972 to serve the children of the surrounding settlements of Alma, Bryn Iwan, Cilrhedyn, Dinas, Gelliwen, Pandy, Penybont, and Talog, as well as those of Trelech itself.\nTrelech has a community centre (in the building, across the road, which housed the modern school's predecessor) and a pub, the Tafarn Beca. However, given the area's very rural and lightly populated nature, the village no longer has a shop or post office. There is a children's play area, and the school also has a small soccer field.\nTrelech was the birthplace on 14 November 1801 of David Rees (Y Cynhyrfwr), the reforming Welsh Congregationalist minister, and on 3 November 1879 of the reporter, poet, and short-story writer Perceval Gibbon, who travelled extensively in Europe, Africa, and the Americas and died in Guernsey on 30 May 1926."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Trelech",
                        "_text": "Mae mwy nag un pentref o'r enw hwn yng Nghymru.\nTrelech, Sir Gaerfyrddin\nTrelech, Sir Fynwy\nTarddiad yr enwau hyn i gyd yw tref sef 'cartref', 'fferm', 'trefedigaeth' + llech 'math o garreg'."
                    }
                ]
            },
            {
                "id": "carmarthenshire#trevaughan",
                "name": "Trevaughan",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Trevaughan",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Trevaughan. Ymddengys nad oes ffurf Gymreigiach ar yr enw. Fe'i lleolir tua hanner milltir i'r de o Hendy-gwyn ar Daf, yn ne-orllewin y sir, bron am y ffin â Sir Benfro. Rhed y ffordd B4328 trwy'r pentref gan ei gysylltu gyda'r Hendy-gwyn i'r gogledd a phentrefi Llwyn-y-brain a Tavernspite i'r de."
                }
            },
            {
                "id": "carmarthenshire#trimsaran",
                "name": "Trimsaran",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Trimsaran",
                        "_text": "Trimsaran is a former mining village which lies on the B4308 between Llanelli and Kidwelly, in the Welsh county of Carmarthenshire.\nTrimsaran is six miles (10 km) from Llanelli, and 13 miles (21 km) from Carmarthen. It is close to Burry Port harbour, Pembrey Country Park and the Millennium Coastal Park."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Trimsaran",
                        "_text": "Pentref a chymuned yn Sir Gaerfyrddin yw Trimsaran. Saif ar y ffordd B4308 rhwng Llanelli a Chydweli, chwe milltir o Lanelli ac 13 milltir o dref Caerfyrddin. Pentref glofaol oedd hyd nes i'r pyllau glo yn yr ardal gau; daeth y gweithgaroedd olaf i ben yn 1997."
                    }
                ]
            },
            {
                "id": "carmarthenshire#trostre",
                "name": "Trostre"
            },
            {
                "id": "carmarthenshire#tumble",
                "name": "Tumble",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Tumble",
                    "_text": "Tumble or tumbling may refer to:\nTumbling (gymnastics), a sport where gymnasts make a pass down a sprung track performing tumbling moves.\nTumble (TV series), a British TV series\nTumble bus, mobile gymnastics school bus\nTumble finishing is a technique for smoothing and polishing the surface on small parts\nTumble RFC, rugby union club of the village below\nTumble (video game), 2010 downloadable video game available on the PlayStation Network\nMr Tumble, character on the BBC TV series Something Special.\nTumble may also refer to the following places:\nTumble, Carmarthenshire, a village in South Wales"
                }
            },
            {
                "id": "carmarthenshire#twynllanan",
                "name": "Twynllanan"
            },
            {
                "id": "carmarthenshire#twynmynydd",
                "name": "Twynmynydd"
            },
            {
                "id": "carmarthenshire#ty-isaf",
                "name": "Ty-isaf"
            },
            {
                "id": "carmarthenshire#tycroes",
                "name": "Tycroes",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Tycroes",
                    "_text": "Tycroes is a village in Carmarthenshire, Wales. As measured in the 2001 Census, the population of Tycroes was 2,156 persons (49% male, 51% female). Tycroes School has around 180 pupils.\nAt the 2011 Census all the population was counted in Llanedi community.\nThe village forms the westernmost fringe of the Amman valley and rests mainly on the anthracite coal measures, part of the South Wales coalfield. It straddles the A483 Swansea to Manchester Trunk road and has a linear village structure, having developed substantially along roads which meet at the centre of the village. The trunk road is in the main artery from north to south of the country and is connected to the M4 motorway network which affords transportation from mainland Europe to Ireland. The rail link at nearby Pantyffynnon contributes a daily service to Swansea, Llanelli and Shrewsbury.\nTopographically, the village slopes in a general south west to north east direction thus affording panoramic views of the Black Mountain in the east with its peaks - Tair Cairn 482 m, Garreg Lwyd 616 m and behind them Fan Hir 802 m. To the south there are views from Betws Mountain to Mynydd y Gwair above Garnswllt. To the north there is the limestone ridge from Llandybie to Upper Tumble.\nThe Fferws brook which flows from the west to the east divides the local authority administrative areas between Llanedi and Llandybie Community Councils. The name Fferws is possibly derived from the fact that the river flows over mineral rocks which contain iron ore (ferrous being the chemical name for iron). Others say it derives from a delightful house that once stood on its banks - \"fairhouse\"."
                }
            },
            {
                "id": "carmarthenshire#tyle",
                "name": "Tyle"
            },
            {
                "id": "carmarthenshire#tywi",
                "name": "Tywi",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Tywi",
                    "_text": "Gall Tywi gyfeirio at:\nAfon Tywi\nYstrad Tywi\nMynydd Tywi\nMynydd Tywi (copa gogleddol Pen y Maen)\nMynydd Tywi (copa dwyreiniol)\nBrwydr Aber Tywi"
                }
            },
            {
                "id": "carmarthenshire#upper brynamman",
                "name": "Upper Brynamman"
            },
            {
                "id": "carmarthenshire#waun y clyn",
                "name": "Waun y Clyn",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Waun y Clyn",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Waun y Clyn. Fe'i lleolir yn ne'r sir tua 5 milltir i'r gogledd-ddwyrain o bentref Pen-bre a milltir i'r de o bentref Trimsaran ar ffordd wledig."
                }
            },
            {
                "id": "carmarthenshire#waungilwen",
                "name": "Waungilwen"
            },
            {
                "id": "carmarthenshire#white mill",
                "name": "White Mill",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/White Mill",
                    "_text": "White Mill, White Mills and White's Mill may refer to:"
                }
            },
            {
                "id": "carmarthenshire#whitland",
                "name": "Whitland",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Whitland",
                    "_text": "Whitland (Welsh: Hendy-gwyn, lit. \"Old White House\", or Hendy-gwyn ar Daf, \"Old White House on the River Taf\", both in reference to the medieval Ty Gwyn ar Daf) is a small town in Carmarthenshire, south-west Wales, lying on the River Tâf. Whitland is home to the elusive \"Whitland Trout\", noted for its eggs and oily scales."
                }
            },
            {
                "id": "carmarthenshire#yspitty",
                "name": "Yspitty"
            }
        ]
    }
}