{
    "id": "Ceredigion",
    "population": {
        "href": {

        },
        "_text": {

        }
    },
    "poscodes": {
        "postcode": [
            "SA38",
            "SA40",
            "SA43",
            "SA44",
            "SA45",
            "SA46",
            "SA47",
            "SA48",
            "SY20",
            "SY23",
            "SY24",
            "SY25"
        ]
    },
    "towns": {
        "town": [
            {
                "id": "ceredigion#aber-banc",
                "name": "Aber-banc",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Aber-banc",
                    "_text": "Pentref yng Ngheredigion yw Aber-banc. Saif ar dro cas ar yr A475 tua 4 milltir i’r dwyraIn i Gastell Newydd Emlyn.\nMae Nant Gwylan ac Afon Cwerchyr yn ymuno ag Afon Cynllo yma ac mae nifer o orchmynion Cadw Coed ar hyd glannau gogledd ddwyreiniol Afon Cynllo. Mae canolbwynt hanesyddol y pentref yn cynnwys tai arbennig wedi eu gwneud o gerrig, yn unigol ac yn dai teras. Mae'r datblygiadau mwy diweddar ar ffurf clwstwr estynedig ar fryn i gyfeiriad y gorllewin allan o'r dyffryn ar hyd yr A475. Mae'r pentref yn cynnwys rhagor na 25 o aneddau. Mae Capel y Methodistiaid yn adeilad rhestredig.\nMae gan y pentref ysgol gynradd sy’n gwasanaethu’r cymunedau cyfagos ym Mhenrhiw-llan a Henllan. Mae'r iaith Gymraeg yn cael ei siarad yn feunyddiol. Mae Aber-banc yn dibynnu ar Gastellnewydd Emlyn am wasanaethau beunyddiol ac am ei brif wasanaethau. Mae ar lwybr bysys rhwng Llandysul a Chastellnewydd Emlyn ac mae gwasanaeth bob dydd."
                }
            },
            {
                "id": "ceredigion#aberaeron",
                "name": "Aberaeron",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Aberaeron",
                        "_text": "Aberaeron (formerly anglicised Aberayron) is a seaside resort town in Ceredigion, Wales. Situated between Aberystwyth and Cardigan, it is home to the headquarters of Ceredigion County Council. The population was 1,520 in 2001, reducing to 1,422 at the 2011 census. An electoral ward exists with an identical population. The name is from Welsh Aberaeron, meaning \"mouth of the River Aeron\", derived from the Middle Welsh aer - 'slaughter', which gave its name to Aeron, who is believed to have been a Welsh god of war."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Aberaeron",
                        "_text": "Gweler hefyd Aeron (gwahaniaethu).\n\nTref arfordirol yng Ngheredigion yw Aberaeron. Saif ar briffordd yr A487 tua hanner ffordd rhwng Aberteifi ac Aberystwyth. Mae lôn arall, yr A482, yn cysylltu'r dref â Llanbedr Pont Steffan i'r dwyrain. Mae Caerdydd 112.8 km i ffwrdd o Aberaeron ac mae Llundain yn 297.2 km. Y ddinas agosaf ydy Abertawe sy'n 70.6 km i ffwrdd.\nAdeiladwyd y dref gan y Parch Alban Thomas Jones-Gwynne ym 1805. Mae'r tai wedi'u gosod mewn patrwm ffurfiol — o dan ddylanwad y pensaer John Nash, medd rhai.\nCrëwyd harbwr ar geg Afon Aeron, ac yn fuan daeth y dref yn ganolfan bysgota bwysig. Erbyn hyn, cychau hwylio sydd i'w gweld yn harbwr Aberaeron. Mae'r traeth yn braf ac wedi ennill baner las am ei lendid.\nGan fod Aberaeron rhwng de a gogledd Ceredigion, yma bellach mae pencadlys Cyngor Sir Ceredigion. Mae tua 1,520 o bobl yn byw yn y dref ac mae dros 70% ohonyn nhw yn siaradwyr Cymraeg (2001); un o'r canrannau uchaf ar arfordir Ceredigion heddiw.\nGerllaw ceir plasdy hynafol Llannerch Aeron, sy'n eiddo i'r Ymddiriedolaeth Genedlaethol.\nLleolir Ysgol Gyfun Aberaeron yn y dref."
                    }
                ]
            },
            {
                "id": "ceredigion#aberarth",
                "name": "Aberarth",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Aberarth",
                        "_text": "Aberarth, Ceredigion, Wales is a small seaside village situated towards the southern end of Cardigan Bay between Aberystwyth and Cardigan.\n\nAs its name suggests it is at the mouth of the River Arth and is on the A487 coastal road."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Aberarth",
                        "_text": "Pentref bach ar arfordir Ceredigion, tua 3 milltir i'r gogledd o Aberaeron yw Aberarth (neu Aber-arth). Fel yr awgryma ei enw, mae'r pentref yn sefyll ar aber afon Arth lle rhed yr afon honno i Fae Ceredigion. Gellir gyrru drwy Aberarth ar yr A487 o Aberaeron i Lanon. Mae yng nghymuned Dyffryn Arth."
                    }
                ]
            },
            {
                "id": "ceredigion#aberffrwd",
                "name": "Aberffrwd",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Aberffrwd",
                        "_text": "Aberffrwd may refer to one of the following places in Wales:\nAberffrwd, Ceredigion\nAberffrwd, Monmouthshire"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Aberffrwd",
                        "_text": "Ceir dau bentref yng Nghymru o'r enw Aberffrwd:\nAberffrwd, Ceredigion\nAberffrwd, Sir Fynwy"
                    }
                ]
            },
            {
                "id": "ceredigion#aberlerry",
                "name": "Aberlerry"
            },
            {
                "id": "ceredigion#abermagwr",
                "name": "Abermagwr",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Abermagwr",
                        "_text": "Abermagwr is a small settlement in the county of Ceredigion, Wales. It is on the B4340 road and is 11 kilometres (7 mi) southeast of the town of Aberystwyth.\nIn 2010 the remains of a Roman villa were discovered on land in Abermagwr, they were excavated in 2010 and 2011 . Until the discovery of the Roman villa in Abermagwr it was believed by archaeologists that Ceredigion was a military zone, unsettled by the Romano-British."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Abermagwr",
                        "_text": "Pentref bychan iawn yn sir Ceredigion yw Abermagwr. Fe'i lleolir yn ngogledd y sir, ar y B4340 tua 9 milltir i'r dwyrain o Aberystwyth.\nMae Abermagwr yn rhan o gymuned y Trawsgoed. Caiff ei enw o aber Afon Magwr yn Afon Ystwyth, ger y pentref. Gorwedd plasdy hynafol y Trawscoed gyda'i chaer Rhufeinig tua hanner milltir i'r de o'r pentref."
                    }
                ]
            },
            {
                "id": "ceredigion#aberporth",
                "name": "Aberporth",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Aberporth",
                    "_text": "Aberporth is a community and large village in Ceredigion on the west coast of Wales. The population was 2,485 in 2001, 49% of whom spoke Welsh, according to the 2001 Census, reducing slightly to 2,374 at the 2011 Census. Its beach has earned Blue flag status.\n\n"
                }
            },
            {
                "id": "ceredigion#aberteifi (cardigan)",
                "name": "Aberteifi (Cardigan)"
            },
            {
                "id": "ceredigion#aberystwyth",
                "name": "Aberystwyth",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Aberystwyth",
                        "_text": "Aberystwyth (Mouth of the Ystwyth, \/ˌæbəˈrɪstwɪθ\/, Welsh: [abɛrˈəstʊɨθ]) is a historic market town, administrative centre and holiday resort within Ceredigion, West Wales. Often colloquially known as Aber, it is located near the confluence of the rivers Ystwyth and Rheidol.\nSince the late 19th century, Aberystwyth has also been a major Welsh educational centre, with the establishment of a university college there in 1872. At the 2001 census, the town's population was 15,935, reducing to 13,040 at the 2011 Census. During nine months of the year, there is an influx of students—to a total number of 10,400 as of September 2012."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Aberystwyth",
                        "_text": "Tref fwyaf Ceredigion, ar arfordir gorllewin Cymru yw Aberystwyth. Mae'n sefyll ar lan Bae Ceredigion lle mae'r afonydd Rheidol ac Ystwyth ill dwy yn aberu. Cododd Edmwnt, brawd y brenin Edward I ar Loegr y castell presennol yn 1277 a thyfodd y dref o gwmpas y castell. Daeth yr harbwr yn bwysig yn y bedwaredd ganrif ar ddeg o ganlyniad i'r cloddfeydd plwm a oedd yn yr ardal. Enillodd Aberystwyth y teitl 'Tref Orau Prydain' yn 2015 gan yr Academy of Urbanisation.\nMae Caerdydd 120.9 km i ffwrdd o Aberystwyth ac mae Llundain yn 290.7 km. Y ddinas agosaf ydy Abertawe sy'n 87.2 km i ffwrdd."
                    }
                ]
            },
            {
                "id": "ceredigion#aeron",
                "name": "Aeron",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Aeron",
                        "_text": "Aeron is used in several ways including:\nAeron (Celtic mythology), masculine god of battle or slaughter\nAeron chair, product of Herman Miller designed in 1994\nAeron Clement (1936–1989), American science fiction author\nAeron Express, hand powered cable ferry in the Welsh coastal town of Aberaeron\nAlejandra and Aeron, artists based in Oslo, Norway\nCiliau Aeron, small village near Aberaeron in Ceredigion, Wales\nRiver Aeron, small river that flows into Cardigan Bay\nYstrad Aeron, small village between Lampeter and Aberaeron, Wales\nAeron (kingdom), early Brythonic kingdom in northern Britain"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Aeron",
                        "_text": "Mae hon yn erthygl am y fro yn yr Hen Ogledd, ac enw Cymraeg ar y swydd a elwir yn Ayrshire yn Saesneg. Am enghreifftiau eraill o'r enw gweler Aeron (gwahaniaethu).\nAeron, yn ôl pob tebyg, oedd enw bro yn yr Hen Ogledd y cyfeirir ati yng Nghanu Aneirin a Chanu Taliesin. Credir bod ei thiriogaeth yn gyfateb yn fras i hen Swydd Aeron (Ayrshire) yn ne-orllewin yr Alban.\nYn Y Gododdin cysylltir yr arwr Cynon fab Clydno ag Aeron. Mae'n cael ei ddisgrifio fel dileid Aeron ('amddiffynydd Aeron') a ymunodd â gwŷr Manaw Gododdin i fynd i frwydro yng Nghatraeth. Mae'r gerdd yn sôn am 'ddau gadgi Aeron' (dau ryfelwyr o Aeron) a rhyw 'Cynddilig Aeron' anhysbys yn ogystal.\nMae'r rhan fwyaf o ysgolheigion yn cytuno mai'r hen Swydd Ayr yn yr Alban yw'r Aeron yng ngwaith Taliesin ac Aneirin.\nPosiblrwydd arall yw ei bod rhywle ger teyrnas Elfed (gogledd canolbarth Lloegr) gan fod Aire yn enw ar afon yn nwyrain Swydd Efrog.\nDisgrifir Urien Rheged fel 'diffreidawc Aeron' ('amddiffynydd Aeron') mewn cerdd yng Nghanu Taliesin a sonnir amdano yn mynd i Aeron i ymladd yn erbyn y gelyn. Mae'n bosibl felly fod Aeron naill ai yn rhan o deyrnas Rheged yn amser Urien neu'n gorwedd rhwng y deyrnas honno a Stratclud (Ystrad Clud); efallai fod Aeron yn deyrnas annibynnol ar un adeg felly.\nCysylltir Aeron, trwy Urien a Chlydno, â llinach Coel Hen."
                    }
                ]
            },
            {
                "id": "ceredigion#afon dulas",
                "name": "Afon Dulas",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Afon Dulas",
                        "_text": "The Afon Dulas (also referred to as the North Dulas) is a river forming the border between Merionethshire\/Gwynedd and Montgomeryshire\/Powys in Wales."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Afon Dulas",
                        "_text": "Gallai Afon Dulas gyfeirio at:\nAfon Dulas (Rhos), ym mwrdeisdref sirol Conwy\nAfon Dulas (Ceredigion)\nAfon Dulas (Gwynedd), un o lednentydd Afon Dyfi\nAfon Dulas (Powys), un o lednentydd Afon Dyfi"
                    }
                ]
            },
            {
                "id": "ceredigion#afon grannell",
                "name": "Afon Grannell"
            },
            {
                "id": "ceredigion#afon mydyr",
                "name": "Afon Mydyr"
            },
            {
                "id": "ceredigion#alltyblaca",
                "name": "Alltyblaca",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Alltyblaca",
                    "_text": "Pentref bychan yn ne sir Ceredigion yw Alltyblaca, weithiau Alltyblacca. Saif yn agos i'r ffin â Sir Gaerfyrddin, ychydig i'r gogledd o Lanybydder, ac ar lan ogleddol Afon Teifi. Mae'r ffordd B4337 o Lanwnnen i Lanybydder yn mynd trwy'r pentref.\nDaeth y pentref yn enwog oherwydd ei gysylltiad âD. Jacob Davies. Roedd Thomas Evans (Tomos Glyn Cothi), gweinidog Undodaidd cyntaf Cymru, yn weinidog yn Alltyblaca am gyfnod yn y 1780au."
                }
            },
            {
                "id": "ceredigion#banc-y-darren",
                "name": "Banc-y-Darren",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Banc-y-Darren",
                        "_text": "Banc-y-Darren is a small hamlet near the town Aberystwyth in Ceredigion, Wales. There are 8 houses there, and fields and farms near by."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Banc-y-Darren",
                        "_text": "Pentrefan bach yng nghymuned Trefeurig, Ceredigion, Cymru yw Banc-y-Darren, sydd 73.2 milltir (117.7 km) o Gaerdydd a 174.5 milltir (280.8 km) o Lundain.\n\nCynrychiolir Banc-y-Darren yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#bangor teifi",
                "name": "Bangor Teifi",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Bangor Teifi",
                        "_text": "Bangor Teifi is a hamlet in the community of Llandyfriog, Ceredigion, Wales, which is 63.7 miles (102.5km) from Cardiff and 184.7 miles (297.2km) from London. Bangor Teifi is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\n^ National Assembly for Wales Website; recalled 24 February 2014\n^ parliament.uk Website; recalled 24 February 2014"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Bangor Teifi",
                        "_text": "Pentrefan yng nghymuned Llandyfriog, Ceredigion, Cymru yw Bangor Teifi, sydd 63.7 milltir (102.5 km) o Gaerdydd a 184.7 milltir (297.2 km) o Lundain.\n\nCynrychiolir Bangor Teifi yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#bethania",
                "name": "Bethania",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Bethania",
                        "_text": "Bethania may refer to:\nBethania, North Carolina, Moravian Community Established 1759\nBethania, Queensland, a suburb of Logan City, Queensland, Australia\nBethany (Israel), a village near Jerusalem\nBetania monastery, in the nation of Georgia\nBethania Rehabilitation Centre, in Kerala, India\nBethania, Ceredigion, a hamlet in Wales, home of Tŷ Nant spring water\nBethania de la Cruz (born 1989), Dominican Republic volleyball player\nShort for Maria Bethânia, a Brazilian singer\nBethania, Aberdare, a chapel in Wales"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Bethania",
                        "_text": "Gallai Bethania gyfeirio at:\nLleoedd\nBethania (Al-Eizariya), dinas yn y Testament Newydd a thref hanesyddol yn y Lan Orllewinol, ger Jeriwsalem\nBethania, Ceredigion, Cymru\nBethania, Gwynedd, Cymru\nBethania, De Carolina, UDA\nBethania, Queensland, un o faesdrefi Brisbane yn Awstralia\nAdeiladau\nCapel Bethania, Aberteifi, Cymru\nGweler hefyd\nBetania"
                    }
                ]
            },
            {
                "id": "ceredigion#betws bledrws",
                "name": "Betws Bledrws",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Betws Bledrws",
                        "_text": "Betws Bledrws, is a parish in Llangybi, Ceredigion, Wales. Situated on the slopes on the banks of the River Dulas, approximately 3 miles (4.8 km) north of Lampeter and a half mile to the southwest of the village of Llangybi, on the old road from Tregaron to Lampeter.\nDerry Ormond Mansion, demolished in 1953, lies close to the village.\n48 8\nGridref SN596520"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Betws Bledrws",
                        "_text": "Pentref bychan gwledig yn ne Ceredigion yw Betws Bledrws (fe'i camsillefir weithiau fel Bettws Bledrws). Saif ar y llethrau ar lan Afon Dulas, tua 3 milltir i'r gogledd o Lanbedr Pont Steffan a milltir a hanner i'r de-orllewin o bentref Llangybi, ar yr hen ffordd o Dregaron i Lambed.\nYn ymyl y pentref ceir Plasdy Derry Ormond a'i dŵr hynafol ar y bryn uwchben. Gellir ei weld o bell."
                    }
                ]
            },
            {
                "id": "ceredigion#betws ifan",
                "name": "Betws Ifan",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Betws Ifan",
                        "_text": "Betws Ifan (antiquarian forms include Bettws Evan and Bettws Ieuvan) is a small village located in Ceredigion, Wales.\nSurrounding villages include Beulah, Brongest, Glynarthen and Aberporth. Betws Ifan is only a few miles away from Cardigan town and Newcastle Emlyn town. The village is built around the village hall, located in the heart of the village. It also includes a bakery, known for its high quality bread, which is the heart of the community."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Betws Ifan",
                        "_text": "Pentref bychan yn sir Ceredigion yw Betws Ifan (mae hen ffurfiau yn cynnwys 'Betws Ieuan'). Fe'i lleolir yn ne'r sir, tua hanner ffordd rhwng Castell Newydd Emlyn i'r de ac Aberporth i'r gogledd.\nMae Betws Ifan yn rhan o gymuned Beulah, sy'n cynnwys hefyd pentrefi Beulah, Cwm-cou, Llandygwydd a'r Bryngwyn.\nMae'r eglwys yn hen. Yr adeilad canolog yw neaudd y pentref. Ceir becws lleol hefyd."
                    }
                ]
            },
            {
                "id": "ceredigion#beulah",
                "name": "Beulah",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Beulah",
                        "_text": "Beulah may refer to:"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Beulah",
                        "_text": "Enw bedydd Hebraeg sy'n golygu \"priod\" yw Beulah. Gallai gyfeirio at un o sawl person, peth neu le:\nPobl\nBeulah (cantores),\nBeulah Bondi (1888-1981), actores\nBeulah (band),\nBeulah McGillicutty, enw llwyfan y wreslwr Trisa Hayes Laughlin (g. 1969)\nLleoedd\nBeulah, Alabama, yr Unol Daleithiau (UDA)\nBeulah, Ceredigion, Cymru\nBeulah, Colorado, U.D.A.\nBeulah, Kansas, U.D.A.\nBeulah, Michigan, U.D.A.\nBeulah Township, Minnesota, U.D.A.\nBeulah, Mississippi, U.D.A.\nBeulah, Missouri, U.D.A.\nBeulah, Gogledd Dakota, U.D.A.\nBeulah, Powys, Cymru\nBeulah, Tasmania, Awstralia\nBeulah, Victoria, Awstralia\nEraill\nBeulah (dafad), dafad o Beulah, Powys."
                    }
                ]
            },
            {
                "id": "ceredigion#blaen-pant",
                "name": "Blaen-pant",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Blaen-pant",
                    "_text": "Blaen-pant is a small village in the community of Beulah, Ceredigion, Wales, which is 71.5 miles (115 km) from Cardiff and 192.8 miles (310.3 km) from London. Blaen-pant is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\n^ National Assembly for Wales website; recalled 24 February 2014\n^ parliament.uk Website; recalled 24 February 2014"
                }
            },
            {
                "id": "ceredigion#blaen-waun",
                "name": "Blaen-waun",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Blaen-waun",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Blaen-waun. Fe'i lleolir tuag 8 milltir i'r gogledd o Hendy-gwyn ar Daf, yng ngorllewin y sir. Mae'n rhan o gymuned Llanwinio."
                }
            },
            {
                "id": "ceredigion#blaenannerch",
                "name": "Blaenannerch",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Blaenannerch",
                    "_text": "Pentref bychan yn ne Ceredigion yw Blaenannerch. Fe'i lleolir ar groesffordd ar yr A487 yn ne-orllewin y sir tua 2 filltir i'r de o Aberporth, 5 milltir i'r dwyrain o Aberteifi.\nBu farw'r prifardd Dic Jones (Richard Lewis Jones) ym Mlaenannerch ar 18 Awst 2009. Treuliodd ran helaeth o'i oes yn ffermio'r Hendre, Blaenannerch."
                }
            },
            {
                "id": "ceredigion#blaenbedw fawr",
                "name": "Blaenbedw Fawr",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Blaenbedw Fawr",
                    "_text": "Blaenbedw Fawr is a small village in the community of Llandysiliogogo, Ceredigion, Wales, which is 68.9 miles (110.8 km) from Cardiff and 187 miles (300.9 km) from London. Blaenbedw Fawr is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                }
            },
            {
                "id": "ceredigion#blaencelyn",
                "name": "Blaencelyn",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Blaencelyn",
                    "_text": "Pentrefan yng nghymuned Llangrannog, Ceredigion, Cymru yw Blaencelyn, sydd 70.8 milltir (113.9 km) o Gaerdydd a 188.3 milltir (303.1 km) o Lundain.\n\nCynrychiolir Blaencelyn yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                }
            },
            {
                "id": "ceredigion#blaenpennal",
                "name": "Blaenpennal",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Blaenpennal",
                    "_text": "Pentref yng Ngheredigion yw Blaenpennal. Safai'r pentref i'r gorllewin o'r A485 tua 15 milltir (24 kilomedr) i'r de o Aberystwyth, mae'r pentref yn ran o blwyf Lledrod.\nLleolir Pentre Bach ym Mlaenpennal, sef safle ffilmio cyfres deledu Pentre Bach, sydd wedi ei seilio ar gymeriadau Sali Mali a'i ffrindiau.\nMae nifer o fusnesau bach yn y pentref gan gynnwys Siop y Bont, Swyddfa Bost, cwmni bysiau a chwmni gwerthu ceir. Y Barcud yw papur bro y pentref."
                }
            },
            {
                "id": "ceredigion#blaenplwyf",
                "name": "Blaenplwyf",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Blaenplwyf",
                    "_text": "Lleolir pentref Blaenplwyf (hen enw: Pont-llanio) 4 milltir i'r de o Aberystwyth yng nghanolbarth Ceredigion. Rhed y ffordd A487 trwy'r pentref bychan.\nMae mast teledu ger y pentref sy'n nodwedd amlwg yn y tirwedd. Ceir un siop gymunedol a chapel yn y pentref."
                }
            },
            {
                "id": "ceredigion#blaenporth",
                "name": "Blaenporth",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Blaenporth",
                    "_text": "Pentref bychan yn ne Ceredigion yw Blaenporth (neu Flaen-porth). Fe'i leolir ar y briffordd A487 tua 2 filltir i'r de o Aberporth, rhwng pentrefi Blaenannerch a Sarnau.\nLleolir Ysgol Gynradd Blaenporth yn y pentref."
                }
            },
            {
                "id": "ceredigion#bont-goch (elerch)",
                "name": "Bont-goch (Elerch)"
            },
            {
                "id": "ceredigion#borth",
                "name": "Borth",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Borth",
                    "_text": "Borth (Welsh: Y Borth, (literally English: The Port)) is a coastal village 7 miles north of Aberystwyth in the county of Ceredigion, Mid Wales. The population was 1,523 in 2001.\n^ \"Community population 2011\". Retrieved 10 May 2015. \n^ \"Check Browser Settings\". Neighbourhood.statistics.gov.uk. Retrieved 10 January 2015."
                }
            },
            {
                "id": "ceredigion#bow street",
                "name": "Bow Street",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Bow Street",
                        "_text": "Bow Street is a thoroughfare in Covent Garden, Westminster, London.\nThe area around Bow Street was developed by Francis Russell, 4th Earl of Bedford in the 1630s. Oliver Cromwell moved to Bow Street in 1645. Robert Harley, 1st Earl of Oxford was born there in 1661. No. 4 served as a magistrates' court from 1739 and the police force the Bow Street Runners were founded there by Henry Fielding in the 1740s. When the Metropolitan Police Service was established in 1829, a station house was sited at numbers 25 and 27. The former Bow Street Magistrates' Court and police station was completed in 1881 and closed in 2006. The building is to be converted into a boutique hotel.\nBow Street is also the site of the Royal Opera House Covent Garden. It is one of the streets on the UK version of Monopoly, which is based on areas native to London"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Bow Street",
                        "_text": "Pentref yng Ngheredigion yw Bow Street. Mae'n ymestyn yn stribed hirgul o bobtu i lôn yr A487 tua 3 milltir i'r gogledd-ddwyrain o Aberystwyth. Ar un adeg roedd gan y pentref orsaf ar Reilffordd y Cambrian. Mae yn ardal Genau'r Glyn.\nMae tarddiad yr enw yn ansicr. Yn ôl rhai awdurdodau 'Nantafallen' neu 'Nantyfallen' oedd hen enw'r gymdogaeth, ond 'Bow Street' yw'r unig enw arni heddiw (does dim fersiwn Cymraeg).\nO ganol y pentref mae lôn yn arwain i lawr i bentref bach Clarach a Bae Clarach ar yr arfordir, ar y ffordd i'r Borth. I'r de mae Comins Coch ac i'r dwyrain Plas Gogerddan. O'r gyffordd tu allan i'r pentref mae ffordd yn rhedeg i fyny i'r bryniau i gyfeiriad Rhaeadr Gwy. Hanner milltir i'r gogledd o'r pentref mae cymuned wledig Rhydypennau."
                    }
                ]
            },
            {
                "id": "ceredigion#bridgend",
                "name": "Bridgend",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Bridgend",
                        "_text": "Bridgend (English pronunciation: \/brɨˈdʒɛnd\/; Welsh: Pen-y-bont ar Ogwr, meaning \"The main bridge on the River Ogmore\" or alternatively \"Bridgehead on the River Ogmore\" (suggesting a battle), is a town in Bridgend County Borough in Wales, 18-mile (29 km) west of the capital Cardiff and 20-mile (32 km) east of Swansea. The river crossed by the original bridge, which gave the town its name, is the River Ogmore, but the River Ewenny also passes to the south of the town.\nHistorically a part of Glamorgan, Bridgend has greatly expanded in size since the early 1980s - the 2001 census recorded a population of 39,429 for the town and the 2011 census reports that the Bridgend Local Authority had a population of 139,200 up from 128,700 in 2001. This 8.2% rise was the largest rise in Wales except for Cardiff. The town is undergoing a redevelopment project, with the town centre pedestrianised and a new business park opened."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Bridgend",
                        "_text": "Enw lle yw Bridgend. Gallai gyfeirio at nifer o leoedd:\nLleoedd\nBridgend, Ceredigion\nPen-y-bont ar Ogwr\nBridgend, Gorllewin Lothian"
                    }
                ]
            },
            {
                "id": "ceredigion#brithdir",
                "name": "Brithdir",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Brithdir",
                        "_text": "Brithdir is the name of a number of locations in Wales:"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Brithdir",
                        "_text": "Gallai Brithdir gyfeirio at:\nPentrefi\nBrithdir, Caerffili\nBrithdir, Ceredigion\nBrithdir, Gwynedd\nCaer Rufeinig Brithdir\nYsgol Gynradd Brithdir\n\nBrithdir, Powys - Plasdy ac ardal yng nghymuned Aberriw, Powys\nBrithdir a Chwm Mawr - Safle o Ddiddordeb Gwyddonol Arbennig ym Mhowys\n\nCymuned\nBrithdir a Llanfachreth, Gwynedd"
                    }
                ]
            },
            {
                "id": "ceredigion#brongest",
                "name": "Brongest",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Brongest",
                        "_text": "Brongest is a small village in the community of Troedyraur, Ceredigion, Wales, which is 68.4 miles (110.1km) from Cardiff and 188.9 miles (303.9km) from London. Brongest is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Brongest",
                        "_text": "Pentref bychan yng nghymuned Troedyraur, Ceredigion, Cymru yw Brongest, sydd 68.4 milltir (110.1 km) o Gaerdydd a 188.9 milltir (303.9 km) o Lundain.\n\nCynrychiolir Brongest yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#brongwyn",
                "name": "Brongwyn",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Brongwyn",
                        "_text": "Brongwyn is a hamlet in the community of Beulah, Ceredigion, Wales, which is 69.5 miles (111.9km) from Cardiff and 190.7 miles (306.9km) from London. Brongwyn is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Brongwyn",
                        "_text": "Pentrefan yng nghymuned Beulah, Ceredigion, Cymru yw Brongwyn, sydd 69.5 milltir (111.9 km) o Gaerdydd a 190.7 milltir (306.9 km) o Lundain.\n\nCynrychiolir Brongwyn yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#bronnant",
                "name": "Bronnant"
            },
            {
                "id": "ceredigion#bronwydd",
                "name": "Bronwydd",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Bronwydd",
                        "_text": "Bronwydd is a village and a community in the county of Carmarthenshire, Wales, situated about three miles north of Carmarthen in the valley of the River Gwili. Bronwydd community comprises the village of Bronwydd Arms, a couple of nearby hamlets and a number of working farms in the surrounding area. In Census 2001, it had a population of 572.\nBronwydd Arms railway station is a halt on the Gwili Railway. Cwmgwili mansion, home to a prominent local family, the Philipps, has 17th century features and is a grade II* listed building. \nBronwydd Arms was one of six broadband \"not-spots\" in Wales - communities without high-speed internet access. In December 2008, the Welsh Assembly Government and BT confirmed that coverage in these areas would be upgraded in April 2009.\nThe community is bordered by the communities of: Llanpumsaint; Llanllawddog; Abergwili; Carmarthen; Newchurch and Merthyr; and Cynwyl Elfed, all being in Carmarthenshire."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Bronwydd",
                        "_text": "Gallai Bronwydd gyfeirio at un o ddau bentref yng Nghymru:\nBronwydd, Ceredigion\nBronwydd, Sir Gaerfyrddin (Bronwydd Arms)"
                    }
                ]
            },
            {
                "id": "ceredigion#brynafan",
                "name": "Brynafan",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Brynafan",
                        "_text": "Brynafan is a small village in the community of Trawsgoed, Ceredigion, Wales, which is 66.7 miles (107.3km) from Cardiff and 170.3 miles (274.1km) from London. Brynafan is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Brynafan",
                        "_text": "Pentref bychan yng nghymuned Trawsgoed, Ceredigion, Cymru yw Brynafan, sydd 66.7 milltir (107.3 km) o Gaerdydd a 170.3 milltir (274.1 km) o Lundain.\n\nCynrychiolir Brynafan yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#bryngwyn",
                "name": "Bryngwyn",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Bryngwyn",
                    "_text": "Bryngwyn is a village and rural location in Monmouthshire, south east Wales."
                }
            },
            {
                "id": "ceredigion#brynhoffnant",
                "name": "Brynhoffnant",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Brynhoffnant",
                        "_text": "Brynhoffnant is a small village in the community of Penbryn, Ceredigion, Wales, which is 70.4 miles (113.3km) from Cardiff and 189.1 miles (304.3km) from London. Brynhoffnant is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\n^ National Assembly for Wales Website; recalled 24 February 2014\n^ parliament.uk Website; recalled 24 February 2014"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Brynhoffnant",
                        "_text": "Pentref bychan yng nghymuned Penbryn, Ceredigion, Cymru yw Brynhoffnant, sydd 70.4 milltir (113.3 km) o Gaerdydd a 189.1 milltir (304.3 km) o Lundain.\n\nCynrychiolir Brynhoffnant yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#bwlch-llan",
                "name": "Bwlch-Llan"
            },
            {
                "id": "ceredigion#caemorgan",
                "name": "Caemorgan",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Caemorgan",
                        "_text": "Caemorgan is a road (Heol) in Ceredigion, Wales. It means Morgans Field and is the name of the road outside of Cardigan off the A487. This road has a Mansion named Caemorgan Mansion to which Caemorgan Cottage is attached."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Caemorgan",
                        "_text": "Pentrefan yng nghymuned Aberteifi, Ceredigion, Cymru yw Caemorgan, sydd 75.5 milltir (121.5 km) o Gaerdydd a 196.8 milltir (316.7 km) o Lundain.\n\nCynrychiolir Caemorgan yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#caerwedros",
                "name": "Caerwedros",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Caerwedros",
                        "_text": "Caerwedros may refer to one of several places in Wales:\nCaerwedros, a cwmwd of medieval Ceredigion\nCaerwedros, a village in Ceredigion"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Caerwedros",
                        "_text": "Gall Caerwedros gyfeirio at un o sawl lle yng Nghymru\nCaerwedros, cwmwd Ceredigion canoloesol\nCaerwedros, pentref yng Ngheredigion"
                    }
                ]
            },
            {
                "id": "ceredigion#capel bangor",
                "name": "Capel Bangor",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Capel Bangor",
                        "_text": "Capel Bangor is a small village in Ceredigion, in Wales. Its population is around 600-1000, and it is also approximately five miles from the seaside and university town of Aberystwyth."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Capel Bangor",
                        "_text": "Pentref bychan yng ngogledd Ceredigion yw Capel Bangor. Mae'n gorwedd ar lan ogleddol Afon Rheidol 5 milltir i'r dwyrain o Aberystwyth. Rhed y ffordd A44 drwy'r pentref.\nMae gan y pentref orsaf reilffordd ar Reilffordd Dyffryn Rheidol, dros y bont ar Afon Rheidol.\nCeir Capel Penllwyn yn y pentref. Y tu allan iddo ceir cerflun o Lewis Edwards, sylfaenydd Coleg y Bala.\nLleolir Tafarn Tynllidiart yn y pentref. Mae hi'n bragu ei chwrw ei hun a hon oedd Tafarn y Flwyddyn, Ceredigion yn 2006. Mae'r tafarn hefyd yn dal record fel y bragdy masnachol lleiaf yn y byd, gan fragu 40.9 litr ar y tro yn unig.\nEr mai bychan ydy'r pentref mae hefyd gorsaf betrol, clwb golff a siop wnio yno."
                    }
                ]
            },
            {
                "id": "ceredigion#capel betws lleucu",
                "name": "Capel Betws Lleucu",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Capel Betws Lleucu",
                    "_text": "Capel Betws Lleucu is a hamlet in Cardiganshire, Wales.\nSY postcode area SY 25 6 SN606583"
                }
            },
            {
                "id": "ceredigion#capel dewi",
                "name": "Capel Dewi",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Capel Dewi",
                        "_text": "Capel Dewi may refer to:\nCapel Dewi, Aberystwyth, a hamlet near Aberystwyth, Ceredigion, Wales\nCapel Dewi, Carmarthenshire, a village in the community of Llanarthney, Carmarthenshire, Wales\nCapel Dewi, Llandysul, a village in the community of Llandysul, Ceredigion, Wales"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Capel Dewi",
                        "_text": "Gallai Capel Dewi gyfeirio at:\nCapel Dewi, Aberystwyth, pentref ger Aberystwyth, Ceredigion\nCapel Dewi, Llandysul, pentref ger Llandysul, Ceredigion\nCapel Dewi, Sir Gaerfyrddin"
                    }
                ]
            },
            {
                "id": "ceredigion#capel seion",
                "name": "Capel Seion",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Capel Seion",
                    "_text": "Gall Capel Seion gyfeirio at:"
                }
            },
            {
                "id": "ceredigion#capel tygwydd",
                "name": "Capel Tygwydd",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Capel Tygwydd",
                        "_text": "Capel Tygwydd is a hamlet in the community of Beulah, Ceredigion, Wales, which is 70.3 miles (113.1km) from Cardiff and 191.7 miles (308.5km) from London. Capel Tygwydd is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Capel Tygwydd",
                        "_text": "Pentrefan yng nghymuned Beulah, Ceredigion, Cymru yw Capel Tygwydd, sydd 70.3 milltir (113.1 km) o Gaerdydd a 191.7 milltir (308.5 km) o Lundain.\n\nCynrychiolir Capel Tygwydd yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#cardigan (aberteifi)",
                "name": "Cardigan (Aberteifi)"
            },
            {
                "id": "ceredigion#cardigan island",
                "name": "Cardigan Island",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Cardigan Island",
                    "_text": "Cardigan Island (Welsh: Ynys Aberteifi) is a small, uninhabited island lying north of Cardigan, in Ceredigion, south-west Wales. It reaches a height of 52 m (171 ft) a.s.l., and 38 acres in extent.\nLying in the estuary of the River Teifi, it is known for having a small colony of grey seals. It is within 200 metres of the Welsh coastline near Gwbert. It is owned and managed by the Wildlife Trust of South and West Wales.\nThe island was once the home of puffins and Manx shearwater. A guide book in the 1890s referred to the puffins as “Welsh parrots”. In 1924 Welsh writer and naturalist Ronald Lockley wrote that there were probably 25 to 30 pairs on the island. However, in 1934 a ship ran aground on the island in a storm, and rats made it ashore. Over a period of years they ate the eggs and chicks of nesting seabirds, and wiped out the island’s population of puffin and Manx shearwater, which have never returned.\nToday birds such as guillemots, razorbills, cormorants, shags, fulmars and a variety of sea-gulls all nest on the island. Bottlenose dolphins and Atlantic grey seals are also often seen in the sea around the island."
                }
            },
            {
                "id": "ceredigion#cefn llwyd",
                "name": "Cefn Llwyd",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cefn Llwyd",
                    "_text": "Pentrefan yng nghymuned Trefeurig, Ceredigion, Cymru yw Cefn Llwyd, sydd 74 milltir (119.1 km) o Gaerdydd a 176 milltir (283.3 km) o Lundain.\n\nCynrychiolir Cefn Llwyd yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                }
            },
            {
                "id": "ceredigion#ceinewydd (new quay)",
                "name": "Ceinewydd (New Quay)"
            },
            {
                "id": "ceredigion#cellan",
                "name": "Cellan",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cellan",
                    "_text": "Pentref bychan ar lan Afon Teifi yn ne Ceredigion yw Cellan.\nGorwedd ar lôn y B4343 tua 2½ filltir i'r gogledd-ddwyrain o dref Llanbedr Pont Steffan a thua milltir i'r de o bentref Llanfair Clydogau.\nEr mai pentref bychan iawn yw Cellan, bu'n fagwrfa i ddau ysgolhaig mawr. Ganed yr ieithydd a hynafiaethydd Moses Williams yng Nghellan yn 1685. Ganwyd yr hanesydd llenyddiaeth Gymraeg Griffith John Williams yn y pentref yn 1892."
                }
            },
            {
                "id": "ceredigion#chancery",
                "name": "Chancery",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Chancery",
                    "_text": "Chancery may refer to:\nChancery (diplomacy), the building that houses a diplomatic mission, such as an embassy\nChancery (medieval office), a medieval writing office\nChancery (Scotland), legal office until 1928\nChancery (village), in Ceredigion, Wales\nDiocesan chancery, which houses a diocese's curia\nChancery hand, a name for multiple styles of historic writing\nChancery of Apostolic Briefs, a former office of the Roman Curia\nCourt of equity, also called a chancery court\nOne of the Courts of Chancery\nCourt of Chancery, the chief court of equity in England and Wales until its abolition in 1873\n\nA class of wrestling holds:\nfront chancery\nrear chancery\nreverse chancery\nside head chancery aka three-quarter chancery"
                }
            },
            {
                "id": "ceredigion#cilcennin",
                "name": "Cilcennin",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cilcennin",
                    "_text": "Pentref bychan yn ne Ceredigion yw Cilcennin. Fe'i lleolir ar groesffordd wledig tua 5 milltir i'r dwyrain o Aberaeron ar ochr ogleddol Dyffryn Aeron.\nLleolir Ysgol Gymunedol Cilcennin yn y pentref. Yn ogystal, lleolir fferm fwydydd organig adnabyddus ar gyrion y pentref sy'n denu pobl o bell ac agos."
                }
            },
            {
                "id": "ceredigion#cilgwyn",
                "name": "Cilgwyn"
            },
            {
                "id": "ceredigion#ciliau aeron",
                "name": "Ciliau Aeron",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ciliau Aeron",
                        "_text": "Ciliau Aeron (English: where the valley of the river Aeron narrows) is a small village 4 miles from Aberaeron in Ceredigion, Wales on the left bank of the River Aeron.\nThe word Ciliau comes from the Welsh for corners. Aeron Corners in English refers to the many bends taken by the river through this area.\nThe village post office has long gone, but Ciliau has a small, welsh speaking school and a village hall. There are also fishing lakes in the village, as well as garden nurseries (which are no longer open to the public), an organic farm shop and a self-catering holiday centre for special needs children operated by the Ty Glyn Davis Trust. The Trust also runs an eighteenth-century walled garden alongside the River Aeron; it is open to the public from dawn to dusk, every day of the week, without charge. Ciliau Aeron Halt was a station on the line from Lampeter to Aberaeron that closed in 1951.\nThe Dylan Thomas Trail runs through Ciliau Aeron, passing the Tyglyn Hotel, which once was the holiday home of the publisher, Geoffrey Faber – T. S. Eliot used to holiday there in the 1930s. Eliot’s time in the village is described in A Farm, Two Mansions and a Bungalow, which also gives an account of the time spent by Dylan Thomas in nearby New Quay and Talsarn.\nThe dockworker-poet James Hughes was born in Ciliau in 1799, and the poet-priest David Davis (Dafis Castellhywel, 1745-1827) had his first ministry in the village’s Unitarian chapel. \nJust a mile away is the National Trust’s Llanerchaeron estate.\n^ \"Community population 2011\". Retrieved 11 May 2015. \n^ Dylan Thomas: A Farm, Two Mansions and a Bungalow by D N Thomas, Seren 2000\n^ Telyn Dewi by D. Davis, Longman 1824"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ciliau Aeron",
                        "_text": "Gweler hefyd Aeron (gwahaniaethu).\nPentref a chymuned yng Ngheredigion, 5 km i'r de-ddwyrain o Aberaeron yw Ciliau Aeron. Yn 2001 roedd ganddi 910 o drigolion, a 58% ohonynt yn siarad Cymraeg. Saif ar lan ddeheuol Afon Aeron."
                    }
                ]
            },
            {
                "id": "ceredigion#clarach",
                "name": "Clarach",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Clarach",
                    "_text": "Pentref bychan yn sir Ceredigion yw Clarach (hefyd: Clarach Bay weithiau yn Saesneg). Fe'i lleolir ar lan Bae Ceredigion tua 2 filltir i'r gogledd o dref Aberystwyth.\nMae Clarach yn rhan o Gymuned Tirymynach. Mae'n boblogaidd gan ymwelwyr yn yr haf sy'n dod i fwynhau'r traeth ar lan Bae Clarach a cheir meysydd carafannau a chyfleusterau glan môr yno. Enwir y pentref ar ôl Afon Clarach, sy'n cyrraedd y môr yno.\nCeir llwybr troed sy'n dringo i ben Craig-glais (Constitution Hill)."
                }
            },
            {
                "id": "ceredigion#cnwch coch",
                "name": "Cnwch Coch",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cnwch Coch",
                    "_text": "Pentref bychan gwledig yn sir Ceredigion yw'r Cnwch Coch (weithiau 'Cnwch-coch'). Fe'i lleolir yng ngogledd y sir tua 8-9 milltir i'r dwyrain o Aberystwyth.\nGorwedd y Cnwch Coch ym mhlwyf eglwysig Llanfihangel-y-Creuddyn, tua hanner ffordd rhwng pentref Llanfihangel, i'r gogledd, a'r Trawscoed i'r de. Mae'n rhan o gymuned Trawsgoed.\nCeir eglwys yn y pentref. Tardda ffrwd Afon Magwr ger y Cnwch Coch, gan lifo wedyn dros gwrs byr i ymuno ag Afon Ystwyth ger Abermagwr.\nYstyr y gair cnwch yw 'chwydd, crwmp' (sef codiad tir yn yr achos yma): mae'n elfen gyffredin mewn enwau lleoedd yng ngogledd Ceredigion ond prin yw'r enghreifftiau y tu allan i'r ardal honno."
                }
            },
            {
                "id": "ceredigion#cockshead",
                "name": "Cockshead",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Cockshead",
                    "_text": "Cockshead is a small village in the community of Llanddewibrefi, Ceredigion, Wales, which is 59.9 miles (96.3 km) from Cardiff and 171.9 miles (276.5 km) from London. Cockshead is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                }
            },
            {
                "id": "ceredigion#coed y garth",
                "name": "Coed y Garth",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Coed y Garth",
                    "_text": "Mae Coed y Garth wedi'i ddynodi'n Safle o Ddiddordeb Gwyddonol Arbennig yng Nghymru (SoDdGA neu SSSI) ers 01 Ionawr 1983 fel ymgais gadwraethol i amddiffyn a gwarchod y safle. Mae ei arwynebedd yn 63.73 hectar. Cyfoeth Naturiol Cymru yw'r corff sy'n gyfrifol am y safle.\n↑ Gwefan Cyngor Cefn Gwlad Cymru (bellach 'Cyfoeth Naturiol Cymru'); adalwyd 25 Rhagfyr 2013"
                }
            },
            {
                "id": "ceredigion#coed-y-bryn",
                "name": "Coed-y-bryn",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Coed-y-bryn",
                        "_text": "Coed-y-bryn is a small village in the community of Troedyraur, Ceredigion, Wales, which is 66.8 miles (107.5km) from Cardiff and 186.8 miles (300.7km) from London. Coed-y-bryn is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Coed-y-bryn",
                        "_text": "Pentref bychan yng nghymuned Troedyraur, Ceredigion, Cymru yw Coed-y-bryn, sydd 66.8 milltir (107.5 km) o Gaerdydd a 186.8 milltir (300.7 km) o Lundain.\n\nCynrychiolir Coed-y-bryn yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#comins coch",
                "name": "Comins Coch",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Comins Coch",
                    "_text": "Am y pentref ym Mhowys, gweler Commins Coch\nPentref yng Ngheredigion ydy Comins Coch.\nMae Cymdeithas Gymunedol Comins Coch yn elusen gofrestredig sy'n rhedeg gwefan Comins Coch. Mae Ysgol Gymuned Comins Coch yn y pentref."
                }
            },
            {
                "id": "ceredigion#craig-y-penrhyn",
                "name": "Craig-y-penrhyn",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Craig-y-penrhyn",
                        "_text": "Craig-y-penrhyn is a hamlet in the community of Llangynfelyn, Ceredigion, Wales, which is 79.3 miles (127.7km) from Cardiff and 178.1 miles (286.6km) from London. Craig-y-penrhyn is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Craig-y-penrhyn",
                        "_text": "Pentrefan yng nghymuned Llangynfelyn, Ceredigion, Cymru yw Craig-y-penrhyn, sydd 79.3 milltir (127.7 km) o Gaerdydd a 178.1 milltir (286.6 km) o Lundain.\n\nCynrychiolir Craig-y-penrhyn yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                    }
                ]
            },
            {
                "id": "ceredigion#cribyn",
                "name": "Cribyn",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cribyn",
                        "_text": "Cribyn is a small village in Ceredigion, Wales, about 7 miles (11 km) north of Lampeter and with the villages of Troed y Rhiw, Mydroilyn and Dihewyd to the north."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cribyn",
                        "_text": "Gallai Cribyn gyfeirio at un o sawl peth:\nCrybyn (daeareg), nodwedd ddaearegol sef brig hir ar darn o dir, sy'n debyg i grib\nCribyn, Ceredigion, pentref yng Ngheredigion\nY Gribyn, mynydd ym Mannau Brycheiniog\nGweler hefyd:\nCribin, offeryn ar gyfer casglu gwellt, gwair neu ddail."
                    }
                ]
            },
            {
                "id": "ceredigion#croes-lan",
                "name": "Croes-lan",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Croes-lan",
                        "_text": "Croes-lan is a small village in the community of Troedyraur, Ceredigion, Wales, which is 65.2 miles (104.9km) from Cardiff and 185.1 miles (297.8km) from London. Croes-lan is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Croes-lan",
                        "_text": "Perntref bychan yng nghymuned Troedyraur, Ceredigion, Cymru yw Croes-lan, sydd 65.2 milltir (104.9 km) o Gaerdydd a 185.1 milltir (297.8 km) o Lundain.\n\nCynrychiolir Croes-lan yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#cross inn",
                "name": "Cross Inn",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cross Inn",
                    "_text": "Ceir tri lle o'r enw Cross Inn yng Nghymru:\nCross Inn, canolbarth Ceredigion, pentref tua 6 milltir i'r dwyrain o Aberaeron\nCross Inn, de Ceredigion, pentref ger Ceinewydd\nCross Inn, Rhondda Cynon Taf, pentref yn Rhondda Cynon Taf"
                }
            },
            {
                "id": "ceredigion#crosswood",
                "name": "Crosswood"
            },
            {
                "id": "ceredigion#cwmbrwyno",
                "name": "Cwmbrwyno",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cwmbrwyno",
                        "_text": "Cwmbrwyno is a hamlet in the community of Melindwr, Ceredigion, Wales, which is 71.2 miles (114.7km) from Cardiff and 172.3 miles (277.3km) from London. Cwmbrwyno is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\nThere are former mines nearby."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwmbrwyno",
                        "_text": "Pentrefan yng nghymuned Melindwr, Ceredigion, Cymru yw Cwmbrwyno, sydd 71.2 milltir (114.7 km) o Gaerdydd a 172.3 milltir (277.3 km) o Lundain.\n\nCynrychiolir Cwmbrwyno yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                    }
                ]
            },
            {
                "id": "ceredigion#cwmcoednerth",
                "name": "Cwmcoednerth",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cwmcoednerth",
                        "_text": "Cwmcoednerth is a hamlet in the community of Penbryn, Ceredigion, Wales, which is 68.6 miles (110.4km) from Cardiff and 188 miles (302.5km) from London. Cwmcoednerth is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwmcoednerth",
                        "_text": "Pentrefan yng nghymuned Penbryn, Ceredigion, Cymru yw Cwmcoednerth, sydd 68.6 milltir (110.4 km) o Gaerdydd a 188 milltir (302.5 km) o Lundain.\n\nCynrychiolir Cwmcoednerth yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#cwmerfyn",
                "name": "Cwmerfyn",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwmerfyn",
                    "_text": "Pentrefan yng nghymuned Trefeurig, Ceredigion, Cymru yw Cwmerfyn, sydd 72.7 milltir (117 km) o Gaerdydd a 173.3 milltir (278.9 km) o Lundain.\n\nCynrychiolir Cwmerfyn yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                }
            },
            {
                "id": "ceredigion#cwmsymlog",
                "name": "Cwmsymlog",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cwmsymlog",
                        "_text": "Cwmsymlog is a Site of Special Scientific Interest in Ceredigion, in the west of Wales. This site lost much of its importance when the mining in the area declined and finally came to an end in 1901.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwmsymlog",
                        "_text": "Mae Cwmsymlog wedi'i ddynodi'n Safle o Ddiddordeb Gwyddonol Arbennig yng Nghymru (SoDdGA neu SSSI) ers 16 Mawrth 1988 fel ymgais gadwraethol i amddiffyn a gwarchod y safle, yn bennaf ar sail y llystyfiant anarferol sydd arni. Mae ei arwynebedd yn 4.17 hectar. Cyfoeth Naturiol Cymru yw'r corff sy'n gyfrifol am y safle."
                    }
                ]
            },
            {
                "id": "ceredigion#cwmystwyth",
                "name": "Cwmystwyth",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cwmystwyth",
                        "_text": "Cwmystwyth (also Cwm Ystwyth; English: \"valley of the River Ystwyth\") is a village in Ceredigion, Wales near Devil's Bridge, and Pont-rhyd-y-groes.\nThe Ordnance Survey calculates Cwmystwyth to be the Centre point of Wales, (52°19′48.791″N 3°45′59.072″W; grid reference SN7972871704)"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwmystwyth",
                        "_text": "Pentref yn nwyrain Ceredigion yw Cwmystwyth, hefyd Cwm Ystwyth. Saif ar lan Afon Ystwyth ac ar y ffordd gefn sy'n arwain dros yr ucheldir o ardal Pontrhydygroes i dref Rhaeadr Gwy.\nCeir tystiolaeth archaeolegol o gloddio copr yma a ddyddir i tua 1500 CC, a cheir cofnodion hanesyddol o gloddio plwm o tua 1500 OC ymlaen. Yn y 19eg ganrif roedd diwydiant plwm yr ardal yma o gryn bwysigrwydd. Cloddfa Cwm Cwmstwyth oedd y fwyaf o gloddfeydd plwm yr ardal yma. Dywedir mai 32 oedd yr oedran marw ar gyfartaledd yng Nghwmystwyth yn y cyfnod yma, yn bennaf oherwydd gwenwyno plwm."
                    }
                ]
            },
            {
                "id": "ceredigion#cwrtnewydd",
                "name": "Cwrtnewydd",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwrtnewydd",
                    "_text": "Pentref yn ne Ceredigion yw Cwrtnewydd, weithiau Cwrt-newydd. Mae yng nghymuned a phlwyf Llanwenog.\nSaif ar y ffordd B4338, fymryn i'r gogledd o'r briffordd A475, ychydig i'r gorllewin o dref Llanbedr Pont Steffan ac i'r gogledd-orllewin o Lanybydder."
                }
            },
            {
                "id": "ceredigion#dihewyd",
                "name": "Dihewyd",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Dihewyd",
                        "_text": "Dihewyd is a parish in the county of Ceredigion, West Wales. It is 5 miles (8 km) from Aberaeron and 8 miles (13 km) (northwest by west) from Lampeter. This parish is situated near the Vale of Aëron and not far from the river Mydur. There is also a school in the village called Ysgol Gynradd Dihewyd. The village is famous for its bible quoting sheep."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Dihewyd",
                        "_text": "Pentref a phlwyf yn Nyffryn Aeron yng nghanolbarth Ceredigion yw Dihewyd. Saif ar y ffordd B4342 rhwng pentrefi Ystrad Aeron a Llanarth.\nYr hen enw ar eglwys Dihewyd oedd Llanwyddalus, sy'n parhau i gael ei ddefnyddio mewn nifer o enwau lleoedd. Ceir at y ffair yn 1570 fel ffair \"Llanvidales in Dyhewed\". Ceir ysgol gynradd yma, sef Ysgol Gynradd Dihewyd, ond nid oes siop bellach.\nGorwedd tarddle Afon Granell ym mhlwyf Dihewyd ger fferm Ynys-felen, yn y bryniau sy'n gorwedd rhwng Dyffryn Aeron i'r gogledd a Dyffryn Teifi i'r de."
                    }
                ]
            },
            {
                "id": "ceredigion#dol-y-bont",
                "name": "Dol-y-Bont"
            },
            {
                "id": "ceredigion#dole",
                "name": "Dole",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Dole",
                    "_text": "Dole may refer to:\nDole Constituency, a parliamentary constituency in Zanzibar\nDole Food Company, a US agricultural corporation\nUnemployment benefits\nWelfare\nCharity (practice), giving food, clothing or money in England (mostly obsolete); examples include\nWayfarer's Dole, Hospital of St Cross\nSt Briavels Bread and Cheese Dole\nTichborne Dole\n\nDOLE, Department of Labor and Employment (Philippines)\nDole Air Race, ill-fated 1927 air race named for sponsor James Dole (see below)\nPlaces\nDole, Idrija, a settlement in the Municipality of Idrija, Slovenia\nDole, Jura, a commune in the département Jura in France\nArrondissement of Dole, a French arrondissement containing the commune Dole\n\nLa Dôle, a mountain in Switzerland\nDole, Nepal, a village in Nepal\nLivery Dole, an area of Exeter in Devonshire, England\nSmall Dole, a hamlet in the Civil parish of Upper Beeding in West Sussex, England\nPeople\nAugustus O. Dole (1813-1876), U.S. politician\nBob Dole, (born 1923), U.S. politician, former U.S. Senator\nCharles Fletcher Dole (1845–1927), Unitarian minister and author\nDaniel Dole (1808–1878), missionary who founded Punahou School\nEdmund Pearson Dole (1850–1928), lawyer and Hawaii attorney general\nElizabeth Dole, (born 1936), U.S. politician, former U.S. Senator and former U.S. Cabinet member, wife of \"Bob\" Dole\nJames Dole (1877–1958), Hawaiian Pineapple planter\nLester Dole (1855–1918), American baseball player\nNathan Haskell Dole (1852–1935), Boston author\nMary Phylinda Dole (1862–1947), American woman doctor\nSanford B. Dole (1844–1926), first Governor of Hawaii\nVincent Dole (1913–2006), American doctor\nWigglesworth Dole (1779–1845), Deacon and patriarch of several others"
                }
            },
            {
                "id": "ceredigion#dolgerdd",
                "name": "Dolgerdd",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Dolgerdd",
                        "_text": "Dolgerdd is a hamlet in the community of Llandysiliogogo, Ceredigion, Wales, which is 65.6 miles (105.5km) from Cardiff and 183.2 miles (294.8km) from London. Dolgerdd is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Dolgerdd",
                        "_text": "Pentrefan yng nghymuned Llandysiliogogo, Ceredigion, Cymru yw Dolgerdd, sydd 65.6 milltir (105.5 km) o Gaerdydd a 183.2 milltir (294.8 km) o Lundain.\n\nCynrychiolir Dolgerdd yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#dollwen",
                "name": "Dollwen",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Dollwen",
                        "_text": "Dollwen is a hamlet in the community of Melindwr, Ceredigion, Wales, which is 72.1 miles (116km) from Cardiff and 173.6 miles (279.4km) from London. Dollwen is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Dollwen",
                        "_text": "Pentrefan yng nghymuned Melindwr, Ceredigion, Cymru yw Dollwen, sydd 72.1 milltir (116 km) o Gaerdydd a 173.6 milltir (279.4 km) o Lundain.\n\nCynrychiolir Dollwen yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#dre-fach",
                "name": "Dre-fach"
            },
            {
                "id": "ceredigion#dyffryn",
                "name": "Dyffryn",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Dyffryn",
                        "_text": "Dyffryn or Duffryn may refer to one of these places in Wales:\nDuffryn housing estate in Newport\nDyffryn, Bridgend\nDyffryn Cennen, Carmarthenshire\nDyffryn, Ceredigion\nDyffryn Cellwen, Neath Port Talbot\nDyffryn Clydach, Neath Port Talbot\nDyffryn, Pembrokeshire\nDyffryn, Vale of Glamorgan\nDyffryn Gardens"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Dyffryn",
                        "_text": "Am y pentref yn Ynys Môn, gweler Y Fali; am yr ystad yng Nghasnewydd gweler Dyffryn, Casnewydd: gweler hefyd Cwm.\n\nTirffurf yw dyffryn, sef ardal o dir sydd yn is na thir cyfagos, ac yn amrywio o ran arwynebedd o ychydig filltiroedd sgwâr i gannoedd o filltiroedd sgwâr. Mae'n arferol, er nad yn angenrheidiol, i ddyffryn gynnwys afon yn llifo trwyddo, a'r afon yn rhoi enw i'r dyffryn."
                    }
                ]
            },
            {
                "id": "ceredigion#dyffryn-bern",
                "name": "Dyffryn-bern",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Dyffryn-bern",
                    "_text": "Dyffryn-bern is a small village in the community of Penbryn, Ceredigion, Wales, which is 72.4 miles (116.5 km) from Cardiff and 191.8 miles (308.6 km) from London. Dyffryn-bern is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats). The names, originally, was from a farm of the same name, but is now used for the surrounding hamlet.\n\n"
                }
            },
            {
                "id": "ceredigion#eglwys fach",
                "name": "Eglwys Fach",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Eglwys Fach",
                    "_text": "Lleolir pentref bychan Eglwys Fach ar hen ystâd Ynys-hir yng Ngheredigion.\nTreuliodd y bardd R. S. Thomas gyfnod o dair mlynedd ar ddeg fel ficer Eglwys Fach (1954-1967)."
                }
            },
            {
                "id": "ceredigion#elerch (bont-goch)",
                "name": "Elerch (Bont-goch)"
            },
            {
                "id": "ceredigion#felin-wnda",
                "name": "Felin-Wnda",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Felin-Wnda",
                        "_text": "Felin-Wnda is a hamlet in the community of Troedyraur, Ceredigion, Wales, which is 69 miles (111.1km) from Cardiff and 189 miles (304.1km) from London. Felin-Wnda is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Felin-Wnda",
                        "_text": "Pentrefan yng nghymuned Troedyraur, Ceredigion, Cymru yw Felin-Wnda, sydd 69 milltir (111.1 km) o Gaerdydd a 189 milltir (304.1 km) o Lundain.\n\nCynrychiolir Felin-Wnda yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#felinfach",
                "name": "Felinfach",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Felinfach",
                    "_text": "Gall Felinfach gyfeirio at:\nFelinfach, pentref yng Ngheredigion\nFelin-fach, pentref ym Mhowys"
                }
            },
            {
                "id": "ceredigion#ffair-rhos",
                "name": "Ffair-Rhos"
            },
            {
                "id": "ceredigion#ffos-y-ffin",
                "name": "Ffos-y-ffin",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ffos-y-ffin",
                        "_text": "Ffos-y-ffin is a village near Aberaeron, Wales. It is a great place to see the Red Kites. It is on the very scenic road between Aberystwyth and Cardigan. There is a public house called the Red Lion. The name translates into English as \"Boundary Ditch\", the ditch in question can be seen from the bridge just before the public house.\nFfos-y-ffin is on the A487. Travelling south west along A487 the next village is Llwyncelyn."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ffos-y-ffin",
                        "_text": "Pentref yn Nyffryn Aeron yng Ngheredigion yw Ffos-y-ffin, weithiau Ffosyffin. Saif heb fod ymhlell o'r arfordir, ar y briffordd A487 i'r de o dref Aberaeron a rhwng pentrefi Henfynyw a Llwyncelyn. Mae ymg nghymuned Henfynyw."
                    }
                ]
            },
            {
                "id": "ceredigion#ffostrasol",
                "name": "Ffostrasol",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ffostrasol",
                        "_text": "Ffostrasol is a small village in the south of Ceredigion, Wales. It is located on the A486 between Synod Inn and Llandysul, and it forms part of the parish of Llangynllo. The village lies on a rural crossroad connecting it with the nearby village of Plwmp to the north, Synod Inn to the north east, Newcastle Emlyn to the south west, and Llandysul to the south east.\nVillage amenities include the Ffostrasol Arms inn, or Tafarn Ffostrasol in Welsh, and a garage. There is also a local football club and the village has a team which compete in Talwrn y Beirdd, a poetry programme broadcast on Radio Cymru."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ffostrasol",
                        "_text": "Pentref bychan yn ne Ceredigion yw Ffostrasol. Mae'n gorwedd ar yr A486 rhwng Synod Inn a Llandysul, ac mae'n ffurfio rhan o blwyf Llangynllo ac ardal Cyngor Cymuned Troed-yr-Aur.\nMae'r pentref yn gorwedd ar groesffordd wledig sy'n ei gysylltu â phentref Plwmp i'r gogledd, Synod Inn i'r gogledd-ddwyrain, Castell Newydd Emlyn i'r de-orllewin, a Llandysul i'r de-ddwyrain.\nY pentrefi agosaf yw Capel Cynon, tua 2 filltir i'r gogledd ar yr A486 a Bwlchygroes, tua hanner milltir i'r de. Am flynyddoedd lawer dyma gartref Gŵyl Werin y Cnapan sef un o'r gwyliau gwerin cyntaf a mwyaf llwyddiannus Cymru.\nMae gan y pentref Glwb Pêl Droed sydd yn chwarae ar gae Troedyrhiw yng Nghyngrair Ceredigion ac mae gan Ffostrasol hefyd dîm Talwrn y Beirdd."
                    }
                ]
            },
            {
                "id": "ceredigion#furnace",
                "name": "Furnace",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Furnace",
                    "_text": "A furnace is a device used for high-temperature heating. The name derives from Greek word fornax, which means oven.\nIn American English and Canadian English usage, the term furnace on its own refers to the household heating systems based on a central furnace (known either as a boiler, or a heater in British English), and sometimes as a synonym for kiln, a device used in the production of ceramics. In British English, a furnace is an industrial furnace used for many things, such as the extraction of metal from ore (smelting) or in oil refineries and other chemical plants, for example as the heat source for fractional distillation columns.\nThe term furnace can also refer to a direct fired heater, used in boiler applications in chemical industries or for providing heat to chemical reactions for processes like cracking, and is part of the standard English names for many metallurgical furnaces worldwide.\nThe heat energy to fuel a furnace may be supplied directly by fuel combustion, by electricity such as the electric arc furnace, or through induction heating in induction furnaces."
                }
            },
            {
                "id": "ceredigion#garth",
                "name": "Garth",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Garth",
                        "_text": "Garth may refer to:"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Garth",
                        "_text": "Mae Garth yn enw sawl lle yng Nghymru, ac yn elfen mewn enwau lleoedd eraill:\nGarth, pentref yng Ngheredigion\nGarth, pentref ym mwrdeisdref sirol Pen-y-bont ar Ogwr\nGarth, pentref ym Mhowys\nGarth, pentref yn sir Wrecsam\nGarth (mynydd), Bannau Brycheiniog, Cyfeirnod grid OS: SO053506\nHefyd:\nGwaelod-y-Garth\nGarth Celyn, enw arall ar Ben-y-bryn, Abergwyngregyn\nChwarel y Garth, SoDdGA yn Ne Powys\nGarth Isaf, SoDdGA ym Mhowys\nGartheli, pentrefan yng Ngheredigion\nGall hefyd fod yn enw person:\nGarth Brooks, canwr gwlad Americanaidd"
                    }
                ]
            },
            {
                "id": "ceredigion#gilfachreda",
                "name": "Gilfachreda",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Gilfachreda",
                    "_text": "Pentref yng nghymuned Llanarth, Ceredigion, Cymru yw Gilfachreda, sydd 70.1 milltir (112.8 km) o Gaerdydd a 185.5 milltir (298.6 km) o Lundain.\n\nCynrychiolir Gilfachreda yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                }
            },
            {
                "id": "ceredigion#glandyfi",
                "name": "Glandyfi",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Glandyfi",
                        "_text": "Glandyfi (formerly anglicised as Glandovey) is a small hamlet in the county of Ceredigion in Wales on the A487 trunk road from Machynlleth to Aberystwyth as well as Dovey Junction on the Cambrian Line.\nGlandyfi Castle was built in the Regency Gothic style in 1810 for George Jeffreys. The Jeffreys family remained in possession of the castle until 1906, when the estate was broken up and sold at auction. The castle itself was bought by Robert John Spurrell (elder son of Daniel Spurrell of Bessingham, Norfolk), who remained there until his death in 1929. It was later the home of Sir Bernard and Lady Docker, and is currently a bed and breakfast.\nGlandyfi Castle is a Grade II listed building and contains a number of gardens planted at different times in its history. It is located close to the site of Aberdyfi Castle, which dates back to 1156."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Glandyfi",
                        "_text": "Pentref yng ngogledd Ceredigion yw Glandyfi. Lleolir ger lan Afon Dyfi, ar ffordd yr A487 rhwng Machynlleth ac Aberystwyth, a thri chwarter milltir i'r de o Orsaf Reilffordd Cyffordd Dyfi. Lleolir Castell Glandyfi gerllaw, a adeiladwyd ym 1810, yn agos i safle Castell Aberdyfi sy'n dyddio o 1156.\nMae'n debyg mai Carreg neu Garreg oedd yr enw ar y cymuned hyd canol yr 19eg ganrif, ond fe mabwysiadodd enw'r castell.\nDatguddwyd cynlluniau er mwyn gwella'r ffordd yng Nglandyfi yn 2004, ond mae'r gwaith eisioes yn disgwyl ei gychwyn, a dim ond yn 2007 y trefnwyd prynu gorfodol. Mae llifogydd yn cau'r ffordd yn reolaidd i'r gogledd o'r pentref."
                    }
                ]
            },
            {
                "id": "ceredigion#glanrafon",
                "name": "Glanrafon",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Glanrafon",
                        "_text": "Glanrafon is a small village near Corwen in Gwynedd, North Wales and is situated on the A494. The village is on the boundary of Gwynedd and Denbighshire.\nLocal businesses include a garage, cafe, the Llawrbetws Caravan Park and a glassblowers, the Glassblobbery Studio and Gallery.\nIt also has a church and a chapel.\nNear Glanrafen is the Braich Ddu wind farm operated by REG WindPower."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Glanrafon",
                        "_text": "Gallai Glanrafon neu Glan-yr-afon gyfeirio at:\nGlanrafon, pentref yng Ngwynedd\nGlanrafon, pentref ym mwrdeisdref sirol Wrecsam\nGlan yr Afon, ardal a chymuned yn ninas Caerdydd\nGlanyrafon, Ceredigion, pentrefan yng Ngheredigion\nGlanrafon, Penfro"
                    }
                ]
            },
            {
                "id": "ceredigion#glanwern",
                "name": "Glanwern"
            },
            {
                "id": "ceredigion#glasgoed",
                "name": "Glasgoed",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Glasgoed",
                    "_text": "Gallai Glasgoed neu Glascoed gyfeirio at un o amryw bentrefi yng Nghymru:\nGlasgoed, Sir Fynwy\nGlasgoed, Wrecsam\nGlasgoed, Ceredigion\nGlascoed, Sir Ddinbych\nGlascoed, Sir Gaerfyrddin\nGlascoed, Powys"
                }
            },
            {
                "id": "ceredigion#glaspwll",
                "name": "Glaspwll",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Glaspwll",
                    "_text": "Pentrefan yng nghymuned Cadfarch, Powys, Cymru yw Glaspwll, sydd 80.1 milltir (129km) o Gaerdydd a 174.5 milltir (280.9km) o Lundain.\n\nCynrychiolir Glaspwll yn y Cynulliad Cenedlaethol gan Russel George (Ceidwadwyr) a'r Aelod Seneddol yw Glyn Davies (Ceidwadwyr).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                }
            },
            {
                "id": "ceredigion#glynarthen",
                "name": "Glynarthen",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Glynarthen",
                        "_text": "Glynarthen is a small village located in Ceredigion, Wales. It is part of the community of Penbryn, along with the neighbouring villages of Brynhoffnant, Sarnau and Tan-y-groes.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Glynarthen",
                        "_text": "Pentrefan yng nghymuned Penbryn, Ceredigion, Cymru yw Glynarthen, sydd 70.3 milltir (113.1 km) o Gaerdydd a 190 milltir (305.7 km) o Lundain.\n\nCynrychiolir Glynarthen yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#goginan",
                "name": "Goginan",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Goginan",
                        "_text": "Goginan is a small village in Ceredigion, about 7 miles outside Aberystwyth on the A44 between Ponterwyd and Capel Bangor. The Afon Melindwr runs through the village, and is a tributary of the Afon Rheidol.\nThe village originally grew around farms in the area, but increased with the development of local mines.\nTo the east of the villages lies a Grade II Listed 19th century house thought to be associated with the lead mines in the area; it is probably the Goginan mine manager's house. Cadw Building ID: 9857."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Goginan",
                        "_text": "Mae Goginan yn bentref bychan gwledig yng Ngheredigion, tua 6 milltir i'r dwyrain o Aberystwyth. Saif ar y ffordd A44, rhwng pentrefi Capel Bangor i'r gorllewin a Phonterwyd i'r dwyrain.\nRhed ffrwd Afon Melindwr heibio i Goginan i ymuno yn Afon Rheidol yn is i lawr y cwm.\nCeir hen fryngaer ar y bryn i'r gogledd o'r pentref, yn Hen Oginan."
                    }
                ]
            },
            {
                "id": "ceredigion#gorrig",
                "name": "Gorrig",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Gorrig",
                        "_text": "This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name. For more information follow the category link."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Gorrig",
                        "_text": "Pentrefan yng nghymuned Llandysul, Ceredigion, Cymru yw Gorrig, sydd 63.3 milltir (101.8 km) o Gaerdydd a 183.1 milltir (294.7 km) o Lundain.\n\nCynrychiolir Gorrig yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#gors",
                "name": "Gors"
            },
            {
                "id": "ceredigion#gorsgoch",
                "name": "Gorsgoch",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Gorsgoch",
                        "_text": "Gorsgoch is a small rural hamlet (place) near Lampeter in the county of Ceredigion, Wales.\n\"Cors\" (mutated to Gors) is Welsh for \"marsh\" or \"bog\", and \"goch\" is the mutated form of \"coch\" meaning \"red\": so the name literally translated means \"Red Marsh\". This marsh is located alongside the main road that leads through the village.\nThe village is currently developing at a high rate. New houses are being constructed and there are planning applications for more. Gorsgoch has a pub, Cefn-Hafod. The garages have been closed along with the school years ago. There is also a village hall that has been closed a few years, however it is currently being refurbished. The town of Lampeter is 7 miles away and the town of New Quay is 15 miles away"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Gorsgoch",
                        "_text": "Pentref bychan yng nghymuned Llanwenog, Ceredigion, Cymru yw Gorsgoch, sydd 63.2 milltir (101.7 km) o Gaerdydd a 179.8 milltir (289.4 km) o Lundain.\nGerllaw ceir Cors Gorsgoch, cors fechan sy'n Safle o Ddiddordeb Gwyddonol Arbennig."
                    }
                ]
            },
            {
                "id": "ceredigion#gwbert",
                "name": "Gwbert",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Gwbert",
                        "_text": "Gwbert (Welsh pronunciation: [ˈɡubɛrt]), also known as Gwbert-on-Sea, is a small cliff top coastal hamlet in Y Ferwig community, Ceredigion, Wales. It lies at the most southerly coastal point of Ceredigion, on the eastern shore of the Teifi estuary, from where there are views westwards over Cardigan Bay, and south-westwards to Poppit Sands and the headland of Cemaes Head, in neighbouring Pembrokeshire. It is most easily reached by the B4548 road from the town of Cardigan (Welsh : Aberteifi), 2.8 miles (4.5 km) away.\nGwbert as seen today essentially dates back only as far as the early 20th century, the most prominent buildings being the extensive Cliff Hotel and the smaller Gwbert Hotel. The settlement has an interesting history as a failed would-be resort, but despite its lack of facilities it is a popular holiday venue, being within easy reach of the Ceredigion and Pembrokeshire coastlines, both rich in scenery and wildlife.\nThe Ceredigion Coast Path, a 60-mile (96 km) long-distance footpath, and part of the Wales Coast Path, passes through Gwbert, making a marked detour inland north of the Cliff Hotel to avoid a dangerous cliff path."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Gwbert",
                        "_text": "Pentref bychan yn sir Ceredigion yw Gwbert. Saif i'r gogledd-orllewin o dref Aberteifi, ym mhen draw'r B4548, ar ochr ogleddol aber Afon Teifi. Gerllaw saif Craig Gwbert ac ychydig ymhellach i'r gogledd ar hyd yr arfordir mae Ynys Aberteifi. Yr adeilad mwyaf yn y pentref yw'r Cliff Hotel.\nMae’r twyni tywod i'r de ac i'r dwyrain o'r pentref yn dirwedd hanesyddol, ond pentref cymharol newydd yw Gwbert ei hun, yn dyddio o'r 20fed ganrif."
                    }
                ]
            },
            {
                "id": "ceredigion#hafodiwan",
                "name": "Hafodiwan",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Hafodiwan",
                        "_text": "Hafodiwan is a hamlet in the community of Llandysiliogogo, Ceredigion, Wales, which is 69.6 miles (112km) from Cardiff and 186.6 miles (300.2km) from London. Hafodiwan is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Hafodiwan",
                        "_text": "Pentrefan yng nghymuned Llandysiliogogo, Ceredigion, Cymru yw Hafodiwan, sydd 69.6 milltir (112 km) o Gaerdydd a 186.6 milltir (300.2 km) o Lundain.\n\nCynrychiolir Hafodiwan yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#hawen",
                "name": "Hawen",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Hawen",
                        "_text": "Hawen is a hamlet in the community of Troedyraur, Ceredigion, Wales, which is 68 miles (109.4km) from Cardiff and 187.6 miles (301.9km) from London. Hawen is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\n^ National Assembly for Wales Website; recalled 24 February 2014\n^ parliament.uk Website; recalled 24 February 2014"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Hawen",
                        "_text": "Pentrefan yng nghymuned Troedyraur, Ceredigion, Cymru yw Hawen, sydd 68 milltir (109.4 km) o Gaerdydd a 187.6 milltir (301.9 km) o Lundain.\n\nCynrychiolir Hawen yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#horeb",
                "name": "Horeb",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Horeb",
                        "_text": "Horeb may refer to:\nMount Horeb, possibly another name for the Biblical Mount Sinai\nMount Horeb, Wisconsin, in Dane County, Wisconsin\nMount Horeb Sasthamcotta, ashram in Kerala, India\nHoreb, Carmarthenshire, Wales\nHoreb, Ceredigion, Wales\nHoreb, Flintshire, Wales"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Horeb",
                        "_text": "Gallai Horeb gyfeirio at un o sawl lle:\nYn y Beibl:\nHoreb, mynydd yn y Dwyrain Canol (lleoliad ansicr)\nPentrefi yng Nghymru:\nHoreb (Ceredigion)\nHoreb (Sir Gaerfyrddin)\nHoreb (Sir y Fflint)\nYn ogystal mae Horeb yn enw ar sawl capel yng Nghymru."
                    }
                ]
            },
            {
                "id": "ceredigion#lampeter",
                "name": "Lampeter",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Lampeter",
                    "_text": "Lampeter (Welsh: Llanbedr Pont Steffan or, more informally, Llambed) is a town in Ceredigion, South West Wales, lying at the confluence of the River Teifi and the Afon Dulas. It is the third largest urban area in Ceredigion after Aberystwyth and Cardigan."
                }
            },
            {
                "id": "ceredigion#llan-non",
                "name": "Llan-non"
            },
            {
                "id": "ceredigion#llanafan",
                "name": "Llanafan",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanafan",
                        "_text": "Llanafan (Welsh for \"St Afan's parish\") may refer to any of:\nLlanafan Fawr, a community and parish in Powys\nLlanafan Fechan of Llanfechan, a village and church in Powys\nLlanafan, a village in Ceredigion\nLlanafan y Trawsgoed, the parish around the village in Ceredigion"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanafan",
                        "_text": "Erthygl am y pentref yng Ngheredigion yw hon. Gweler hefyd Llanafan Fawr, Powys, ac Afan (gwahaniaethu).\n\nPentref bychan a phlwyf eglwysig yng ngogledd Ceredigion yw Llanafan. Gorwedd tua 9 milltir i'r de-ddwyrain o Aberystwyth ar ffordd wledig o Gwm Ystwyth i Bontarfynach. Gelwir y pentref yn Llanafan y Trawsgoed weithiau (gweler Trawscoed).\nGorwedd y plwyf yn hen gwmwd y Creuddyn, a fu'n rhan o gantref Penweddig yn yr Oesoedd Canol. Rhed afon Ystwyth heibio i'r pentref tua hanner milltir i'r de ohono lle ceir pont dros yr afon.\nEnwir y pentref a'r plwyf ar ôl Sant Afan ('Afan Buallt' neu'r 'Esgob Afan', fl. 500-542). Ceir Ffynnon Afan yn y plwyf. Mae'r eglwys yn byr hynafol ac yn cynnwys 'cangell wylo'.\nMae gan Lanafan neuadd pentref ac ysgol gynradd."
                    }
                ]
            },
            {
                "id": "ceredigion#llanarth",
                "name": "Llanarth",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanarth",
                        "_text": "Llanarth may refer to:\nLlanarth, Ceredigion\nLlanarth, Monmouthshire\nLlanarth, Queensland"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanarth",
                        "_text": "Ceir mwy nag un lle o'r enw Llanarth yng Nghymru:\nLlanarth (Ceredigion)\nLlanarth (Sir Fynwy)"
                    }
                ]
            },
            {
                "id": "ceredigion#llanbadarn fawr",
                "name": "Llanbadarn Fawr",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanbadarn Fawr",
                        "_text": "Llanbadarn Fawr may relate to the following places:\nLlanbadarn Fawr, Ceredigion, a community in Ceredigion, Wales\nLlanbadarn Fawr, Powys, a community in Powys, Wales"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanbadarn Fawr",
                        "_text": "Am y gymuned ym Mhowys, gweler Llanbadarn Fawr, Powys.\nPentref ar gyrion tref Aberystwyth yw Llanbadarn Fawr.\nMae'r eglwys, sydd wedi ei chysegru i Sant Padarn, yn un nodedig. Roedd y clas yma yn ystod y Canol Oesoedd cynnar yn enwog am ei ddysg dan Sulien (c. 1010 - 1091) a'i fab Rhygyfarch ap Sulien. Roedd y clas yn parhau mewn bodolaeth pan ymwelodd Gerallt Gymro a Llanbadarn ar ei daith trwy Gymru yn 1188, er ei fod yn dirywio erbyn hynny. Ail-adeiladwyd yr eglwys yn 1257 yn dilyn tân, ac mae cryn dipyn o ail-adeiladu wedi bod wedyn. Bu Dafydd ap Gwilym yn byw yn y pentref ac mae yna gerdd amdano'i hun yn eglwys Llanbadarn, yn canolbwyntio ar y merched yn y gynulleidfa yn hytrach na'r gwasanaeth. Gwelodd y pentref ddatblygu mawr yn ystod y 90au, gyda archfarchnad Safeway(nawr Morrisons) a siopau eraill yn cael ei hadeiladu ar dir fferm Parc yr Afon.\nMae gan Goleg Prifysgol Cymru, Aberystwyth gampws yma, yn cynnwys yr adran gwyddor gwybodaeth (Coleg Llyfrgellwyr Cymru gynt) a'r Sefydliad Astudiaethau Gwledig (Coleg Amaethyddiaeth Cymru gynt). Mae dwy dafarn yn y pentref, y Llew Du a'r Gogerddan Arms. Yma hefyd y lleolir caeau chwaraeon Prifysgol Aberystwyth (Prifysgol Cymru, Aberystwyth tan 2007) ar gaeau Blaendolau."
                    }
                ]
            },
            {
                "id": "ceredigion#llancyfelyn",
                "name": "Llancyfelyn"
            },
            {
                "id": "ceredigion#llanddeiniol",
                "name": "Llanddeiniol",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanddeiniol",
                    "_text": "Gallai Llanddeiniol gyfeirio at:\nLlanddeiniol, Ceredigion\nLlanddeiniol Fab, Môn\nGweler hefyd\nDeiniol\nLlanddeiniolen"
                }
            },
            {
                "id": "ceredigion#llanddewi-brefi",
                "name": "Llanddewi-Brefi"
            },
            {
                "id": "ceredigion#llandre",
                "name": "Llandre",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llandre",
                        "_text": "Llandre, or Llanfihangel Genau'r Glyn, is a village in Ceredigion, Wales. It lies 5 miles north of Aberystwyth in the north-west of the county, on the road from Rhydypennau to Borth. To the north lies the village of Dôl-y-bont.\n^ \"Community population 2011\". Retrieved 10 May 2015."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llandre",
                        "_text": "Gallai Llandre gyfeirio at un o sawl lle yng Nghymru:\nLlandre (Llanfihangel Genau'r Glyn), Ceredigion\nLlandre, Sir Gaerfyrddin\nLlandre, ger Caio\nLlandre, ger Hendy-gwyn ar Daf"
                    }
                ]
            },
            {
                "id": "ceredigion#llanfair clydogau",
                "name": "Llanfair Clydogau",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanfair Clydogau",
                        "_text": "Llanfair Clydogau is a village and a community in Ceredigion, Wales. It is located on the B4343 road 4 miles north-east of Lampeter.\nThe electoral ward's population in 2011 was 634."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanfair Clydogau",
                        "_text": "Pentref bychan gwledig a chymuned yn ne Ceredigion yw Llanfair Clydogau. Fe'i lleolir ar lôn y B4343 tua 4 milltir i'r dwyrain o Lanbedr Pont Steffan.\nSaif ar lan ddwyreiniol Afon Teifi gyda bryniau Craig Twrch (1226 troedfedd) a Bryn Brawd (1588 troedfedd) yn gefn iddi i'r dwyrain, ar y ffin â Sir Gaerfyrddin. Mae tair nant Clywedog yn cyfarfod â'i gilydd yno.\nRhed ffordd Rufeinig Sarn Helen o'r gaer Rufeinig yn Llanio i gyffiniau Llanfair Clydogau. Yno, ychydig i'r gorllewin o'r pentref, mae'n fforchio, gydag un fforch yn arwain i'r dwyrain heibio Llanymddyfri a Dolaucothi i Nidum (Castell Nedd), a'r llall yn mynd yn ei blaen i gyfeiriad Caerfyrddin.\nRoedd digon o waith plwm ac arian yn yr ardal ar un adeg ond maent wedi pallu ers talwm. Filltir i lawr y lôn i'r de mae pentref bychan Cellan, magwrfa Moses Williams (ganed yno yn 1685) a'r ysgolhaig Griffith John Williams."
                    }
                ]
            },
            {
                "id": "ceredigion#llanfarian",
                "name": "Llanfarian",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanfarian",
                        "_text": "Llanfarian is a village and an electoral ward located in the district county of Ceredigion, Mid-Wales, south of the administrative centre Aberystwyth.\nThe 2001 census showed Llanfarian as having a population of 1442, increasing to 1,541 at the 2011 Census.\nLlanfarian lies above the banks of the river Ystwyth in the Ystwyth Valley.\n^ \"Community and electoral ward population 2011\". Retrieved 12 May 2015."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanfarian",
                        "_text": "Pentref a chymuned yng nghanolbarth Ceredigion yw Llanfarian. Saif y pentref ger y briffordd A487 ychydig i'r de o dref Aberystwyth. Llifa Afon Ystwyth gerllaw'r pentref.\nHeblaw pentref Llanfarian ei hun, mae Cymuned Llanfarian yn cynnwys Blaenplwyf, Capel Seion, Rhydgaled, Moriah a Rhydyfelin. Roedd poblogaeth y gymuned yn 1,442 yn 2001. Saif plasdy Nanteos o fewn y gymuned."
                    }
                ]
            },
            {
                "id": "ceredigion#llanfihangel-y-creuddyn",
                "name": "Llanfihangel-y-Creuddyn"
            },
            {
                "id": "ceredigion#llangeitho",
                "name": "Llangeitho",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llangeitho",
                        "_text": "Llangeitho is a village and community in Ceredigion, Wales situated on the upper river Aeron about 6 kilometres (3.7 mi) due west of Tregaron and 11 kilometres (6.8 mi) north of Lampeter. It has a population of 874, decreasing to 819 at the 2011 Census.\nIt is primarily associated with the name of Daniel Rowland (born in the village in 1713) and the Welsh Methodist revival of the 18th century. Rowland served as curate at Nantcwnlle and Llangeitho. The village's chapel, built in 1760, became famous throughout Wales as a Methodist centre, and thousands of people visited it to listen to the preaching. Rowland was buried in the village and there is a memorial column to him there. Two more chapels were built, in 1764 and 1814, to replace the original chapel. The village witnessed many periods of religious revival throughout that century, but the most powerful was that of 1762. Rejoicing, dancing and jumping for joy were seen during the 1762 revival. Welsh Methodists earned the name 'Jumpers' as a result. William Williams Pantycelyn wrote in defence of these celebrations.\nThe village was long considered as a stronghold of the Welsh language, but the 1970s saw an influx of people from outside Wales, mainly from England, and this period saw the percentage of Welsh speakers decline from 83% in 1971 to 55% ten years later. The census figure for 2001 was 57%.\nThe village church, situated on the north side of the village, is an ancient one, but the first substantial reference to it is from around 1900: the pretty mediaeval double screen and the old wooden stairs leading up to the gallery were destroyed.\nThe church and parish are named after St Ceitho, and St Ceitho's Spring is nearby: its water is said to be cool in summer and warm in winter.\nAt the edge of the village is the mansion of Cwrt Mawr, where antiquary J. H. Davies assembled a valuable collection of Welsh language manuscripts known as the Cwrtmawr manuscripts, which Davies gave to the National Library of Wales and now forms part of its manuscript collection.\n^ \"Community population 2011\". Retrieved 12 May 2015. \n^ Office for National Statistics : Census 2001 : Parish Headcounts : Ceredigion Retrieved 19 January 2010"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llangeitho",
                        "_text": "Pentref a chymuned yng nghanolbarth Ceredigion yw Llangeitho. Saif ym mhen uchaf Dyffryn Aeron ar lan ddwyreiniol Afon Aeron. Mae'r pentref ar groesfordd ar y B4342 7 milltir i'r gogledd o Lanbedr Pont Steffan.\nAm ganrifoedd bu Llangeitho'n gadarnle i'r iaith Gymraeg, ond cafwyd mewnlifiad mawr yn y 1970au a arweiniodd at gwymp yn y canran o'r boblogaeth sy'n medru'r iaith o 83% yn 1971 i 55% yn 1981. Yn ôl cyfrifiad 2001 y ffigwr rwan yw 57%."
                    }
                ]
            },
            {
                "id": "ceredigion#llangoedmor",
                "name": "Llangoedmor",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llangoedmor",
                        "_text": "Llangoedmor is a village 2 miles east of Cardigan, Ceredigion, Wales.\nIt is also the name of a Community Council which encompasses Llechryd and parts of Penparc. Llangoedmor (Welsh: the church the great wood), is derived from the groves of Welsh Oak and other trees which existed there. The remnants of the woodland still exist and are now a site of Special Scientific Interest, this wood is known locally as Cwm Du (meaning Black Valley in English).\nIn the Dark Ages it was the home of St Cynllo, whose knee imprints are said to exist in a rock, near the farm named Felin Gynllo. His feast day is 17 July. A sparsely populated area, it is mainly made up of farmsteads, the occasional mansion, such as Coedmore and Plas Llangoedmor, and detached houses. The Croes-y-Llan area has seen the most recent building activity in the last two decades, and has seen an increase in the population of this village, especially by those from cities who have moved from urban conurbations.\nLlangoedmor was the site of a 12th-century battle. Samuel Lewis's A Topographical Dictionary of Wales (1833) states:\n\"Soon after the death of Henry I, a memorable battle was fought near Crûg Mawr, a conical hill in this parish, between the Welsh, commanded by Gruffudd ap Rhys and the English, in which the latter sustained a signal defeat.\"\nThese days, Llangoedmor is a popular spot for tourists, partly because of its proximity to the Preseli Hills and Pembrokeshire Coast National Park. The parish church of St Cynllo is a grade II* listed building. \n^ \"Community population 2011\". Retrieved 13 May 2015. \n^ \"Church of St Cynllo, Llangoedmor, Llangoedmor\". British Listed Buildings. Retrieved 7 January 2014."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llangoedmor",
                        "_text": "Pentref bychan a phlwyf yn ne-ddwyrain Ceredigion yw Llangoedmor. Saif y pentref 1 filltir i'r dwyrain o dref Aberteifi ar y lôn B4570 ar lan ffrwd fechan sy'n llifo i aber Afon Teifi gerllaw.\nSant Cynllo yw nawddsant yr eglwys. Atgyweirwyd yr hen eglwys yn sylweddol yn 1860. Er mai pentref bychan yw Llangoedmor heddiw, ar un adeg roedd gan ei chlas awdurdod dros ardal ehangach, yn cynnwys Aberteifi, Mwnt a Llechryd.\nCeir Ffynnon Cynllo yn y plwyf, enwog am iachau'r crudcymalau, yn ogystal â 'Cerwyni Cynllo' ar lan Afon Teifi; ogofâu â'r dŵr yn \"berwi\" ynddynt. Ceir gwaith amddiffyn o bridd a elwir Cynllo Faes.\nCeir llawer o straeon am fywyd mân-fonheddwyr Cymreig Plas Llangoedmor yn llyfr H. M. Vaughan The South Wales Squires (llyfr a gafodd ddylanwad mawr ar Saunders Lewis)."
                    }
                ]
            },
            {
                "id": "ceredigion#llangorwen",
                "name": "Llangorwen",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llangorwen",
                        "_text": "Llangorwen is a village located in the county of Ceredigion, Mid-Wales. Close to Clarach Bay and a mile north of Aberystwyth.\nThe Church of All Saints just south of the village, is a grade II* listed building.\nJutting out to sea the Sarn Gynfelyn shingle spit is located a few kilometres north of Llangorwen."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llangorwen",
                        "_text": "Perntref bychan yng nghymuned Tirymynach, Ceredigion, Cymru yw Llangorwen, sydd 75.9 milltir (122.2 km) o Gaerdydd a 179.1 milltir (288.2 km) o Lundain.\n\nCynrychiolir Llangorwen yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#llangranog",
                "name": "Llangranog"
            },
            {
                "id": "ceredigion#llangwyryfon",
                "name": "Llangwyryfon",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llangwyryfon",
                        "_text": "Llangwyryfon is a village in the county of Ceredigion, Wales. It lies on the B4576 about 8 miles to the south and east of Aberystwyth. The village lies in the valley of the River Wyre and contains the roadbridge where the B4576 crosses the Wyre downstream of which lies the confluence of the rivers Beidiog and the Wyre. The name Llangwyryfon derives from the tale of Saint Ursula to whom the village church is dedicated. Llan is Welsh for church and the gwyryddon are the 11,000 virgins who Ursula was martyred along with.\nLlangwyryfon has boundaries with Llanrhystud, Llanilar, Dyffryn Arth, Llangeitho and Lledrod.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llangwyryfon",
                        "_text": "Pentref bychan yn sir Ceredigion yw Llangwyryfon, yn yr hen amser Llangwyryddon. Saif ar y ffordd B4576, tua naw milltir i'r de-ddwyrain o Aberystwyth. Mae Afon Wyre yn llifo trwy'r pentref.\nCysegrwyd yr eglwys i'r Santes Ursula a'r unarddeg mil o wyryfon a ferthyrwyd gyda hi. Roedd yr hen eglwys ynghanol y fynwent, ond yn 1879 adeiladwyd eglwys newydd tu allan i'r fynwent.\nCofnodir i Daniel Rowland, William Williams (Pantycelyn) a Howel Harris gynnal seiadau yma rhwng 1743 a 1750."
                    }
                ]
            },
            {
                "id": "ceredigion#llangybi",
                "name": "Llangybi",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llangybi",
                        "_text": "Llangybi can refer to one of several villages named after Saint Cybi, their reputed founder.\nIn Wales\nLlangybi, Ceredigion\nLlangybi, Gwynedd\nLlangybi, Monmouthshire"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llangybi",
                        "_text": "Ceir mwy nag un enghraifft o'r enw lle Llangybi:\nLlangybi, Gwynedd\nLlangybi, Ceredigion\nLlangybi, Sir Fynwy\nGweler hefyd:\nCaergybi, Môn\na'r sant Cybi."
                    }
                ]
            },
            {
                "id": "ceredigion#llanilar",
                "name": "Llanilar",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanilar",
                        "_text": "Llanilar is a village in Ceredigion, Wales, about 4 kilometers (2.5 mi) southeast of Aberystwyth. It is the eponym of the hundred of Ilar.The population at the 2011 census was 1,085.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanilar",
                        "_text": "Tref fechan yng Ngheredigion yw Llanilar, sy'n gorwedd ar yr A485 tua 4 milltir i'r de-ddwyrain o Aberystwyth. Mae ganddi 1008 o drigolion, a 60% ohonynt yn siarad Cymraeg (Cyfrifiad 2001).\nMae Afon Ystwyth yn rhedeg heibio i'r pentref. Ar y bryn gerllaw ceir castell mwnt a beili a godwyd gan y Normaniaid.\nMae Ysgol Gynradd Llanilar, swyddfa bost, meddygfa a garej yn y pentref. Sefydlwyd Sioe Llanilar ym 1903, a cynhelir y sioe amaethyddol hon yn flynyddol yn gynnar ym mis Awst.\nMae'r cyflwynydd teledu adnabyddus Dai Jones yn byw ac yn ffermio yn Llanilar."
                    }
                ]
            },
            {
                "id": "ceredigion#llanrhystud",
                "name": "Llanrhystud",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanrhystud",
                        "_text": "Llanrhystud is a seaside village, post town and electoral division on the A487 road in the county of Ceredigion, nine miles south of Aberystwyth, Wales. It is named after the early Christian Welsh saint Rhystud.\nThe community population taken at the United Kingdom Census 2011 was 966\nThe electoral ward stretches beyond the confines of Llanrhystud to include the village of Llangwyryfon; the ward has a total population of 1,562."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanrhystud",
                        "_text": "Pentref ar arfordir sir Ceredigion yw Llanrhystud. Saif ar y briffordd A487, rhyw naw milltir i'r de o Aberystwyth.\nLlifa Afon Wyre trwy'r pentref ychydig cyn cyrraedd a môr, ac mae Afon Wyre Fach yn ymuno a hi ychydig uwchben y pentref. Gerllaw'r fan lle mae'r ddwy afon yn ymuno, mae Gaer Penrhôs, lle mae olion bryngaer o Oes yr Haearn ac olion castell, a adeiladwyd, efallai gan Cadwaladr ap Gruffudd, brawd Owain Gwynedd yn 1149. Castell mwnt a beili ydyw, yn defnyddio gweddillion yr hen fryngaer fel beili. Roedd Rhys ap Gruffudd (Llansadwrn) yn dal tiroedd yma yn y 14eg ganrif.\nDyddia'r eglwys bresennol, sydd wedi ei chysegru i Sant Rhystud, o'r flwyddyn 1852, ond gellir gweld rhywfaint o olion yr eglwys flaenorol."
                    }
                ]
            },
            {
                "id": "ceredigion#llansantffraed",
                "name": "Llansantffraed",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Llansantffraed",
                    "_text": "Llansantffraed is a parish in the community of Talybont-on-Usk in Powys, Wales near Brecon.\n\nThe church of St Ffraid (or St Bridget) is a grade II* listed building. It was rebuilt in 1885.\nThe parish is the birth and burial place of the poet Henry Vaughan (1621-1695) whose grave in the churchyard overlooks the River Usk.\n\n"
                }
            },
            {
                "id": "ceredigion#llanwenog",
                "name": "Llanwenog",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanwenog",
                        "_text": "Llanwenog is a community in the county of Ceredigion, Wales. It is 60.5 miles (97.4 km) from Cardiff and 178.5 miles (287.3 km) from London. In 2011 the population of Llanwenog was 1,317, with 57.0% of them able to speak Welsh.\nThe district's name honors Saint Gwenog, a holy virgin.\nThe community includes the villages of Cwmsychbant, Highmead, Aber, Drefach and Rhuddlan.\nThe Llanwenog sheep is a breed of domestic sheep originating in Wales, which was developed in the 19th century.\n^ Bangor University Placenames Unit (Canolfan Bedwyr); accessed 9 May 2014\n^ Google Maps (Map). Google.  \n^ Welsh Government website; 2011 Census Returns and stats; accessed 9 May 2014"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanwenog",
                        "_text": "Pentref, plwyf a chymuned yn Nyffryn Teifi yn ne Ceredigion yw Llanwenog. Saif ar yr A475 tua 6 milltir i'r gorllewin o Lanbedr Pont Steffan ac i'r gogledd-orllewin o Lanybydder. Cysegrwyd yr eglwys i Sant Gwenog, ac mae'n cynnwys bedyddfaen nodedig. Cafwyd hyd i garreg yma gydag arysgrif o'r 5ed ganrif mewn Lladin ac Ogam, yn coffhau Trenacatus fab Maglagnus. Mae yn awr yn yr Amgueddfa Genedlaethol. Enwyd brîd o ddefaid ar ôl Llanwenog.\nMae'r gymuned hefyd yn cynnwys pentrefi Rhuddlan Teifi, Dre-fach, Cwrtnewydd, Alltyblaca a Gors-goch. Roedd poblogaeth yn gymuned yn 2001 yn 1,391."
                    }
                ]
            },
            {
                "id": "ceredigion#llanwnnen",
                "name": "Llanwnnen",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llanwnnen",
                        "_text": "Llanwnnen is a village, parish and community located in the county of Ceredigion, Wales.\nThe population of the community taken at the 2011 census was 490.\n^ \"Community population 2011\". Retrieved 12 May 2015."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llanwnnen",
                        "_text": "Pentref, plwyf a chymuned yn Nyffryn Teifi yn ne Ceredigion yw Llanwnnen. Saif ar groesffordd ar yr A475 tua 4 milltir i'r gorllewin o Lanbedr Pont Steffan, ac ar lan Afon Grannell, fymryn i'r gogledd o'r fan lle mae'r afon honno yn llifo i Afon Teifi. Cysegrwyd yr eglwys, sy'n dyddio o'r 15fed ganrif, i'r santes Gwnnen.\nMae'r gymuned yn cynnwys dalgylch Afon Grannell. Mae yr Undodiaid yn gryf iawn yn yr ardal hon, ac o'r herwydd cafodd yr enw \"y smotyn du\" gan aelodau enwadau eraill. Roedd poblogaeth y gymuned yn 2001 yn 1,391.\nTreuliodd y bardd Daniel Evans (Daniel Ddu o Geredigion) (1792-1846) rhan helaeth ei oes ar fferm y teulu yn y plwyf."
                    }
                ]
            },
            {
                "id": "ceredigion#lledrod",
                "name": "Lledrod",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Lledrod",
                        "_text": "Lledrod is a village and parish in Ceredigion, Wales. The village is situated on the A485 road from Llanilar to Tregaron, where it crosses the valley of the River Wyre (Welsh: Afon Wyre). The parish is divided into Lledrod Isaf (Lower Lledrod) and Lledrod Uchaf (Upper Lledrod); Lledrod village is located in the former, Swyddffynnon village is situated in the latter. The name 'Lledrod' is a contraction of name Llanfihangel-Lledrod, which is itself a corruption of Llanfihangel Llether-troed, meaning 'the church of St Michael at the foot of the slope'.\n^ \"Community population 2011\". Retrieved 13 May 2015. \n^ http:\/\/www.genuki.org.uk\/big\/wal\/CGN\/Lledrod\/ParishMap.html Lledrod parish map\n^ http:\/\/www.visionofbritain.org.uk\/descriptions\/734240"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Lledrod",
                        "_text": "Pentref a chymuned yng nghanolbarth Ceredigion yw Lledrod, hanner ffordd rhwng Aberystwyth a Thregaron.\nYn 2001 roedd 707 o bobl yn byw yn ardal cymuned Lledrod, 62% ohonynt yn siarad Cymraeg (Cyfrifiad 2001)."
                    }
                ]
            },
            {
                "id": "ceredigion#llundain-fach",
                "name": "Llundain-fach",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Llundain-fach",
                    "_text": "Pentref bychan gwledig yn sir Ceredigion yw Llundain-fach (hefyd Llundain Fach weithiau). Fe'i lleolir yn ne'r sir, ar y B4342 tua 6 milltir i'r de-ddwyrain o Aberaeron.\nMae'n rhan o gymuned Nancwnlle. Llifa Afon Aeron heibio i'r pentref, i'r de. Mae pont ger y pentref yn croesi'r afon i'w gysylltu ag Abermeurig ar y lan arall."
                }
            },
            {
                "id": "ceredigion#llwyn-y-groes",
                "name": "Llwyn-y-groes",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Llwyn-y-groes",
                    "_text": "Pentref bychan yn sir Ceredigion yw Llwyn-y-groes. Fe'i lleolir yn ne'r sir, tua 8-9 milltir i'r de-ddwyrain o Aberaeron.\\nMae'n rhan o gymuned Nancwnlle a phlwyf Gartheli. Saif ar groesffordd wledig gyda brif l\\u00f4n yn ei gysylltu \\u00e2 phentref Capel Betws Leucu a Dyffryn Aeron, tua milltir i'r gogledd, a gyda Llangybi i'r de. Rhed ffordd arall o Lwyn-y-groes i gyfeiriad Dyffryn Teifi, i'r dwyrain."
                }
            },
            {
                "id": "ceredigion#llwyncelyn",
                "name": "Llwyncelyn",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llwyncelyn",
                        "_text": "Llwyncelyn (English: Hollybush) is a district of Porth, Rhondda Cynon Taf.\nConsisting of five long terraces and two modern housing developments, Llwyncelyn is the home of one shop and a parish church, St. Luke's Church.\nLlwyncelyn is also where Porth Harlequins RFC play their home rugby union matches.\nNearby Nyth-Brân Farm was the home of legendary athlete Guto Nyth Brân.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llwyncelyn",
                        "_text": "Pentref bychan yn ne Ceredigion yw Llwyncelyn. Fe'i lleolir ar yr A487 tua 2 milltir a hanner i'r de o Aberaeron.\nLleolir Ysgol Gynradd Penlôn yn y pentref."
                    }
                ]
            },
            {
                "id": "ceredigion#llwyndafydd",
                "name": "Llwyndafydd",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Llwyndafydd",
                    "_text": "Pentref bychan yn ne Ceredigion yw Llwyndafydd (weithiau Llwyn-dafydd). Mae'n gorwedd rhai milltiroedd i'r de o dref fechan Ceinewydd ac yn rhan o gymuned Llandysiliogogo. Mae ar lan Afon Ffynnon Ddewi sy'n llifo i'r môr ger Cwmtydi, tua 2 filltir i'r gogledd-orllewin ar lan Bae Ceredigion.\nCredir mai yn Llwyndafydd y bu canolfan gynharaf cwmwd Caerwedros, er bod pentref Caerwedros, i'r gogledd o Lwyndafydd, yn dwyn enw'r hen gwmwd.\nMae'r pentrefi bychain cyfagos yn cynnwys Caerwedros a Nanternis. Saif hen domen mwnt a beili Castell Caer Wedros tua hanner kilometr i'r gogledd-ddwyrain o Lwyndafydd."
                }
            },
            {
                "id": "ceredigion#llywernog",
                "name": "Llywernog",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llywernog",
                        "_text": "Llywernog is a hamlet in the community of Blaenrheidol, Ceredigion, Wales, which is 70.7 miles (113.7km) from Cardiff and 171 miles (275.1km) from London. Llywernog is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\nThere is an old lead and silver mine at Llawernog."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llywernog",
                        "_text": "Pentrefan yng nghymuned Blaenrheidol, Ceredigion, Cymru yw Llywernog, sydd 70.7 milltir (113.7 km) o Gaerdydd a 171 milltir (275.1 km) o Lundain.\n\nCynrychiolir Llywernog yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                    }
                ]
            },
            {
                "id": "ceredigion#maen-y-groes",
                "name": "Maen-y-groes",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Maen-y-groes",
                        "_text": "Maen-y-groes is a hamlet in the community of Llanllwchhaearn, Ceredigion, Wales, which is 71 miles (114.3km) from Cardiff and 187 miles (300.9km) from London. Maen-y-groes is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Maen-y-groes",
                        "_text": "Pentrefan yng nghymuned Llanllwchaearn, Ceredigion, Cymru yw Maen-y-groes, sydd 71 milltir (114.3 km) o Gaerdydd a 187 milltir (300.9 km) o Lundain.\nCynrychiolir Maen-y-groes yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                    }
                ]
            },
            {
                "id": "ceredigion#maes llyn",
                "name": "Maes llyn"
            },
            {
                "id": "ceredigion#maes-bangor",
                "name": "Maes-bangor",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Maes-bangor",
                        "_text": "Maes-bangor is a hamlet in the community of Melindwr, Ceredigion, Wales, which is 72.2 miles (116.1km) from Cardiff and 174.9 miles (281.4km) from London. Maes-bangor is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Maes-bangor",
                        "_text": "Pentrefan yng nghymuned Melindwr, Ceredigion, Cymru yw Maes-bangor, sydd 72.2 milltir (116.1 km) o Gaerdydd a 174.9 milltir (281.4 km) o Lundain.\n\nCynrychiolir Maes-bangor yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#manian-fawr",
                "name": "Manian-fawr",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Manian-fawr",
                    "_text": "Pentrefan yng nghymuned Llandudoch, Sir Benfro, Cymru yw Manian-fawr, sydd 77.7 milltir (125.1 km) o Gaerdydd a 199.4 milltir (320.8 km) o Lundain.\nCynrychiolir Manian-fawr yn y Cynulliad Cenedlaethol gan Paul Davies (Ceidwadwyr) a'r Aelod Seneddol yw Stephen Crabb (Ceidwadwyr).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                }
            },
            {
                "id": "ceredigion#morfa",
                "name": "Morfa",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Morfa",
                        "_text": "Morfa may refer to:\nConwy Morfa, North Wales, United Kingdom\nMorfa, Swansea, South Wales, United Kingdom\nMorfa (drug), a highly potent opiate analgesic drug"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Morfa",
                        "_text": "Erthygl am y tirffurff yw hon. weler hefyd Morfa (gwahaniaethu).\nDarn o wastatir isel, gan amlaf ar lan y môr ac yn enwedig ger aber afon, a orchuddir gan ddŵr o dro i dro, yw morfa. Mae'r defnydd o'r gair yn amrywio a gellir ei gymhwyso i ddisgrifio unrhyw gorstir neu gors, neu ros gwlyb neu weundir ar lan aber. Y term agosaf yn Saesneg yw salt-marsh neu sea marsh (er bod y term geiriadurol 'morfa hallt' wedi cael ei fachu am hynny).\nEr ei fod yn dir diffrwyth ar un olwg, mae morfeydd yn gynefin bwysig i fywyd gwyllt, yn enwedig planhigion ac adar."
                    }
                ]
            },
            {
                "id": "ceredigion#moriah",
                "name": "Moriah",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Moriah",
                        "_text": "Moriah (Hebrew: מוֹרִיָּה, Modern Moriyya, Tiberian Môriyyā ; \"ordained\/considered by the LORD\") (Arabic: مروة Marwah) is the name given to a mountain range by the Book of Genesis, in which context it is the location of the sacrifice of Isaac. Traditionally Moriah has been interpreted as the name of the specific mountain at which this occurred, rather than just the name of the range.\nThe majority view in Judaism and Christianity is that Mount Moriah is identical with the Temple Mount of Jerusalem. This view though is considered highly controversial among religious as well as secular Bible scholars."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Moriah",
                        "_text": "Pentrefan yng nghymuned Llanfarian, Ceredigion, Cymru yw Moriah, sydd 73 milltir (117.4 km) o Gaerdydd a 177.1 milltir (285 km) o Lundain.\n\nCynrychiolir Moriah yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#mydroilyn",
                "name": "Mydroilyn",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Mydroilyn",
                    "_text": "Pentref yn ne Ceredigion yw Mydroilyn. Fe'i lleolir ar lôn wledig y B4342 tua 6 milltir i'r de o Aberaeron.\nLleolir Ysgol Gynradd Mydroilyn yn y pentref."
                }
            },
            {
                "id": "ceredigion#mynydd bach",
                "name": "Mynydd Bach",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Mynydd Bach",
                    "_text": "Mynydd Bach (literally “Small Mountain” in Welsh) is located in the midlands of Ceredigion. It is a range of low hills, rather than a single mountain as its name suggests. The highest point reaches 329 meters above sea level. This area contains a few small villages and is an important place in Ceredigion’s cultural history.\n\n"
                }
            },
            {
                "id": "ceredigion#nant bargod",
                "name": "Nant Bargod"
            },
            {
                "id": "ceredigion#nanternis",
                "name": "Nanternis",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Nanternis",
                    "_text": "Pentref bychan yn ne Ceredigion yw Nanternis. Mae'n gorwedd tua dwy filltir i'r de o dref fechan Ceinewydd. Mae ar lan Afon Soden, sy'n llifo i'r môr i'r gogledd o Gwmtydu, tua milltir i'r gogledd-orllewin ar lan Bae Ceredigion.\nYn yr Oesoedd Canol roedd yn rhan o gwmwd Caerwedros.\nMae'r pentrefi bychain cyfagos yn cynnwys Caerwedros, Llwyndafydd a Cross Inn."
                }
            },
            {
                "id": "ceredigion#nantyronen station",
                "name": "Nantyronen Station",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Nantyronen Station",
                    "_text": "This is a redirect from a title that is another name such as a pseudonym, a nickname, or a synonym of the target, or of a name associated with the target. For more information follow the category link.\nThis redirect leads to the title in accordance with the naming conventions for common names and can help writing. It is not necessary to replace these redirected links with a piped link.\nIf this redirect is an incorrect name for the target, then use {{R from incorrect name}} instead."
                }
            },
            {
                "id": "ceredigion#nebo",
                "name": "Nebo",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Nebo",
                        "_text": "Nebo may refer to:"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Nebo",
                        "_text": "Ceir mwy nag un enghraifft o'r enw Nebo:\nNebo - Duw Babilonaidd\nY Dwyrain Canol\nNebo - dinas Feiblaidd, yn Iwda\nNebo - dinas Feiblaidd, ym Moab\nCymru\nNebo - pentref yn Nyffryn Aeron, Ceredigion\nNebo - pentref yn Sir Conwy\nNebo - pentref yng Ngwynedd\nNebo - pentref ar Ynys Môn\nAwstralia\nNebo - tref yn Queensland\nSwydd Nebo\nYr Unol Daleithiau\nNebo, Illinois\nNebo, Kentucky\nNebo, Gogledd Carolina\nNebo Center, Califfornia\nArdal Ysgol Nebo, ardal ysgol yn Swydd Utah, Utah\nMynyddoedd\nEnwir sawl mynydd gyda'r enw hwn, gweler dudalen gwahaniaethu Mynydd Nebo"
                    }
                ]
            },
            {
                "id": "ceredigion#new quay (ceinewydd)",
                "name": "New Quay (Ceinewydd)"
            },
            {
                "id": "ceredigion#new row",
                "name": "New Row",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/New Row",
                    "_text": "New Row is a hamlet in the community of Pontarfynach, Ceredigion, Wales, which is 66.5 miles (107km) from Cardiff and 169.5 miles (272.7km) from London. Rhes Newydd is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\n\n"
                }
            },
            {
                "id": "ceredigion#noyadd trefawr",
                "name": "Noyadd Trefawr"
            },
            {
                "id": "ceredigion#noyadd wilym",
                "name": "Noyadd Wilym"
            },
            {
                "id": "ceredigion#oakford",
                "name": "Oakford",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Oakford",
                    "_text": "Oakford is the name of several locations:\nAustralia\nOakford, Western Australia, a suburb of Perth\nUnited Kingdom\nOakford, Ceredigion, a village in Wales\nOakford, Devon, a village in England\nUnited States\nOakford, Illinois\nOakford, Indiana\nOakford, Pennsylvania\nOakford Park (Tampa), Florida, a neighborhood\nOakford Park, a former amusement park in Jeannette, Pennsylvania\nOakford Precinct, Menard County, Illinois"
                }
            },
            {
                "id": "ceredigion#old goginan",
                "name": "Old Goginan"
            },
            {
                "id": "ceredigion#pant-y-crug",
                "name": "Pant-y-crug",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Pant-y-crug",
                    "_text": "Pant-y-crug is a hamlet in the community of Melindwr, Ceredigion, Wales, which is 71.5 miles (115km) from Cardiff and 175 miles (281.6km) from London. Pant-y-crug is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                }
            },
            {
                "id": "ceredigion#panteg",
                "name": "Panteg",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Panteg",
                    "_text": "Panteg (Welsh: Pant-teg) is a village in the county borough of Torfaen, Wales. It is adjacent to Griffithstown, between the towns of Cwmbran and Pontypool. The village is best known for Panteg Steel Works, which finally closed in 2004.\nPrior to 1935 Panteg was also an urban district. It had a population of 11,499 in 1931. It was amalgamated into Pontypool in 1935. It is now a community and electoral ward of Torfaen."
                }
            },
            {
                "id": "ceredigion#parcllyn",
                "name": "Parcllyn",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Parcllyn",
                    "_text": "Pentref yng nghymuned Aber-porth, Ceredigion, Cymru yw Parcllyn, sydd 74.4 milltir (119.7 km) o Gaerdydd a 194.2 milltir (312.5 km) o Lundain.\n\nCynrychiolir Parcllyn yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                }
            },
            {
                "id": "ceredigion#pen-bont rhydybeddau",
                "name": "Pen-bont Rhydybeddau",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Pen-bont Rhydybeddau",
                    "_text": "Pentref bychan yng nghymuned Trefeurig, Ceredigion, Cymru yw Pen-bont Rhydybeddau, sydd 73.7 milltir (118.6 km) o Gaerdydd a 174.8 milltir (281.3 km) o Lundain.\n\nCynrychiolir Pen-bont Rhydybeddau yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                }
            },
            {
                "id": "ceredigion#pen-y-garn",
                "name": "Pen-y-garn",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pen-y-garn",
                        "_text": "Pen-y-garn may refer to:\nPen y Garn - a mountain in Ceredigion\nPenygarn, Torfaen - a village in Torfaen, in the ward of St Cadocs\/Penygarn, Wales\nPen-y-garn, Ceredigion - a village in Ceredigion, Wales\nPen-y-garn - a former farm near Llanpumsaint, Carmarthenshire, Wales, now part of the area known as Skanda Vale"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pen-y-garn",
                        "_text": "Gallai Pen-y-garn gyfeirio at un o ddau bentref yng Nghymru:\nPen y Garn\nPen-y-garn, Ceredigion\nPen-y-garn, Sir Gaerfyrddin\nPen-y-Garn-Goch\nPen-y-Garn Fawr"
                    }
                ]
            },
            {
                "id": "ceredigion#penbryn",
                "name": "Penbryn",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Penbryn",
                        "_text": "Penbryn (grid reference SN294520) is a village on the coast of Ceredigion in Wales, some ten miles up the coast from Cardigan between the villages of Tresaith and Llangrannog. It consists mostly of farms and caravan sites. Penbryn Beach is owned by the National Trust and was used for location filming for the James Bond film Die Another Day.\nNear the village is the Corbalengi Stone, a monument of the Early Christian period inscribed: \"CORBALENGI IACIT ORDOVS\". \"Ordovs\" is generally agreed to be the local tribe the Ordovices but \"Corbalengi\" is not found elsewhere, and there are many theories as to the significance of the inscription.\n^ \"Community population 2011\". Retrieved 13 May 2015. \n^ UCL UK Archaeology database"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Penbryn",
                        "_text": "Pentref bychan a chymuned yn ne Ceredigion yw Penbryn. Saif ger yr arfordir, rhwng Llangrannog ac Aberporth. Mae'r gymuned hefyd yn cynnwys pentrefi Tre-saith, Brynhoffnant, Glynarthen, Sarnau a Than-y-groes. Roedd poblogaeth y gymuned yn 2001 yn 1,283.\nMae'r traeth yn perthyn i'r Ymddiriedolaeth Genedlaethol.\n\n"
                    }
                ]
            },
            {
                "id": "ceredigion#penmorfa",
                "name": "Penmorfa",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Penmorfa",
                        "_text": "Penmorfa is a small village in the community of Penbryn, Ceredigion, Wales, which is 71.9 miles (115.7km) from Cardiff and 190.7 miles (306.8km) from London. Penmorfa is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Penmorfa",
                        "_text": "Pentref bychan yn Eifionydd, Gwynedd, yw Penmorfa. Mae'n gorwedd tua milltir i'r gorllewin o Dremadog ar bwys yr A487.\nFe'i gelwir yn Benmorfa am ei fod yn gorwedd ar ben gorllewinol morfa Tremadog, sy'n rhan o'r Traeth Mawr; buasai'r tir hwn yn wlypach o lawer cyn i William Madocks godi morglawdd dros geg y Traeth Mawr.\nEglwys Beuno Sant yw eglwys Penmorfa. Mae wedi cau ers rhai blynyddoedd.\nAr ochr arall yr Alltwen i'r gogledd o'r pentref ceir hen blasdy'r Gesail Gyfarch gyda phlasdy'r Clenennau yn ei wynebu dros y cwm.\nAr wahân i'r A487, mae lonydd bychain dros y morfa yn cysylltu'r pentref â Pentrefelin a Cricieth i'r de-orllewin a Penamser a Phorthmadog i'r de-ddwyrain."
                    }
                ]
            },
            {
                "id": "ceredigion#pennant",
                "name": "Pennant",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pennant",
                        "_text": "Pennant may refer to:"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pennant",
                        "_text": "Gallai Pennant\" gyfeirio at:"
                    }
                ]
            },
            {
                "id": "ceredigion#penparc",
                "name": "Penparc",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Penparc",
                    "_text": "Ceir dau bentref yng Nghymru o'r enw Penparc:\nPenparc, Ceredigion\nPenparc, Sir Benfro"
                }
            },
            {
                "id": "ceredigion#penparcau",
                "name": "Penparcau",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Penparcau",
                        "_text": "Penparcau is a village in Ceredigion next to the town of Aberystwyth in Wales. It is the largest electoral ward and 3rd most populated town or village in Ceredigion (3,122 Census 2011) after Aberystwyth and Cardigan."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Penparcau",
                        "_text": "Pentref bychan hynafol sy'n gorwedd i'r de o Aberystwyth, Ceredigion, yw Penparcau. Fe'i ystyrir bellach yn faestref o Aberystwyth. Saif ar lan Afon Rheidol. Mae'r A487 yn mynd trwy Penparcau. Hanner milltir i'r dwyrain ceir Southgate.\nMae cyfleusterau Penparcau yn cynnwys Ysgol Gynradd Llwyn yr Eos, maes chwarae, neuadd a sawl siop. Mae capel Eglwys Bresbyteraidd Cymru, Capel Ebeneser, yno ers 1848, ac ail-adeiladwyd ym 1939."
                    }
                ]
            },
            {
                "id": "ceredigion#penrhiw-llan",
                "name": "Penrhiw-llan"
            },
            {
                "id": "ceredigion#penrhiw-pal",
                "name": "Penrhiw-pal"
            },
            {
                "id": "ceredigion#penrhyn-coch",
                "name": "Penrhyn-coch",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Penrhyn-coch",
                        "_text": "Penrhyn-coch is a small Welsh village, in the community of Trefeurig, Ceredigion, located between the Afon Stewi and Nant Seilo rivers, close to where they merge into the Afon Clarach. The village is approximately 4 1⁄2 miles (7.2 km) north-east of Aberystwyth.\nThe village has expanded since the 1970s with several housing estates being built. There are around 480 houses and an estimated population of 1,037 (2005). Most of the working population is employed in Aberystwyth or at the nearby Aberystwyth University, Institute of Biological and Environmental Research.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Penrhyn-coch",
                        "_text": "Pentref bach ydy Penrhyn-coch yng nghymuned Trefeurig, Ceredigion. Lleolir rhwng yr Afon Stewi a Nant Seilo, yn agos i le maent yn ymuno ag Afon Clarach. Mae'r pentref tua 4½ milltir i'r gogledd ddwyrain o Aberystwyth.\nMae'r boblogaeth wedi tyfu'n sylweddol ers yr 1970au, gan i sawl ystad o dai gael eu hadeiladu. Erbyn 2005, roedd 480 o dai a thua 1,037 o drigolion. Cyflogir rhan helaeth o'r boblogaeth yn Aberystwyth, neu yn Sefydliad y Gwyddorau Biolegol, Amgylcheddol a Gwledig, Prifysgol Aberystwyth a leolir ar gyrion y pentref. (a adwaenir wrth yr acronym Seisnig, IBERS)"
                    }
                ]
            },
            {
                "id": "ceredigion#pentrefelin",
                "name": "Pentrefelin",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Pentrefelin",
                    "_text": "Mae Pentrefelin yn enw ar sawl lle yng Nghymru:\nPentrefelin, Ceredigion\nPentrefelin, Conwy\nPentrefelin, Gwynedd\nPentrefelin, Powys\nPentrefelin, Sir Gaerfyrddin\nPentrefelin, Ynys Môn, ar gyrion Amlwch\nGweler hefyd:\nPentre'r Felin (gwahaniaethu)"
                }
            },
            {
                "id": "ceredigion#pentrellwyn",
                "name": "Pentrellwyn",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pentrellwyn",
                        "_text": "Pentrellwyn is a small village in the community of Llandysul, Ceredigion, Wales, which is 63.1 miles (101.5 km) from Cardiff and 183.1 miles (294.6 km) from London. Pentrellwyn is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pentrellwyn",
                        "_text": "Pentref bychan yng nghymuned Llandysul, Ceredigion, Cymru yw Pentrellwyn, sydd 63.1 milltir (101.5 km) o Gaerdydd a 183.1 milltir (294.6 km) o Lundain.\n\nCynrychiolir Pentrellwyn yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#penybont",
                "name": "Penybont",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Penybont",
                    "_text": "Penybont (also sometimes spelled Pen-y-Bont) is a small village in Powys, Wales."
                }
            },
            {
                "id": "ceredigion#pisgah",
                "name": "Pisgah",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Pisgah",
                    "_text": "Pisgah may refer to:"
                }
            },
            {
                "id": "ceredigion#plas gogerddan",
                "name": "Plas Gogerddan"
            },
            {
                "id": "ceredigion#plwmp",
                "name": "Plwmp",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Plwmp",
                    "_text": "Pentref bychan yn ne Ceredigion yw Plwmp. Mae'n gorwedd ar yr A487 rhwng Aberaeron ac Aberteifi, tua tair milltir i'r de-orllewin o bentref Synod Inn, ac yn rhan o gymuned Llandysiliogogo.\nMae'r pentref yn gorwedd ar groesffordd wledig sy'n ei gysylltu ag Aberteifi, Aberaeron, Llwyndafydd a Ffostrasol."
                }
            },
            {
                "id": "ceredigion#pont-rhyd-y-groes",
                "name": "Pont-rhyd-y-groes",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Pont-rhyd-y-groes",
                    "_text": "Pont-rhyd-y-groes (English: the bridge of the ford of the cross, also Pontrhydygroes) is a village in Ceredigion, Wales located near Cwm Ystwyth and Pont ar Fynach. The village takes its name from the bridge (Welsh: pont) and (earlier) ford (Welsh: rhyd) over the River Ystwyth.\nThe area was formerly dominated by the mining industry, in particular by the Lisburnes. Recently various funding has caused the rebuilding of the miners bridge across the Ystwyth gorge, and also the waterfall.\nThe remnants of Fron Ceilliau Lead & Zinc Mine are situated about 2 miles from Pont-rhyd-y-groes. \n\n"
                }
            },
            {
                "id": "ceredigion#pont-sian",
                "name": "Pont-sian"
            },
            {
                "id": "ceredigion#ponterwyd",
                "name": "Ponterwyd",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ponterwyd",
                        "_text": "Ponterwyd is a village in Ceredigion, Wales. It lies in the Cambrian Mountains of Mid Wales, approximately 12 miles (19 km) east of Aberystwyth on the A44 road."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ponterwyd",
                        "_text": "Mae Ponterwyd yn bentref ym mryniau Ceredigion, a leolir tua 12 milltir i'r dwyrain o Aberystwyth ar lôn yr A44 rhwng y dref honno a Llangurig. I'r de mae pentref hanesyddol Ysbyty Cynfyn. I'r gogledd ceir moelydd llwm Pumlumon. Rhed Afon Rheidol i'r de o'r pentref."
                    }
                ]
            },
            {
                "id": "ceredigion#pontgarreg",
                "name": "Pontgarreg",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Pontgarreg",
                    "_text": "Pentref bychan yn ne Ceredigion yw Pontgarreg. Fe'i lleolir ger Llangrannog tua milltir a hanner o arfordir Bae Ceredigion ar lôn sy'n cysylltu Llangrannog a'r A487. Mae'n rhan o gymuned Llangrannog.\nCaewyd Ysgol Gynradd Pontgarreg, ysgol oedd yn gwasanaethu Llangrannog a'r cylch, pan agorwyd ysgol fro newydd, Ysgol T. Llew Jones, ym Mrynhoffnant."
                }
            },
            {
                "id": "ceredigion#ponthirwaun",
                "name": "Ponthirwaun",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ponthirwaun",
                        "_text": "Ponthirwaun is a hamlet in the community of Beulah, Ceredigion, Wales, which is 71.3 miles (114.8km) from Cardiff and 192.5 miles (309.7km) from London. Ponthirwaun is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ponthirwaun",
                        "_text": "Pentrefan yng nghymuned Beulah, Ceredigion, Cymru yw Ponthirwaun, sydd 71.3 milltir (114.8 km) o Gaerdydd a 192.5 milltir (309.7 km) o Lundain.\n\nCynrychiolir Ponthirwaun yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                    }
                ]
            },
            {
                "id": "ceredigion#pontrhydfendigaid",
                "name": "Pontrhydfendigaid",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pontrhydfendigaid",
                        "_text": "Pontrhydfendigaid is a village in Ceredigion, Wales. It lies on the western flank of the Cambrian Mountains, and is located between Devil's Bridge and Tregaron. The village lies on the River Teifi, the source of which is just 5 km to east at Llyn Teifi.\nIt is known for the ruins of the Cistercian Strata Florida Abbey, founded 1164, where Dafydd ap Gwilym is said to be buried and Llywelyn the Great held a council.\nThe station at Strata Florida was positioned to serve the village.\nThe village is home to an annual eisteddfod and a Celtic Music Society is based at the village's Black Lion Hotel.\nThe village was the birthplace and home of Caradog Jones, the first Welshman to reach the summit of Mount Everest.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pontrhydfendigaid",
                        "_text": "Pentref yng ngogledd Ceredigion yw Pontrhydfendigaid (neu Pont-rhyd-fendigaid). Fe'i adnabyddir ar lafar yn lleol fel Y Bont.\nMae'n gorwedd ar lan Afon Teifi yn agos i'w tharddle ym mryniau Elenydd, canolbarth Cymru. Cymryd y pentref ei enw o hen ryd ar yr afon honno a'r bont a godwyd yno. Mae ar lôn y B4343 rhwng Tregaron i'r de a Phontarfynach i'r gogledd, tua 13 milltir i'r de-ddwyrain o Aberystwyth.\nTua milltir i'r dwyrain o'r pentref ceir adfeilion Abaty Ystrad Fflur, un o abatai enwocaf Cymru, a sefydlwyd gan y Sistersiaid yn 1164. Roedd yn ganolfan dysg bwysig a chredir i un o fersiynau cynharaf Brut y Tywysogion gael ei lunio yno. Yn ôl traddodiad, claddwyd y bardd Dafydd ap Gwilym yno.\nCynhelir eisteddfod flynyddol ym Mhontrhydfendigaid, sef Eisteddfod Pantyfedwen (\"Steddfod Bont\"). Yma hefyd ceir Pafiliwn Bont, adeilad amlbwrpas modern lle cynhelir cyngherddau a digwyddiadau eraill.\nCredai rhai y seilwyd rhaglen deledu C'mon Midffild! ar glwb pêl-droed Pontrhydfendigaid.[angen ffynhonnell]"
                    }
                ]
            },
            {
                "id": "ceredigion#pren-gwyn",
                "name": "Pren-gwyn",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pren-gwyn",
                        "_text": "Pren-gwyn is a small village in the community of Llandysul, Ceredigion, Wales, which is 63.1 miles (101.6km) from Cardiff and 182.5 miles (293.6km) from London. Pren-gwyn is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\nThe name is derived from the Welsh language: \"White wood\".\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pren-gwyn",
                        "_text": "Pentref bychan yng nghymuned Llandysul, Ceredigion, Cymru yw Pren-gwyn, sydd 63.1 milltir (101.6 km) o Gaerdydd a 182.5 milltir (293.6 km) o Lundain.\n\nCynrychiolir Pren-gwyn yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#rhippinllwyd",
                "name": "Rhippinllwyd"
            },
            {
                "id": "ceredigion#rhos haminiog",
                "name": "Rhos Haminiog",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Rhos Haminiog",
                    "_text": "Pentrefan yng nghymuned Llansantffraid, Ceredigion, Cymru yw Rhos Haminiog, sydd 67.8 milltir (109.1 km) o Gaerdydd a 178.7 milltir (287.6 km) o Lundain.\n\nCynrychiolir Rhos Haminiog yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                }
            },
            {
                "id": "ceredigion#rhos-y-garth",
                "name": "Rhos-y-garth",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Rhos-y-garth",
                        "_text": "Rhos-y-garth is a hamlet in the community of Llanilar, Ceredigion, Wales, which is 68.7 miles (110.6km) from Cardiff and 174.7 miles (281.1km) from London. Rhos-y-garth is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Rhos-y-garth",
                        "_text": "Pentrefan yng nghymuned Llanilar, Ceredigion, Cymru yw Rhos-y-garth, sydd 68.7 milltir (110.6 km) o Gaerdydd a 174.7 milltir (281.1 km) o Lundain.\n\nCynrychiolir Rhos-y-garth yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                    }
                ]
            },
            {
                "id": "ceredigion#rhosygadair newydd",
                "name": "Rhosygadair Newydd",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Rhosygadair Newydd",
                    "_text": "Rhosygadair Newydd is a small village in the community of Aberporth, Ceredigion, Wales, which is 73.9 miles (118.9 km) from Cardiff and 194.1 miles (312.3 km) from London. Rhosygadair Newydd is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                }
            },
            {
                "id": "ceredigion#rhyd",
                "name": "Rhyd",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Rhyd",
                        "_text": "Rhyd can refer to:\nRhyd, Ceredigion, Wales\nRhyd, Gwynedd, Wales"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Rhyd",
                        "_text": "Mae hon yn erthygl ar y nodwedd ddaearyddol. Am ddefnydd arall o'r gair, gweler Rhyd (gwahaniaethu).\nLle bas mewn afon, ffrwd, neu gorff arall o ddŵr, y gellir ei groesi ar droed neu ar geffyl ac ati yw rhyd.\n\nYn yr amser cyn i bontydd ddod yn gyffredin y rhyd oedd y man croesi arferol ar afonydd, yn arbennig yn achos afonydd llai a ffrydiau (defnyddio cwch i'w croesi oedd y dewis arall). Mewn mannau lle oedd y dŵr yn fwy dyfn ceir cerrig llam weithiau. Mae lleoliad rhydau yn gymorth mawr wrth geisio olrhain hen ffyrdd a llwybrau cynhanesyddol.\nOherwydd eu bod yn fannau strategol pwysig, mae rhydau yn cael eu cysylltu â brywdrau mewn hanes sawl gwlad. Yn llenyddiaeth y gwledydd Celtaidd mae cael arwyr yn ymladd mewn rhyd neu'n agos iddi yn olygfa gyffredin, yn enwedig yn achos llenyddiaeth Wyddeleg. Mae gan rai o rydau Cymru arwyddocád arbennig yn nhraddodiad y canu darogan a'r brudiau fel lleoedd a gysylltir â brwydrau tyngedfennol.\nMae rhyd yn elfen gyffredin mewn enwau lleoedd yng Nghymru, sy'n adlewyrchu ei bwysigrwydd ym mywyd y wlad. Fel enghreifftiau gellid enwi Rhydaman a Rhydcymerau yn y de, Rhyd Ddu yn Eryri, ac ati. Yn aml roedd llwybrau o bentref i bentref yn defnyddio rhydau. Gellir gweld rhai o'r rhydau llai hyn wrth gerdded yn y bryniau.\nGorweddai rhai rhydau ar ffyrdd y porthmyn ac fe'i defnyddid i gael gyrroedd o wartheg dros afon. Ceir enghreifftiau o bentrefi a dyfodd yn ymyl rhydau gyda thafarnau a chyfleusterau eraill ar gyfer y porthmyn."
                    }
                ]
            },
            {
                "id": "ceredigion#rhyd-rosser",
                "name": "Rhyd-Rosser",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Rhyd-Rosser",
                    "_text": "Rhyd-Rosser is a hamlet in the community of Llanrhystud, Ceredigion, Wales, which is 68.5 miles (110.3km) from Cardiff and 178 miles (286.5km) from London. Rhydroser is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                }
            },
            {
                "id": "ceredigion#rhydlewis",
                "name": "Rhydlewis",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Rhydlewis",
                        "_text": "Rhydlewis is a small inland village in Ceredigion, Wales. It is situated in an agricultural area with pasture land, woods and low hills."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Rhydlewis",
                        "_text": "Pentref gwledig yn ne Ceredigion yw Rhydlewis. Mae'n rhan o gymuned Troedyraur. Fe'i lleolir tua 10 milltir i'r dwyrain o Aberteifi ger Ffostrasol.\nCeir Capel Twrgwyn ger y pentref, un o achosion hynaf y Methodistiaid yn y sir, lle codwyd y capel cyntaf yn 1749.\nCafodd y nofelydd Caradoc Evans ei fagu yn y pentref."
                    }
                ]
            },
            {
                "id": "ceredigion#rhydowen",
                "name": "Rhydowen",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Rhydowen",
                        "_text": "Rhydowen is a small village in Ceredigion in south-west Wales.\nIt has a population of about 347, of which around 200 are Welsh-speaking.\nThe village hall, established in 1917, has been recently demolished, despite local protest. The hall, declared derelict in 1973 after falling into disrepair due to lack of use, or indeed maintenance, had undergone several attempts at restoration; but any future efforts were deemed too costly."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Rhydowen",
                        "_text": "Gallai Rhydowen gyfeirio at:\nRhydowen, Ceredigion\nRhydowen, Sir Gaerfyrddin"
                    }
                ]
            },
            {
                "id": "ceredigion#rhydyfelin",
                "name": "Rhydyfelin",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Rhydyfelin",
                        "_text": "Rhydyfelin (Welsh pronunciation: [r̥ɨdəˈvɛlɪn], Mill Ford) is a large village and part of the community of Pontypridd, a town about two miles to its north west, in the county borough of Rhondda Cynon Taf. It is on the eastern bank of the River Taff close to the A470, and historically was in the parish of Eglwysilan.\nRhydyfelin grew from a rural hamlet to a thriving village in the 19th century, due to its location on the Glamorganshire Canal which took iron from Merthyr Tydfil to the city of Cardiff, and linking to this Dr. Richard Griffiths' canal and tramway which took coal from the Rhondda Valleys. Also of note was the nearby Iron and Tin works at Treforest. Other minor works included an ironworks on the site of the tram shed buildings.\nNeighbouring villages are Hawthorn, Treforest and Glyntaff. The village is split into two electoral wards: the lower largely historic part of the village is in Hawthorn ward along with the settlement of Upper Boat which comprises some of the nearby Treforest Estate, while the largely modern housing estates of upper Rhydyfelin are in the ward of Rhydyfelen Central and Ilan. Rhydyfelin is also known as Rhydfelen, which means Yellow ford in the Welsh language.\nRhydyfelin was once served by two railway stations- one on the Cardiff Railway, and one on the Pontypridd, Caerphilly and Newport Railway. After the Grouping, the former Cardiff Railway halt became Rhydyfelin Low Level Halt and the halt of the Pontypridd, Caerphilly and Newport Railway became Rhydyfelin High Level Halt. The halts closed in 1931 and 1953 respectively."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Rhydyfelin",
                        "_text": "Gall Rhydyfelin gyfeirio at un o ddau bentref yng Nghymru:\nRhydyfelin, Ceredigion\nRhydyfelin, Rhondda Cynon Taf\nRhydyfelin, Powys"
                    }
                ]
            },
            {
                "id": "ceredigion#salem",
                "name": "Salem",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Salem",
                        "_text": "Salem often refers to:\nSalem, Massachusetts, a city in the U.S. state of Massachusetts\nSalem witch trials of 1692, which took place there\n\nSalem, Oregon, the capital of the U.S. state of Oregon\nSalem, Tamil Nadu, a city in India\nSalem (name), people with the name\nSalem may also refer to:"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Salem",
                        "_text": "Enw o'r Beibl ydy Salem.\nGweler Salem (cyfeiriad Beiblaidd) ((sa'lem) Hebraeg am \"heddwch\")"
                    }
                ]
            },
            {
                "id": "ceredigion#sarnau",
                "name": "Sarnau",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Sarnau",
                    "_text": "Gallai (Y) Sarnau gyfeirio at un o sawl lle:\nSarnau, Gwynedd, pentref ger y Bala\nSarnau, Maldwyn, pentref yng ngogledd Powys\nSarnau, Brycheiniog, pentref arall o'r un enw yn ne Powys\nSarnau, Ceredigion, pentref yn ne Ceredigion\nSarnau, Sir Gaerfyrddin\nGweler hefyd:\nSarn (gwahaniaethu)"
                }
            },
            {
                "id": "ceredigion#silian",
                "name": "Silian",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Silian",
                    "_text": "Pentref yn Nyffryn Aeron, Ceredigion yw Silian, neu Sulien yn hanesyddol. Lleolir tua dwy filltir i'r gogledd-ddwyrain o Lanbedr Pont Steffan, ar lôn gefn hanner ffordd rhwng Pont Creuddun ar yr A482, a Glan Denys ar yr A485.\nMae hefyd yn enw ar blwyf yr ardal, a gymerir ei enw o'r un sant a cysegrwyd eglwys y pentref iddo, sef Sant Sulien. Adeiladwyd Capel Bethel yn Silian ym 1654, ac adneyddwyd ym 1952.\nGanwyd Julian Cayo-Evans, y Cenedlaetholwr Cymreig ac arweinydd Byddin Rhyddid Cymru, yn Silian ym 1937.\nMae papur bro Llais Aeron yn gwasanethu'r ardal. Lleolir sawl llety hunan-arwyo a gwely a brecwast yn y pentref, gan ei fod wedi'i leoli yn gyfleus i ymweld a ardal Llanbedr Pont Steffan yn ogystal â threfi Aberaeron ac Aberystwyth gerllaw."
                }
            },
            {
                "id": "ceredigion#southgate",
                "name": "Southgate",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Southgate",
                        "_text": "Southgate, South Gate or SouthGate may refer to:"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Southgate",
                        "_text": "Gallai Southgate gyfeirio at un o sawl lle neu beth:\nCymru\nSouthgate, Abertawe\nSouthgate, Ceredigion\nSouthgate, Llundain"
                    }
                ]
            },
            {
                "id": "ceredigion#st dogmaels",
                "name": "St Dogmaels",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/St Dogmaels",
                    "_text": "St Dogmaels (Welsh: Llandudoch) is a village and community in Pembrokeshire, Wales, on the estuary of the River Teifi, a mile downstream from the town of Cardigan in neighbouring Ceredigion. A little to the west of the village, further along the estuary, lies Poppit Sands beach."
                }
            },
            {
                "id": "ceredigion#staylittle",
                "name": "Staylittle",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Staylittle",
                    "_text": "Staylittle (Welsh: Penffordd lâs), sometimes referred to colloquially as Y Stay or Y Stae, is a small village set in the shallow upland basin of the River Clywedog on the B4518 road, equidistant from Llanidloes and Llanbrynmair in the county of Powys, Wales."
                }
            },
            {
                "id": "ceredigion#strata florida",
                "name": "Strata Florida"
            },
            {
                "id": "ceredigion#swyddffynnon",
                "name": "Swyddffynnon",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Swyddffynnon",
                        "_text": "Swyddffynnon is a village in Ceredigion, Wales, situated 6 km to the north of Tregaron, near the northern edge of Cors Caron (Tregaron Bog). Swyddffynnon lies within the parish of Lledrod Uchaf ([English]: Upper LLedrod).\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Swyddffynnon",
                        "_text": "Pentref bychan yng nghanolbarth Ceredigion yw Swyddffynnon. Saif tua 5 milltir i'r gogledd o Dregaron, milltir i'r de o Ystrad Meurig a thua 2 filltir a hanner i'r gorllewin o Bontrhydfendigaid. Rhed afon Teifi heibio i'r pentref.\nCeir Capel y Bedyddwyr yn y pentref, sydd ymhlith yr hynaf yn y sir.\nBu gan y pentref ysgol gynradd ffyniannus - Ysgol Gymunedol Swyddffynnon - a agorwyd yn 1896 ond a gaewyd yn 2006."
                    }
                ]
            },
            {
                "id": "ceredigion#synod inn",
                "name": "Synod Inn",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Synod Inn",
                    "_text": "Pentref yn ne Ceredigion yw Synod Inn. Fe'i lleolir ar groesffordd yr A487 a'r A486 tua 5 milltir i'r de o Geinewydd a tua 7 milltir i'r de-orllewin o Aberaeron.\nLleolir Ysgol Bro Siôn Cwilt gerllaw, a gymerodd le hen ysgol Ysgol Gynradd Gwenlli yn y pentref yn 2010."
                }
            },
            {
                "id": "ceredigion#tal-sarn",
                "name": "Tal-sarn"
            },
            {
                "id": "ceredigion#tal-y-bont",
                "name": "Tal-y-bont",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Tal-y-bont",
                    "_text": "Mae Tal-y-bont (neu Talybont) yn enw lle cyffredin yng Nghymru:\nTal-y-bont, un o ddau gwmwd hen gantref Meirionnydd, de Gwynedd\nEnw ar bentrefi:\nTal-y-bont, Ceredigion\nTal-y-bont, Conwy,\nTalybont, Bangor, Gwynedd\nTalybont, Abermaw, Gwynedd\nTalybont-ar-Wysg, Powys\nTal-y-bont, Maldwyn, Powys\nEnghreifftiau eraill:\nArgae Talybont\nNeuadd Breswyl Llys Talybont, Maendy, Caerdydd"
                }
            },
            {
                "id": "ceredigion#talgarreg",
                "name": "Talgarreg",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Talgarreg",
                        "_text": "Talgarreg is a small village in the county of Ceredigion, Wales.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Talgarreg",
                        "_text": "Pentref yn sir Ceredigion yw Talgarreg. Fe'i lleolir yn ne'r sir ar groesffordd ar y B4459, tua hanner ffordd rhwng y Ceinewydd a Llandysul.\nGorwedd Talgarreg ym mhlwyf eglwysig Llanarth. Llifa Afon Clettwr heibio i'r pentref ar ei ffordd i ymuno ag Afon Teifi tua 7 milltir i'r de. 'Tir Dyffryn Clettwr' yw'r enw traddodiadol am yr ardal.\nMae Talgarreg yn bentref Cymraeg ei hiaith o hyd, gyda'r mwyafrif yn siarad yr iaith. Ffermio defaid yw'r diwydiant lleol pwysicaf.\nGefeillir ysgol y pentref a Skol Diwan, Guingamp, yn Llydaw."
                    }
                ]
            },
            {
                "id": "ceredigion#tan-y-groes",
                "name": "Tan-y-groes",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Tan-y-groes",
                        "_text": "Tan-y-groes is a hamlet in the community of Penbryn, Ceredigion, Wales, which is 71.9 miles (115.7km) from Cardiff and 191.8 miles (308.6km) from London. Tan-y-groes is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Tan-y-groes",
                        "_text": "Pentrefan yng nghymuned Penbryn, Ceredigion, Cymru yw Tan-y-groes, sydd 71.9 milltir (115.7 km) o Gaerdydd a 191.8 milltir (308.6 km) o Lundain.\n\nCynrychiolir Tan-y-groes yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                    }
                ]
            },
            {
                "id": "ceredigion#temple bar",
                "name": "Temple Bar",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Temple Bar",
                        "_text": "Temple Bar may refer to:\nTemple Bar, London, a spot in London\nTemple Bar, Dublin, a cultural quarter in Dublin\nTemple Bar TradFest, a traditional Irish music and cultural festival at the location above\nTemple Bar Gallery and Studios, at the location above\n\nTemple Bar, Lake Mead, a site on the Arizona side of Lake Mead\nTemple Bar Marina, a marina on Lake Mead in the U.S. state of Arizona\nTemple Bar Airport, airport at the location above\n\nTemple Bar, Ceredigion, a village in Ceredigion, Wales\nTemple Bar (magazine), a British literary magazine published 1860 to 1906\nMory's or \"Mory's Temple Bar\", a private club in New Haven, Connecticut near the Yale campus"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Temple Bar",
                        "_text": "Gall Temple Bar gyfeirio at:\nTemple Bar (Llundain)\nTemple Bar (Dulyn)\nTemple Bar (Ceredigion)\nTemple Bar Magazine, cylchgrawn llenyddol Prydeinig a gyhoeddwyd o 1860 hyd 1906"
                    }
                ]
            },
            {
                "id": "ceredigion#trawsnant",
                "name": "Trawsnant",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Trawsnant",
                        "_text": "Trawsnant is a hamlet in the community of Llanrhystud, Ceredigion, Wales, which is 67.8 miles (109.1km) from Cardiff and 177.5 miles (285.7km) from London. Trawsnant is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Trawsnant",
                        "_text": "Pentrefan yng nghymuned Llanrhystud, Ceredigion, Cymru yw Trawsnant, sydd 67.8 milltir (109.1 km) o Gaerdydd a 177.5 milltir (285.7 km) o Lundain.\n\nCynrychiolir Trawsnant yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#tre taliesin",
                "name": "Tre Taliesin",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Tre Taliesin",
                    "_text": "Pentref yn ardal Genau'r Glyn, gogledd Ceredigion, yw Tre Taliesin. Lleolir y pentref ar y briffordd A487, tua hanner ffordd rhwng Machynlleth i'r gogledd-ddwyrain ac Aberystwyth i'r de. Y pentrefi agosaf yw Tal-y-bont i'r de a phentref bychan Llangynfelyn, hanner milltir i'r gorllewin. Mae Tre Taliesin ei hun yn rhan o blwyf a chymuned Llangynfelyn."
                }
            },
            {
                "id": "ceredigion#trefechan",
                "name": "Trefechan"
            },
            {
                "id": "ceredigion#trefenter",
                "name": "Trefenter",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Trefenter",
                    "_text": "Pentref bychan yng nghanolbarth Ceredigion yw Trefenter (Cyf. OS SN605685). Saif i'r de o bentref Llangwyryfon, ychydig i'r dwyrain o'r ffordd B4576 ac i'r gorllewin o'r briffordd A485. I'r de-ddwyrain o'r pentref mae llethrau Y Mynydd Bach, ac i'r de mae Llyn Eiddwen.\nCeir yma olion safle amlffosog o'r Canol Oesoedd, sef Ffos Trefenter, sy’n heneb gofrestredig.\nYn yr ardal yma y bu'r hyn a elwir yn Rhyfel y Sais Bach yn 1819, pan brynodd Sais o'r enw Augustus Brackenbury stad yno a dechrau cau'r tiroedd comin. Bu gwrthwynebiad cryf gan y trigolion lleol, a llosgwyd dau dŷ a adeiladwyd gan Brackenbury. Adeiladodd drydydd tŷ a rhoi'r enw \"Cofadail Heddwch\" arno. Yn fuan wedyn, gadawodd yr ardal.\nCodwyd Ysgol breswyl Cofadail yn y pentref yn 1877 gyda lle i dros gant o ddisgyblion.\nAr y Mynydd Bach, mae cofeb i bedwar bardd o'r ardal: T. Hughes Jones, B.T. Hopkins, J. M. Edwards ac Edward Prosser Rhys."
                }
            },
            {
                "id": "ceredigion#trefilan",
                "name": "Trefilan",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Trefilan",
                    "_text": "Pentref bychan gwledig yn ne canolbarth Ceredigion yw Trefilan. Mae'n gorwedd ar lan ogleddol afon Aeron tua 7 milltir i'r dwyrain o Aberaeron, ar yr hen ffordd rhwng Llanrhystud i'r gogledd a Llanbedr Pont Steffan i'r de-ddwyrain. Mae'n bosibl fod yr enw yn dwyn cysylltiad â Sant Ilan, sefydlydd Eglwys Ilan ym Morgannwg.\nGer ysgol y pentref ceir safle Castell Trefilan, castell mwnt a beili a godwyd gan dywysogion Deheubarth yn y 1230au.\nTua milltir i'r de o Drefilan ceir safle tybiedig lleiandy Sistersaidd Llanllŷr."
                }
            },
            {
                "id": "ceredigion#treforgan",
                "name": "Treforgan",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Treforgan",
                    "_text": "Treforgan (Welsh: \"Morgan's place\") is a small village in the community of Llangoedmor, Ceredigion, Wales, which is 74.7 miles (120.2 km) from Cardiff and 196.3 miles (315.8 km) from London. Treforgan is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\n\n"
                }
            },
            {
                "id": "ceredigion#tregaron",
                "name": "Tregaron",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Tregaron",
                        "_text": "Tregaron is a market town in the county of Ceredigion, Wales, lying on the River Brenig (also Brennig), a tributary of the River Teifi. The town is twinned with Plouvien, in Finistere, France. According to the 2011 Census, the population of the ward of Tregaron was 1,173 and 67% of the population could speak Welsh."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Tregaron",
                        "_text": "Tref fechan yng nghanolbarth Ceredigion yw Tregaron. Mae ganddi 1185 o drigolion, a 68% ohonynt yn siarad Cymraeg (Cyfrifiad 2001).\nGerllaw y dref ceir Cors Caron."
                    }
                ]
            },
            {
                "id": "ceredigion#tregroes",
                "name": "Tregroes",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Tregroes",
                        "_text": "Tregroes (Welsh: Tregroes, \"Settlement of the Cross\") is a hamlet in the community of Llandysul, Ceredigion, Wales, which is 64.1 miles (103.2km) from Cardiff and 183.6 miles (295.5km) from London. Tregroes is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Tregroes",
                        "_text": "Pentref a phlwyf yn Sir Benfro yw Tregroes (Saesneg: Whitchurch). Saif yng nghymuned Solfa. Saif ychydig i'r gogledd o bentref Solfa, tua 5 km i'r dwyrain o Dyddewi.\nGer porth mynwent yr eglwys, a gysegrir i Ddewi Sant, mae Maen Dewi, maen oedd ar un adeg, fe gredir, yn rhan o Groes Geltaidd fawr.\nMae'r plwyf yn cynnwys pentref Felinganol."
                    }
                ]
            },
            {
                "id": "ceredigion#tremain",
                "name": "Tremain",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Tremain",
                        "_text": "Tremain is a Cornish language surname. Notable people with the surname include:\nChris Tremain, New Zealand politician\nGarrick Tremain, New Zealand cartoonist and painter\nLyman Tremain, American politician\nRose Tremain, British historical novelist\nTremain Mack, American football player"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Tremain",
                        "_text": "Pentref bychan yn ne-orllewin Ceredigion yw Tremain. Fe'i lleolir ar y ffordd A487 tua 4 milltir i'r dwyrain o Aberteifi, rhwng Penparc a Blaenannerch.\nCysegrir yr eglwys leol i Sant Mihangel a'r Holl Angylion."
                    }
                ]
            },
            {
                "id": "ceredigion#tresaith",
                "name": "Tresaith",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Tresaith",
                    "_text": "Tresaith (otherwise Tre-saith) is a coastal village in the Welsh county of Ceredigion.\nTresaith is between Aberporth and Llangranog; it is linked to the former by a two-mile coastal path. Situated in West Wales, Tresaith is part of the Ceredigion Heritage Coastline which – although not as well known as the Pembrokeshire Coast National Park – offers similar walking and views. There is an abundance of wildlife and flora. Many kinds of seabirds can be spotted and regular sightings of grey seals and dolphins are made.\n\n"
                }
            },
            {
                "id": "ceredigion#trisant",
                "name": "Trisant"
            },
            {
                "id": "ceredigion#troedrhiwffenyd",
                "name": "Troedrhiwffenyd",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Troedrhiwffenyd",
                        "_text": "Troedrhiwffenyd is a hamlet in the community of Llandysul, Ceredigion, Wales, which is 63.2 miles (101.7km) from Cardiff and 183.2 miles (294.8km) from London. Troedrhiwffenyd is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Troedrhiwffenyd",
                        "_text": "Pentrefan yng nghymuned Llandysul, Ceredigion, Cymru yw Troedrhiwffenyd, sydd 63.2 milltir (101.7 km) o Gaerdydd a 183.2 milltir (294.8 km) o Lundain.\n\nCynrychiolir Troedrhiwffenyd yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                    }
                ]
            },
            {
                "id": "ceredigion#troedyraur",
                "name": "Troedyraur",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Troedyraur",
                    "_text": "Pentref bychan a chymuned yn ne Ceredigion yw Troedyraur neu Troed-yr-aur. Saif ar ffordd gefn i'r gogledd o dref Castell Newydd Emlyn. Mae'r gymuned hefyd yn cynnwys pentrefi Rhydlewis, Ffostrasol, Brongest, Capel Cynon, Coed-y-bryn, Croes-lan, Penrhiwpâl a Llangynllo.\nCeir yma fryngaer Dinas Cerdin ac adfail plasdy Bronwydd. Poblogaeth y gymuned yn 2001 oedd 1,408."
                }
            },
            {
                "id": "ceredigion#ty-newydd",
                "name": "Ty-Newydd"
            },
            {
                "id": "ceredigion#tynewydd",
                "name": "Tynewydd",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Tynewydd",
                        "_text": "Tynewydd is a village located in the County Borough of Rhondda Cynon Taf, south Wales. With Treherbert, Blaencwm, Blaenrhondda and Pen-yr-englyn it is part of a community of Treherbert. The village lies in the former industrial coal mining area at the head of Rhondda Fawr, the larger of the Rhondda Valleys."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Tynewydd",
                        "_text": "Pentref bychan yn Rhondda Cynon Taf yw Tynewydd. Mae'n gorwedd yn rhan uchaf Cwm Rhondda ger Blaencwm."
                    }
                ]
            },
            {
                "id": "ceredigion#tynygraig",
                "name": "Tynygraig",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Tynygraig",
                    "_text": "Pentrefan yng nghymuned Ystrad Meurig, Ceredigion, Cymru yw Tynygraig, sydd 65.3 milltir (105.2 km) o Gaerdydd a 170.7 milltir (274.8 km) o Lundain.\n\nCynrychiolir Tynygraig yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                }
            },
            {
                "id": "ceredigion#upper borth",
                "name": "Upper Borth",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Upper Borth",
                    "_text": "Upper Borth is a small village in Ceredigion, west Wales."
                }
            },
            {
                "id": "ceredigion#waun fawr",
                "name": "Waun Fawr"
            },
            {
                "id": "ceredigion#wenallt",
                "name": "Wenallt",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Wenallt",
                    "_text": "Wenallt is a hamlet in the community of Trawsgoed, Ceredigion, Wales, which is 67.2 miles (108.1km) from Cardiff and 172.2 miles (277.2km) from London. Wenallt is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats).\n\n"
                }
            },
            {
                "id": "ceredigion#y ferwig",
                "name": "Y Ferwig",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Y Ferwig",
                        "_text": "Y Ferwig (sometimes spelled Verwig) is a small village and community about 2 to 3 miles from Cardigan, Wales.\n^ \"Community population 2011\". Retrieved 13 May 2015."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Y Ferwig",
                        "_text": "Pentref a chymuned yn ne Ceredigion yw Y Ferwig. Daw'r enw o'r Saesneg \"Berwick\", sy'n golygu \"graens lle tyfir barlys\".\nSaif ar ochr ogleddol aber Afon Teifi, i'r gogledd o dref Aberteifi. Cysegrir eglwys y plwyf i Sant Pedrog.\nMae'r gymuned hefyd yn cynnwys pentrefi Gwbert a Phen-y-parc ac Ynys Aberteifi. Roedd poblogaeth y gymuned yn 2001 yn 1,177."
                    }
                ]
            },
            {
                "id": "ceredigion#ynys tachwedd",
                "name": "Ynys Tachwedd",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ynys Tachwedd",
                        "_text": "Ynys Tachwedd is a hamlet in the community of Borth, Ceredigion, Wales, which is 80.5 miles (129.6km) from Cardiff and 180.5 miles (290.5km) from London. Ynys Tachwedd is represented in the National Assembly for Wales by Elin Jones (Plaid Cymru) and the Member of Parliament is Mark Williams (Liberal Democrats)."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ynys Tachwedd",
                        "_text": "Pentrefan yng nghymuned Y Borth, Ceredigion, Cymru yw Ynys Tachwedd, sydd 80.5 milltir (129.6 km) o Gaerdydd a 180.5 milltir (290.5 km) o Lundain.\n\nCynrychiolir Ynys Tachwedd yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                    }
                ]
            },
            {
                "id": "ceredigion#ynys-lochtyn",
                "name": "Ynys-Lochtyn"
            },
            {
                "id": "ceredigion#ynyslas",
                "name": "Ynyslas",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ynyslas",
                        "_text": "Ynyslas pronounced (ənɨ̞s-lɑs) according to the International Phonetic Alphabet (IPA), is a small Welsh village about 1.5 miles north of Borth and 8 miles north of Aberystwyth, within the county of Ceredigion. It is sandwiched between a long sandy beach in Cardigan Bay and the beach in the Dyfi Estuary. The area between the sea and the estuary beach is made up of the Ynyslas Sand Dunes which are part of the Dyfi National Nature Reserve and home to many rare plants and animals. The sands of the estuary beach can be driven onto and parked upon. The nature reserve has a visitor centre with toilets and a small shop. At the start of some BBC 1 programmes it shows people flying kites on sand dunes and this was filmed at Ynyslas.\nThe northern end of the Ceredigion Coast Path extends to the Dyfi Estuary National Nature Reserve at Ynyslas."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ynyslas",
                        "_text": "Pentrefan yng nghymuned Y Borth, Ceredigion, Cymru yw Ynyslas, sydd 80.4 milltir (129.4 km) o Gaerdydd a 180.5 milltir (290.5 km) o Lundain.\n\nCynrychiolir Ynyslas yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol)."
                    }
                ]
            },
            {
                "id": "ceredigion#ysbyty cynfyn",
                "name": "Ysbyty Cynfyn",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Ysbyty Cynfyn",
                    "_text": "Pentrefan yng nghymuned Blaenrheidol, Ceredigion, Cymru yw Ysbyty Cynfyn, sydd 69.1 milltir (111.3 km) o Gaerdydd a 169.3 milltir (272.4 km) o Lundain.\n\nCynrychiolir Ysbyty Cynfyn yn y Cynulliad Cenedlaethol gan Elin Jones (Plaid Cymru) a'r Aelod Seneddol yw Mark Williams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                }
            },
            {
                "id": "ceredigion#ysbyty ystwyth",
                "name": "Ysbyty Ystwyth",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ysbyty Ystwyth",
                        "_text": "Ysbyty Ystwyth is a small village in Ceredigion, Wales 13 miles S.E.S. from Aberystwyth. Its church and the parish of the same name were the property of the Order of the Knights of the Hospital of St John of Jerusalem, hence the 'Ysbyty' in the title (Welsh for \"hospital\"), which never was (despite local belief) a hospice for travellers to Strata Florida.\n\n^ \"Community population 2011\". Retrieved 12 May 2015. \n^ Ceredigion, A Wealth of History"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ysbyty Ystwyth",
                        "_text": "Pentref gwledig yng Ngheredigion yw Ysbyty Ystwyth. Daw'r enw o'r gair Cymraeg Canol ysbyty \"hosbis, llety i deithwyr\" ac mae'n cyfeirio at un o 'ysbytai' Marchogion yr Ysbyty a sefydlwyd yno yn yr Oesoedd Canol.\nSaif y pentref bychan ar y lôn B4343 tua 12 milltir i'r dwyrain o Aberystwyth rhwng Pontrhydygroes a Pontarfynach i'r gogledd a Pontrhydfendigaid i'r de. Rhed afon Ystwyth heibio i ogledd y pentref.\nMae Ysgol Gynradd Ysbyty Ystwyth yn gwasanaethu cymunedau Ysbyty Ystwyth a'r cylch."
                    }
                ]
            },
            {
                "id": "ceredigion#ystrad aeron",
                "name": "Ystrad Aeron",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ystrad Aeron",
                        "_text": "Ystrad Aeron is a small village west of Felinfach on the A482 between Lampeter and Aberaeron in Ceredigion, west Wales, at a junction with the B4342 road that leads to Llanarth on the A487 near New Quay It has two pubs, a church, a garage and a caravan park.\nOne pub, the Vale of Aeron, was reportedly a favourite watering hole of Dylan Thomas when he lived in nearby Talsarn in the 1940s. The other, the Brynog Arms, pictured at lower right, was reported in 2009 to have been converted into use as a warehouse.\nThe old railway branch to Aberaeron ran through the villages and its station was at first named Ystrad and later Felin Fach. The station closed in 1951 and the line in 1973."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ystrad Aeron",
                        "_text": "Pentref bychan yn rhan isaf Dyffryn Aeron, de Ceredigion, yw Ystrad Aeron. Gorwedd ar lan ddeheuol afon Aeron tua 6 miltir i'r de-ddwyrain o Aberaeron, hanner ffordd rhwng y dref hwnnw a Llanbedr Pont Steffan. Rhed yr A482 rhwng y pentref.\nYn yr Oesoedd Canol sefydlwyd lleiandy Llanllŷr yno, ond does dim olion i'w gweld ohono heddiw ac mae ei leoliad yn ansicr."
                    }
                ]
            },
            {
                "id": "ceredigion#ystradmeurig",
                "name": "Ystradmeurig"
            },
            {
                "id": "ceredigion#ystumtuen",
                "name": "Ystumtuen",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ystumtuen",
                        "_text": "Ystumtuen is a small village in northern Ceredigion, Wales above the valley of the River Rheidol.\nIt is situated on rocks rich in lead and silver and during a lengthy period in the 18th and 19th centuries, Ystumtuen was a busy mining village. With the demise of the lead mining industry and in particular the closure of Cwm Rheidol mine, the population dwindled rapidly with the last ancestral population disappearing in the 1970s. This may in part have been due to the high lead content of the local spring sources. The village was re-populated for a time in the 1970s by hippy communities, and in recent years the population has been steadily increasing."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ystumtuen",
                        "_text": "Pentref bychan yng ngogledd Ceredigion yw Ystumtuen. Fe'i lleolir tua 10 milltir i'r dwyrain o Aberystwyth, yn y bryniau rhwng Ponterwyd a Phontarfynach. Mae'n rhan o gymuned Blaenrheidol, gyda Ponterwyd.\nCyfeiria enw'r pentref at dro (sef ystum) yn Afon Tuen, nant sy'n codi ar gwr y pentref yn Llyn yr Oerfa. Llifa'r nant honno i Afon Rheidol hanner milltir i'r de o'r pentref. Cynigia'r arbenigwr ar enwau afonydd Cymru R. J. Thomas \"nant yn rhedeg hyd lechwedd serth\" fel ystyr yr enw Tuen (o'r bôn tu- \"ochr\", cf. 'tuedd')."
                    }
                ]
            }
        ]
    }
}