{
    "id": "Neath Port Talbot",
    "population": {
        "href": {

        },
        "_text": {

        }
    },
    "poscodes": {
        "postcode": [
            "SA10",
            "SA11",
            "SA12",
            "SA13",
            "SA18",
            "SA8",
            "SA9"
        ]
    },
    "towns": {
        "town": [
            {
                "id": "neath port talbot#aberavon",
                "name": "Aberavon",
                "lat": "51.5946799",
                "lon": "-3.784097",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Aberavon",
                    "_text": "Aberavon (Welsh: Aberafan) is a settlement in Neath Port Talbot county borough, Wales. The town derived its name from being near the mouth of the river Afan, which also gave its name to a medieval lordship. Today it is essentially a district of Port Talbot, covering the central and south western part of the town. Aberavon is also the name of the nearby Blue Flag beach and the parish covering the same area.\n^ ONS: Key Figures for 2001 Census: Census Area Statistics"
                }
            },
            {
                "id": "neath port talbot#abercregan",
                "name": "Abercregan",
                "lat": "51.656663",
                "lon": "-3.665335",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Abercregan",
                    "_text": "Abercregan is a village in the Welsh county borough of Neath Port Talbot, Glamorgan. It is situated around 12 kilometres (7.5 mi) north-east of Port Talbot and just west of Cymmer, and is also close to the River Afan. Abercregan was once a thriving mining community but since the decline of the British coal industry, much of the housing has been demolished and most of its inhabitants have moved to neighbouring villages. The 1980s and 1990s saw the closure of the village school, the boys club, post office and the last remaining shop 1989. The local authority decided to turn the school into a Field Study Centre, which was later closed and relocated to Margam Park. The building was demolished following the closure.\nNow a small village of around 30 houses, Abercregan is in surroundings which have returned to their former pre-industrial rural condition. Abercregan is within the boundaries of the Afan Forest Park which is a joint venture between Forest Enterprise, the Local Authority and local businesses which provide for and promote green tourism in the area. Following campaigning by local residents, Abercregan is now home to the only designated village green in the Neath Port Talbot area.\nAbercregan United Football Club, nicknamed 'The Shire', has a proud history winning many league titles and cups since its formation. The club folded following a merger with local rivals Cymmer Refresh but was reformed at the start of the 2014-15 season. They now play in the Premier Division of the Port Talbot & District Football League. Home matches were originally played on the Riverside Ground in Abercregan which was condemned by the local council in 2006. Home matches are now played at the Red Field in Cymmer.\nThe former football changing rooms in Abercregan, which had previously been the village chapel, was purchased and is now being used as a place of worship again by the Afan Christian Fellowship."
                }
            },
            {
                "id": "neath port talbot#aberdulais",
                "name": "Aberdulais",
                "lat": "51.681848",
                "lon": "-3.775361",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Aberdulais",
                        "_text": "Aberdulais (Welsh: Aberdulais Aber confluence (with the River Neath) or mouth (of the river) & Dulais) is a village in Neath Port Talbot, Wales, lying on the River Neath. The village grew around the Aberdulais Falls, the site of successive industries and now a hydro-electric station.\n^ \"Ward population 2011\". Retrieved 11 April 2015."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Aberdulais",
                        "_text": "Pentref ym mwrdeistref sirol Castell-nedd Port Talbot yw Aberdulais. Saif ym mhen isaf Cwm Dulais, lle mae Afon Dulais yn llifo i mewn i Afon Nedd, a ger cyffordd y priffyrdd A465 ac A4109, i'r gogledd-ddwyrain o dref Castell Nedd.\nFel mae'r Dulais yn agosau at afon Nedd, mae'n disgyn i raeadr ysblenydd Rhaeadrau Aberdulais, atyniad twristiaeth poblogaidd a safle hen weithfeydd haearn. Mae'r rhaeadr yn eiddo i'r Ymddiriedolaeth Genedlaethol."
                    }
                ]
            },
            {
                "id": "neath port talbot#abergarwed",
                "name": "Abergarwed",
                "lat": "51.7073633",
                "lon": "-3.714324",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Abergarwed",
                    "_text": "Abergarwed is a village in the Welsh county borough of Neath Port Talbot, south Wales.\nIt is located in the Vale of Neath near the town of Neath.\n\n"
                }
            },
            {
                "id": "neath port talbot#abergwynfi",
                "name": "Abergwynfi",
                "lat": "51.653032",
                "lon": "-3.600475",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Abergwynfi",
                        "_text": "Abergwynfi is a village in the Welsh county borough of Neath Port Talbot.\nAbergwynfi is the first half of a village of two parts, the other being Blaengwynfi. The names of the two villages mean \"Mouth of the Gwynfi\" and \"Source of the Gwynfi\" respectively, the Gwynfi being the (rather short) river that separates the two.\nAber and Blaengwynfi are generally referred to as \"The Cape\" by residents of the two villages and the neighbouring few. This term comes from when the villages were marketed as \"The Cape of Good Hope\" during the years when coal mining was very important to the valleys.\nAbergwynfi is located within the Afan Forest Park which is a popular mountain bike centre.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Abergwynfi",
                        "_text": "Pentref bychan yn sir Castell-nedd Port Talbot yw Abergwynfi. Fe'i lleolir ar y briffordd A4107 rhwng Treorci a Port Talbot. Mae'n rhan o blwyf eglwysig Glyncorrwg."
                    }
                ]
            },
            {
                "id": "neath port talbot#afan",
                "name": "Afan",
                "lat": "51.5999153",
                "lon": "-3.8072832",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Afan",
                        "_text": "Afan may refer to:\nRiver Afan or Avon or Avan, a river in southwest Wales\nSaint Afan (Welsh: Sant Afan Buellt), Welsh bishop and saint of the 6th century\nAfan, Wales\nAfan (trail)\nAfan, Iran, a village in Mangur-e Sharqi Rural District, Khalifan District, Mahabad County, West Azerbaijan Province, Iran"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Afan",
                        "_text": "Gallai Afan gyfeirio at un o sawl peth:\nPobl:\nAfan, sant o'r 6ed ganrif\nAfan Ferddig, bardd cynnar\nArglwyddi Afan, arglwyddi canoloesol yn ne Cymru\nLleoedd:\nAfon Afan, afon yn ne Cymru\nCwm Afan, cwm yn ne Cymru\nCwmafan, pentref yn ne Cymru\nLlanafan, Ceredigion\nLlanafan Fawr, Brycheiniog\nArall:\nAfan FM"
                    }
                ]
            },
            {
                "id": "neath port talbot#alltwen",
                "name": "Alltwen",
                "lat": "51.714108",
                "lon": "-3.843856",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Alltwen",
                        "_text": "Alltwen (or Allt-wen) – meaning \"white wooded slope\" – is a village in the county borough of Neath Port Talbot, Wales, near Pontardawe in the Swansea Valley. Alltwen is served by Alltwen Primary School and is home to rugby union club Alltwen RFC."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Alltwen",
                        "_text": "Am y bryn yn Sir Conwy gweler Yr Alltwen.\nMae'r Alltwen (hefyd: Allt-wen) yn bentref bychan ger Pontardawe, Castell-nedd Port Talbot, yn ne Cymru. Saif ar lethrau dwyreiniol Cwm Tawe.\nMagwyd y bardd Gwenallt yn y pentref, a chymerodd ei enw barddol o enw'r pentref. Roedd yr actores Rachel Thomas yn enedigol o Allt-wen."
                    }
                ]
            },
            {
                "id": "neath port talbot#baglan",
                "name": "Baglan",
                "lat": "51.619954",
                "lon": "-3.814203",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Baglan",
                        "_text": "Baglan may refer to:"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Baglan",
                        "_text": "Gallai Baglan gyfeirio at:\nBaglan, sant Cymreig o'r 6ed ganrif a gysylltir â Llanfaglan, Gwynedd\nBaglan, pentref ym mwrdeistref sirol Castell-nedd Port Talbot"
                    }
                ]
            },
            {
                "id": "neath port talbot#blaengwrach",
                "name": "Blaengwrach",
                "lat": "51.734268",
                "lon": "-3.636369",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Blaengwrach",
                    "_text": "Blaengwrach (\/blaɪn.ˈɡrɑːx\/ blyn-GRAHKH) is a village near Glynneath and Resolven in the county borough of Neath Port Talbot, Wales. It is also the name of a community and an electoral ward of Neath Port Talbot county borough. There are, however, some differences between the boundaries of the community and the ward. The ward had a population of 1,985 in the 2001 census, but 837 of these were actually residents of the neighbouring community of Glynneath and so the population of the Blaengwrach community itself would have been 1,148.The ward population at the census 2011 was practically unchanged.\nBlaengwrach is a predominantly upland area, and contains the highest points of three local hills or mountains, namely Mynydd Resolfen (383mt\/1257 ft) and the rather more impressive Mynydd Pen-y-Cae (573mt\/1880 ft) and Craig-y-Llyn (600mt\/1970 ft), both of which offer spectacular views of the valley below and the Brecon Beacons in the distance. Craig-y-Llyn is the highest point in the old county of Glamorgan, and is home to a nature reserve containing Llyn Fach and a Site of Special Scientific Interest. West of the summit is Foel Chwern Round cairn.\nThe village of Blaengwrach is often confused with the settlement of Cwmgwrach. Traditionally, the two are settlements separated by a stream or brook running through the middle of them. However, the sign welcoming you to Cwmgwrach is actually in Blaengwrach, and in similar fashion, Blaengwrach school is actually in Cwmgwrach, although this could be explained by its being named after the wider ward. In reality the residents call the entire village Cwmgwrach, with Blaengwrach being best used as the name for the wider area in which the village is situated. A history of the village (Cwmgwrach: Valley of the Witch) was written by Ian Currie.\nIn May 2013, North Bank Entertainment announced that it would soon commence filming of a film called 'Valley of the Witch' which will be an 18 rated horror film based on a true story about events in Cwmgwrach. Filming is due to take place before the end of 2013 on location in Cwmgwrach.\nThe village itself contains various local shops, pubs and a rugby union club, Cwmgwrach RFC. However, for wider services the village is largely dependent upon Glynneath.\nThe Neath and Tennant Canal has been restored and now has over four miles of walkable towpath between Resolven and Glynneath. The Vale of Neath Railway is still used for freight transport between Neath and Cwmgwrach."
                }
            },
            {
                "id": "neath port talbot#blaengwynfi",
                "name": "Blaengwynfi",
                "lat": "51.656898",
                "lon": "-3.603844",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Blaengwynfi",
                        "_text": "Blaengwynfi is a village in the Neath Port Talbot area of South Wales.\nIt is a part of the \"Upper Afan Valleys\". It used to be a coal mining village, and is directly below the village of \"Abergwynfi\". The River Afan flows from its source at the top of the nearby mountain through Aber\/Blaengwynfi.\nBlaengwynfi is also the home to local football team Gwynfi United."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Blaengwynfi",
                        "_text": "Pentref bychan yn sir Castell-nedd Port Talbot yw Blaengwynfi. Fe'i lleolir ychydig i'r gogledd o'r briffordd A4107 ger Abergwynfi, rhwng Treorci a Port Talbot. Mae'n rhan o blwyf eglwysig Glyncorrwg.\nTardda Afon Afan ger y pentref."
                    }
                ]
            },
            {
                "id": "neath port talbot#briton ferry",
                "name": "Briton Ferry",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Briton Ferry",
                    "_text": "Briton Ferry (Welsh: Llansawel) is a town and community in the county borough of Neath Port Talbot, Wales. The town encompasses the electoral wards of Briton Ferry East and Briton Ferry West.\nBriton Ferry is on the mouth of the River Neath where it enters Swansea Bay and was the first river crossing along the Roman road that followed the coastline along that part of South Wales. The river crossing was by ferry boat some 2 miles (3.2 km) from the bridge across the River Neath at Neath. At certain low tides it was possible to walk across the river via a ford close to the ferry route using stepping stones.\nThe town is served by Briton Ferry railway station.\nThere are remains of ancient stone age settlements on the hills above Briton Ferry, and two hillforts within the community, Buarth-y-Gaer and Gaer Fawr are on Mynydd-y-Gaer, alongside the boundary with Baglan. The town was part of the Briton Ferry Estate."
                }
            },
            {
                "id": "neath port talbot#brombil",
                "name": "Brombil",
                "lat": "51.5803809",
                "lon": "-3.7652014",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Brombil",
                    "_text": "Mynydd Brombil yw un o'r mynyddoedd tu ôl i dre Port Talbot. Mae'n cysylltu gyda Mynydd Margam ac mae pobol yn aml yn cymysgu'r ddau."
                }
            },
            {
                "id": "neath port talbot#bryn",
                "name": "Bryn",
                "lat": "51.6169859",
                "lon": "-3.7123799",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Bryn",
                        "_text": "Bryn (which is Welsh for hill) is a component ward of the Metropolitan Borough of Wigan, Greater Manchester, England. It is part of the larger town of Ashton-in-Makerfield and is geographically indistinguishable from it. It forms a separate local council ward. Served by Bryn railway station, Bryn is home to the Three Sisters Recreation Area which has been created from three large spoil tips which remain from Bryn's role in Lancashire's coal mining past. The Three Sisters Recreation Area is also the site of the Three Sisters Race Circuit, which provides race driving instruction and plays host to kart racing events and motorcycle road race meetings at clubman level.\nThe former Bryn (or Brynne) Hall was the seat of the Gerard family beginning in the thirteenth century or earlier. It was a \"safe house\" for the English Roman Catholic martyr and saint Edmund Arrowsmith and his hand was reportedly preserved there after his execution. The house, dating to the fourteenth century, has now completely collapsed and remaining stones been cleared.\nThe Unitarian Park Lane Chapel in Wigan Road was built in 1697, though its congregation was founded in 1662. It is the oldest Non-conformist chapel and congregation in the whole district. By the nineteenth century Park Lane was only one of nine non-conformist chapels in the heavily recusant area."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Bryn",
                        "_text": "Allt neu fynydd bychan yw bryn. Yn ogystal â bod yn elfen gyffredin iawn mewn enwau lleoedd ceir enghreifftiau ohono ar ben ei hun fel enw lle:\nCymru\nBryn (Bannau Brycheiniog); Cyfeirnod grid OS: SO073227\nBryn, Castell-nedd Port Talbot\nBryn, Llanelli\nBryn-y-Gefeiliau\nBryn-crug\nBryn Euryn\nBryn Iwan\nBryn Celli Ddu\nLlanfair-ar-y-bryn\nBryn Gwyn\nBrynrefail\nBryniau Clwyd\nLloegr\nBryn, Swydd Amwythig\nBryn, Wigan\nCyffredinol\nbryngaer\nEnw personol Cymraeg ydy Bryn, hefyd. Mae enghreifftiau o nod yn cynnwys:\nBryn Fôn\nBryn Terfel"
                    }
                ]
            },
            {
                "id": "neath port talbot#bryn coch",
                "name": "Bryn coch"
            },
            {
                "id": "neath port talbot#brynbryddan",
                "name": "Brynbryddan",
                "lat": "51.617952",
                "lon": "-3.7680309",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Brynbryddan",
                    "_text": "Mae Brynbryddan yn rhan o bentref Cwmafan sydd yng Nghastell-nedd Port Talbot, dair milltir o'r môr.\nMae'n debyg mai'r elfen 'Bryddan' sydd yn yr enw, o'r un tarddiad â'r elfen 'Britton' yn \"Britton Ferry\", enw Saesneg pentref Llansawel sydd dros y bryn yng Nghwm Nedd."
                }
            },
            {
                "id": "neath port talbot#cadoxton-juxta-neath",
                "name": "Cadoxton-Juxta-Neath",
                "lat": "51.673094",
                "lon": "-3.799281",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Cadoxton-Juxta-Neath",
                    "_text": "This is a redirect from a title that is another name such as a pseudonym, a nickname, or a synonym of the target, or of a name associated with the target. For more information follow the category link.\nThis redirect leads to the title in accordance with the naming conventions for common names and can help writing. It is not necessary to replace these redirected links with a piped link.\nIf this redirect is an incorrect name for the target, then use {{R from incorrect name}} instead."
                }
            },
            {
                "id": "neath port talbot#caerhendy",
                "name": "Caerhendy",
                "lat": "51.7608289",
                "lon": "-3.3641306"
            },
            {
                "id": "neath port talbot#castell-nedd (neath)",
                "name": "Castell-Nedd (Neath)"
            },
            {
                "id": "neath port talbot#cefn-bryn-brain",
                "name": "Cefn-bryn-brain",
                "lat": "51.80766",
                "lon": "-3.8231514",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cefn-bryn-brain",
                    "_text": "Pentref bychan yn Sir Gaerfyrddin yw Cefn-bryn-brain, weithiau Cefnbrynbrain a hefyd Cefn Bryn Brain. Saif ger ffîn ddwyreiniol Sir Gaerfyrddin, ychydig i'r gogledd o bentref mwy Cwmllynfell, gerllaw'r briffordd A4068. Mae yng nghymuned Cwarter Bach.\nMae'n ardal Gymraeg o ran iaith; roedd 83.29% o boblogaeth y gymuned yn medru rhywfaint o Gymraeg yn 2001."
                }
            },
            {
                "id": "neath port talbot#cerrig llwydion",
                "name": "Cerrig Llwydion"
            },
            {
                "id": "neath port talbot#cilfrew",
                "name": "Cilfrew",
                "lat": "51.688715",
                "lon": "-3.77951"
            },
            {
                "id": "neath port talbot#cilmaengwyn",
                "name": "Cilmaengwyn",
                "lat": "51.739978",
                "lon": "-3.822357",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cilmaengwyn",
                    "_text": "Pentref bychan yn sir Castell-nedd Port Talbot yw Cilmaengwyn. Fe'i lleolir ar lôn wledig uwchlaw Dyffryn Tawe tua 3 filltir i'r gogledd-ddwyrain o Bontardawe."
                }
            },
            {
                "id": "neath port talbot#cilybebyll",
                "name": "Cilybebyll",
                "lat": "51.7263506",
                "lon": "-3.8199325",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cilybebyll",
                        "_text": "Cilybebyll \/ˌkɪləˈbɛbɪl\/ is a village and community in Neath Port Talbot County Borough in Wales. It includes the villages of Alltwen, Fforest Gôch, Gellinudd and Rhos, and is located 1.9 miles (3.1 km) east of Pontardawe, 4.7 miles (7.6 km) north of Neath and 10.3 miles (16.6 km) north east of Swansea. The community has a population of 4,806.\nThe Cilybebyll estate was established in the 15th century, and after development by various families, by 1838 was recorded as having the largest land holding in the district. The main house, Plas Cilybebyll, was redeveloped in 1840 by Henry Leach, creating a south-facing Victorian facade on the property. His son Frances Edward Leach inherited the estate in 1848, changing his name to Lloyd in 1849 by Royal Charter in order not to forfeit his inheritance. The family remained in residence until the early 20th century, when the family records were passed to Swansea Museum. The main house today is a guest house."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cilybebyll",
                        "_text": "Pentref a chymuned ym mwrdeisdref sirol Castell-Nedd Port Talbot yw Cilybebyll. Saif i'r dwyrain o dref Pontardawe ac i'r gogledd o dref Castell-nedd, ac roedd y boblogaeth yn 2001 yn 4,806.\nHeblaw pentref Cilybebyll, mae'r gymuned yn cynnwys pentrefi Allt-wen, Rhos a Gelli-mudd. Magwyd y bardd Gwenallt yn Allt-wen, a chymerodd ei enw barddol o enw'r pentref.\nYm Medi 2011 cafwyd trychineb yng Nglofa Gleision, ger y pentref pan laddwyd pedwar glöwr lleol."
                    }
                ]
            },
            {
                "id": "neath port talbot#cimla",
                "name": "Cimla",
                "lat": "51.652769",
                "lon": "-3.792057",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Cimla",
                    "_text": "Cimla is a suburb of the town of Neath in the county borough of Neath Port Talbot, Wales. It is set high up on a hill. It is pronounced Kim-la. The Welsh language spelling is Cymla, pronounced the same way.\nThere are plans for proposed housing estates and log cabins to be built in the area."
                }
            },
            {
                "id": "neath port talbot#clyne",
                "name": "Clyne",
                "lat": "51.692308",
                "lon": "-3.734726",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Clyne",
                    "_text": "Clyne may refer to:\nClyne (surname) (includes listing for Clynes)"
                }
            },
            {
                "id": "neath port talbot#corlannau",
                "name": "Corlannau",
                "lat": "51.600185",
                "lon": "-3.779396"
            },
            {
                "id": "neath port talbot#craig llangiwg",
                "name": "Craig Llangiwg"
            },
            {
                "id": "neath port talbot#crynant",
                "name": "Crynant",
                "lat": "51.731322",
                "lon": "-3.74794",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Crynant",
                    "_text": "Crynant (or Welsh: Y Creunant) is a village in the Dulais Valley in Wales. It lies 7¾ miles north-east from the town of Neath in Neath Port Talbot, lying between the mountains of Mynydd Marchywel to the west, Hirfynydd to the east and Mynydd y Drum to the north.\nCrynant is a long village, lying on the narrow valley floor and lower slopes of Hirfynydd. Originally there were separate villages (essentially separate farms), such as the region of Treforgan, but all have now merged into a single village. The River Dulais flows through the village.\nCreunant is also the name of an electoral ward and a community, coterminous with the village, in Neath Port Talbot County Borough."
                }
            },
            {
                "id": "neath port talbot#cwm",
                "name": "Cwm",
                "lat": "51.742736",
                "lon": "-3.180782",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cwm",
                        "_text": "Cwm may refer to:\nCwm (landform), a rounded, glaciated valley, also known as a corrie or cirque\nCwm (software), a general-purpose data processor for the semantic web\nCwm railway station, a station in Cwm, Blaenau Gwent, Wales, 1852–1963\nCwm Rhondda, a famous Welsh hymn tune"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwm",
                        "_text": "Erthygl am y tirffurf yw hon. Am y pentref yn Sir Ddinbych, gweler Cwm, Sir Ddinbych. Am y pentref ym Mlaenau Gwent, gweler Cwm, Blaenau Gwent.\nTirffurf a geir yn y mynyddoedd a'r bryniau yw cwm.\n\nYn Ne Cymru, defnyddir y gair cwm bron yn gyfystyr â'r gair dyffryn yn y Gogledd, sef tirffurf is na thir cyfagos sy'n ffyrfio gwely i afon. Mae Y Cymoedd (Saesneg: The Valleys) yn tueddu i gyfeirio yn arbennig at gymoedd glofäol De Cymru - yn eu mysg Cwm Rhondda, Cwm Cynon, Cwm Afan. (Ond sylwer hefyd y defnyddir Glyn fel yn Glyn-Nedd, Glyn Ebwy).\nYng Ngogledd Cymru, mae cwm fel arfer yn golygu dyffryn crwn bychan sy'n crogi yn uchel ar ochr dyffryn siap-U, y naill a'r llall wedi ei ffurfio gan effeithiau rhewlifoedd ac yn dirffurf nodweddiadol o Eryri, er enghraifft Cwm Idwal (Glyderau, gwelwch lun) neu Gwm Cau (Cadair Idris).\nDefnyddir cwm hefyd fel term technegol yn Naearyddiaeth i ddisgrifio'r tirffurf rhewlifol ac yn gyfystyr\ni'r corrie yn yr Alban\nac i'r cirque yn de Ffrainc, neu combe yn nwyrain Ffrainc, gair Galeg tebyg iawn i'r gair Cymraeg.\nMae cwm yn un o'r ychydig eiriau Cymraeg a geir fel benthyceiriau yn yr iaith Saesneg. Yr enghraifft enwocaf efallai yw'r enw lle Western Cwm i ddynodi un o'r cymoedd uchel ar lethrau Everest yn yr Himalaya."
                    }
                ]
            },
            {
                "id": "neath port talbot#cwm-twrch isaf",
                "name": "Cwm-twrch Isaf"
            },
            {
                "id": "neath port talbot#cwm-twrch uchaf",
                "name": "Cwm-twrch Uchaf"
            },
            {
                "id": "neath port talbot#cwmafan",
                "name": "Cwmafan",
                "lat": "51.614044",
                "lon": "-3.766471",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cwmafan",
                        "_text": "This is a redirect from a page that has been moved (renamed). This page was kept as a redirect to avoid breaking links, both internal and external, that may have been made to the old page name. For more information follow the category link."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwmafan",
                        "_text": "Erthygl am bentref Cwmafan yw hon. Am y cwm gweler Cwm Afan. Gweler hefyd Afan (gwahaniaethu).\n\nPentref a chymuned yng Nghwm Afan, Castell-nedd Port Talbot, yw Cwmafan. Canol y pentref yw'r hen eglwys blwyf, 'Llanfihangel Ynys Afan'. Mae Brynbryddan ar y bryniau i'r gorllewin, ac Ynysygwas ar y bryniau i'r dwyrain. I'r de i lawr y cwm mae tref Porth Afan ac i'r gogledd, i lawr y cwm, mae pentref Pwllyglaw cyn cyrraedd pentref Pontrhydyfen."
                    }
                ]
            },
            {
                "id": "neath port talbot#cwmgwrach",
                "name": "Cwmgwrach",
                "lat": "51.7313959",
                "lon": "-3.644692"
            },
            {
                "id": "neath port talbot#cwmllynfell",
                "name": "Cwmllynfell",
                "lat": "51.8023359",
                "lon": "-3.824366",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Cwmllynfell",
                        "_text": "Cwmllynfell is the name of a village, community and electoral ward in Neath Port Talbot county borough, Wales.\n\n"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Cwmllynfell",
                        "_text": "Pentref yng Nghastell-nedd Port Talbot yw Cwmllynfell. Saif ar y briffordd A4068 rhwng Brynaman ac Ystalyfera, heb fod ymhell o Afon Twrch. Mae'r ward etholiadol yn cynnwys Blaen-nant, Bryn-Melyn, Celliwarog, Cwmllynfell a Rhiw-fawr.\nAgorwyd Glofa Cwmllynfell rywbryd cyn 1825, pan gofnodir i 59 o weithwyr gael eu lladd mewn ffrwydrad yno. Yn 1947 roedd yn cyflogi 360 o lowyr. Caeodd yn 1959. Hyd nes i'r lofa gau, cynhelid cyfarfodydd lleol Undeb Cenedlaethol y Glowyr yn Gymraeg."
                    }
                ]
            },
            {
                "id": "neath port talbot#cymer",
                "name": "Cymer",
                "lat": "51.651944",
                "lon": "-3.647563",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Cymer",
                    "_text": "Gallai Cymer gyfeirio at:\nCymer, enw am aber lle mae dwy afon yn ymuno â'i gilydd.\nCymer, pentref yng Nghwn Afan\nY Cymer, pentref a chymuned yn Nghwm Rhondda, Rhondda Cynon Taf\nAbaty Cymer, abaty yn ne Gwynedd"
                }
            },
            {
                "id": "neath port talbot#cynonville",
                "name": "Cynonville",
                "lat": "51.6436837",
                "lon": "-3.7003227"
            },
            {
                "id": "neath port talbot#duffryn",
                "name": "Duffryn",
                "lat": "51.5617097",
                "lon": "-3.0203503",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Duffryn",
                    "_text": "Duffryn (Welsh: Dyffryn) is a large housing estate [1] in the southwest of the city of Newport, south Wales comprising a large portion of the Tredegar Park electoral district (ward). Built on land belonging to Tredegar House [2], it was completed in 1978 and at the time won several awards for its design. The layout of the estate, as viewed from above, is that of large terraces undulating around a central wooded area. Originally a Council Estate, Duffryn is now a mix of private ownership and Newport City Homes RSL (Registered Social Landlord) properties.\nThe design of the estate is the result of a council competition. It was won by a consortium committed to the theories of planning devised in the architecture department of Cambridge University in the 1960s. The District Amenities Centre that was planned for the south-west corner of the 96-acre site was never built, so the plan of a largely self-sufficient community was not realised.\nDespite the relative recent development of the estate, the name Duffryn is an ancient name for the area. Duffryn is an anglicised version of the Welsh Dyffryn (meaning large U-shaped valley).\nDuffryn is home to two of Newport's largest secondary schools — Duffryn High School [3] and St. Joseph's RC High School. In 2006, Duffryn High School was the filming location of the Doctor Who episode \"School Reunion\", filmed in late-summer 2005.\nThe majority of the estate is heated from an updated central boiler house."
                }
            },
            {
                "id": "neath port talbot#dyffryn cellwen",
                "name": "Dyffryn Cellwen",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Dyffryn Cellwen",
                        "_text": "Dyffryn Cellwen is a village in the County Borough of Neath Port Talbot, South Wales. It is situated in the upper Dulais Valley near the junction of the A4109 and A4221 roads, northwest of the smaller settlement of Banwen. It is part of the community of Onllwyn.\nThe village stands close to the course of the Roman road from Neath to Brecon, and there are traces of a Roman fort and camp nearby. At one time, mining for iron, copper, and especially coal were important activities in the area."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Dyffryn Cellwen",
                        "_text": "Pentref ym mwrdeisdref sirol Castell-nedd Port Talbot yw Dyffryn Cellwen. Saif yn rhan uchaf Cwm Dulais, ger cyffordd y priffyrdd A4109 ac A4221, i'r gogledd-orllewin o bentref Banwen. Mae yng nghymuned Onllwyn.\nSaif y pentref ger y ffordd Rufeinig rhwng Castell Nedd ac Aberhonddu, ac mae olion caer a gwersyll Rhufeinig gerllaw. Ar un adeg roedd mwyngloddio glo, haearn a chopr yn bwysig yn yr ardal."
                    }
                ]
            },
            {
                "id": "neath port talbot#efail-fach",
                "name": "Efail-fach",
                "lat": "51.644232",
                "lon": "-3.754517",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Efail-fach",
                    "_text": "Pentref yn sir Castell-nedd Port Talbot yw Efail-fach (Efail-fâch ar fapiau Saesneg). Fe'i lleolir ar gyffordd ar y B4287, 3 milltir i'r de-ddwyrain o Gastell-nedd. Mae'r B4287 yn ei gysylltu â Chastell-nedd ac â Phont-rhyd-fen gyda ffordd arall o'r gyffordd yn ei gysylltu â pentref Ton-mawr i'r gogledd.\nMae Efail-fach yn rhan o gymuned Pelenna."
                }
            },
            {
                "id": "neath port talbot#fforest goch",
                "name": "Fforest Goch"
            },
            {
                "id": "neath port talbot#gelli-gaer",
                "name": "Gelli-gaer",
                "lat": "51.664336",
                "lon": "-3.251143",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Gelli-gaer",
                    "_text": "Pentref a chymuned ym mwrdeisdref sirol Caerffili yw Gelli-gaer, hefyd Gelligaer. Saif yng Nghwm Rhymni. Heblaw pentref Gelligaer ei hun, mae'r gymuned yn cynnwys pentrefi Cefn Hengoed a Hengoed.\nCeir caer Rufeinig yma, a adeiladwyd rhwng 103 a 111 OC. Bu cloddio archaeolegol ar y safle yn gynnar yn yr 20fed ganrif. Cysegrwyd eglwys y plwyf i sant Cadog neu Catwg."
                }
            },
            {
                "id": "neath port talbot#gellinud",
                "name": "Gellinud",
                "lat": "51.7215543",
                "lon": "-3.830401"
            },
            {
                "id": "neath port talbot#gellygron",
                "name": "Gellygron",
                "lat": "51.7256173",
                "lon": "-3.8582141"
            },
            {
                "id": "neath port talbot#glan-rhyd",
                "name": "Glan-rhyd",
                "lat": "51.766149",
                "lon": "-3.768295"
            },
            {
                "id": "neath port talbot#glyn castle",
                "name": "Glyn Castle"
            },
            {
                "id": "neath port talbot#glyn-neath",
                "name": "Glyn-neath",
                "lat": "51.74876",
                "lon": "-3.617823"
            },
            {
                "id": "neath port talbot#glyncorrwg",
                "name": "Glyncorrwg",
                "lat": "51.677721",
                "lon": "-3.628325",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Glyncorrwg",
                        "_text": "Glyncorrwg is a village in Wales. It is set in the Afan Valley, in southern Wales.\nGlyncorrwg is also the name of an electoral ward and a community covering the village and surrounding countryside, in Neath Port Talbot county borough. Glyncorrwg community contains the villages of Abergwynfi, Blaengwynfi, Croeserw, Cymmer, Abercregan, Duffryn and Glyncorwg itself. The population of Glyncorrwg as a community, was recorded as 5,544 in the 2001 census, reducing to 5,283 at the 2011 census. The population of the electoral ward mentioned above was 1,096 only at the 2011 census."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Glyncorrwg",
                        "_text": "Pentref mewn cwm bach sy'n ymestyn i'r gogledd o Gwm Afan yw Glyncorrwg. Mae'r nant Corrwg yn rhedeg trwy'r bentref ac i mewn i afon Afan.\nRoedd y pentref yn un glofaol ond gyda diwedd y diwydiant yn yr ardal mae'r economi lleol yn tueddu at atyniadau twristaidd, e.e. Afan Argoed."
                    }
                ]
            },
            {
                "id": "neath port talbot#goytre",
                "name": "Goytre",
                "lat": "51.5922437",
                "lon": "-3.7551551",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Goytre",
                    "_text": "Goytre is a village near the town of Port Talbot, south Wales.\nThe local football team is Goytre United F.C. who are based at Glenhafod Park Stadium."
                }
            },
            {
                "id": "neath port talbot#gurnos",
                "name": "Gurnos",
                "lat": "51.772591",
                "lon": "-3.779618",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Gurnos",
                    "_text": "Gurnos might also refer to Gurnos, Powys\nGurnos is a community of Merthyr Tydfil County Borough in Wales, United Kingdom. It consists principally of the Gurnos Estate, a large housing estate established by Merthyr Tydfil Council in the early 1950s and expanded over many years. Many of the initial streets were named after trees; such as Oak, Acacia and Rowan. A major expansion took place during the 1970s, including the building of Prince Charles Hospital. Streets on 1970s development were named after flowers and shrubs; such as Lavender, Heather, Lupin and Forsythia, with the exception of the three most recent areas known as Pen-Gurnos, Pen-y-Dre and Pen-y-Fan View. The area built since the 1970s is still often referred to locally as The New Estate.\nIt was reported in February 2011, that men living on the Gurnos Estate currently have a life expectancy of just 58 years, less than men in Iraq or Haiti This statement was later retracted and rectified, the Mail Online version of the article now states; \"An earlier version of this article referred to the figure for life expectancy in Merthyr Tydfil as being 58.8 years. In fact, this is the figure for ‘healthy life expectancy’ in Merthyr Tydfil, and the average life expectancy is not lower than that in Iraq or Haiti as originally reported.\".\nThe area was formerly open land, including the long-established Gurnos Farm. It also encompassed the notoriously dangerous Goitre Pond.\nThe design and planning of the Gurnos estate borrows ideas from the Radburn system. The estate has become notorious throughout Wales, with the reputation of being an area of deprivation and crime.\nThe Gurnos Tavern, one of the two community centres and many of the maisonette flats were demolished to make greener areas during the late 1990s."
                }
            },
            {
                "id": "neath port talbot#jersey marine",
                "name": "Jersey Marine",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Jersey Marine",
                    "_text": "Jersey Marine is a village in Neath Port Talbot county borough, Wales, UK located about 3 miles (4.8 km) east of Swansea. It falls within the Coedffranc West ward.\nJersey Marine is centered on a main road formed by Ashleigh Terrace, coming from a junction with the A483 road (Fabian Way), which curves to the east along New Road leading to Llandarcy. The A483, Fabian Way, is normally considered the gateway into Swansea City Centre, therefore it is mistakenly thought that the area is part of the city of Swansea despite the village being part of Neath Port Talbot. The local primary in the village is the Crymlyn Primary School. Secondary school age children attend school in Neath, not Swansea.\nThe village includes the Pant Y Sais Nature Reserve, a fen area featuring a circular boardwalk which connects with the tow path of the Tennant Canal.\nA new 800,000 sq ft (74,000 m2) distribution centre for Amazon.co.uk is sited south of the village on the site of a former cable manufacturing plant. It opened on 16 April 2008.[1]"
                }
            },
            {
                "id": "neath port talbot#llandarcy",
                "name": "Llandarcy",
                "lat": "51.6430914",
                "lon": "-3.8559906",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Llandarcy",
                        "_text": "Llandarcy is a village near Neath in Neath Port Talbot county borough, southwest Wales, and formerly the site of the UK's first oil refinery. The village, which lies near the Junction 43 of the M4 Motorway, was originally designed as a garden village to house the workers for the refinery, built by BP Oil between 1918-22."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Llandarcy",
                        "_text": "Pentref ger Castell-nedd ym mwrdeistref sirol Castell-nedd Port Talbot, Cymru yw Llandarcy, lle ceir cyn-safle purfa olew cyntaf y DU. Saif y pentref ger cyffordd 43 yr M4. Cyllunwyd y pentref yn wreiddiol fel tref newydd i gartrefu gweithwyr y burfa a adeiladwyd gan gwmni BP rhwng 1918 ac 1922."
                    }
                ]
            },
            {
                "id": "neath port talbot#llantwit",
                "name": "Llantwit",
                "lat": "51.5816062",
                "lon": "-3.3191786",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Llantwit",
                    "_text": "Llantwit may refer to:\nLlantwit - suburb of Neath, Neath Port Talbot, Wales\nLlantwit Major - coastal village in the Vale of Glamorgan, Wales\nLlantwit Fardre - village between Pontypridd and Bridgend, Rhondda Cynon Taf, Wales"
                }
            },
            {
                "id": "neath port talbot#loughor",
                "name": "Loughor",
                "lat": "51.665095",
                "lon": "-4.067286",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Loughor",
                    "_text": "Loughor (\/ˈlʌxər\/) (Welsh: Casllwchwr) is a town in the City and County of Swansea, Wales, within the historic county boundaries of Glamorgan, Wales. It lies on the estuary of the River Loughor. The town has a community council called Llwchwr. In 2014, it was rated one of the most attractive postcode areas to live in Wales."
                }
            },
            {
                "id": "neath port talbot#lower brynamman",
                "name": "Lower Brynamman",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Lower Brynamman",
                    "_text": "Lower Brynamman is a village and an electoral ward of Neath Port Talbot county borough in Wales."
                }
            },
            {
                "id": "neath port talbot#margam",
                "name": "Margam",
                "lat": "51.5467364",
                "lon": "-3.7011936",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Margam",
                        "_text": "Margam is a suburb of Port Talbot in the Welsh county borough of Neath Port Talbot, Wales, close to junction 39 of the M4 motorway."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Margam",
                        "_text": "Lleolir pentref Margam ger Port Talbot yn Sir Castell-nedd Port Talbot, Cymru, yn agos i gyffordd 39 o draffordd yr M4."
                    }
                ]
            },
            {
                "id": "neath port talbot#melincourt",
                "name": "Melincourt",
                "lat": "51.702982",
                "lon": "-3.708268",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Melincourt",
                    "_text": "Melincourt could refer to:\nMelincourt, Haute-Saône, a French commune\nMelincourt Falls, a waterfall and nature reserve in South Wales\nMelincourt (novel), a novel by Thomas Love Peacock"
                }
            },
            {
                "id": "neath port talbot#melincryddan",
                "name": "Melincryddan",
                "lat": "51.653591",
                "lon": "-3.813096"
            },
            {
                "id": "neath port talbot#mellte",
                "name": "Mellte",
                "lat": "51.75",
                "lon": "-3.5833333"
            },
            {
                "id": "neath port talbot#morfa glas",
                "name": "Morfa Glas",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Morfa Glas",
                    "_text": "Pentref bychan yn sir Castell-nedd Port Talbot yw Morfa Glas. Fe'i lleolir yn Nyffryn Nedd rhwng Glyn-nedd a Blaengwrach. Rhed y briffordd A465 trwy'r pentref."
                }
            },
            {
                "id": "neath port talbot#mount pleasant",
                "name": "Mount Pleasant",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Mount Pleasant",
                    "_text": "Mount Pleasant may refer to:"
                }
            },
            {
                "id": "neath port talbot#nant-y-cafn",
                "name": "Nant-y-cafn",
                "lat": "51.756772",
                "lon": "-3.722692"
            },
            {
                "id": "neath port talbot#neath",
                "name": "Neath",
                "lat": "51.656991",
                "lon": "-3.805476",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Neath",
                    "_text": "Neath (Welsh: Castell-nedd) is a town and community situated in the principal area of Neath Port Talbot, Wales with a population of 19,258 in 2011. The wider urban area, which includes neighbouring settlements, had a population of 50,658 in 2011. Historically in Glamorgan, the town is located on the river of the same name, 7 miles (11 km) east northeast of Swansea.\n^ \n^ John Paxton, ed. (1999). The Penguin Encyclopedia of Places (Third ed.). London: Penguin. p. 628."
                }
            },
            {
                "id": "neath port talbot#neath (castell-nedd)",
                "name": "Neath (Castell-Nedd)"
            },
            {
                "id": "neath port talbot#neath abbey",
                "name": "Neath Abbey",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Neath Abbey",
                    "_text": "Neath Abbey (Welsh: Abaty Nedd) was a Cistercian monastery, located near the present-day town of Neath in South Wales, UK. It was once the largest abbey in Wales. Substantial ruins can still be seen, and are in the care of Cadw. Tudor historian John Leland called Neath Abbey \"the fairest abbey of all Wales.\"\nNeath Abbey is also the name of an area of Neath near to the abbey ruins."
                }
            },
            {
                "id": "neath port talbot#neath canal",
                "name": "Neath Canal"
            },
            {
                "id": "neath port talbot#onllwyn",
                "name": "Onllwyn",
                "lat": "51.781182",
                "lon": "-3.681333",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Onllwyn",
                        "_text": "Onllwyn is a small village in Neath Port Talbot, Wales, near Seven Sisters."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Onllwyn",
                        "_text": "Pentref ym mwrdeisdref sirol Castell-nedd Port Talbot yw Onllwyn. Mae hefyd yn enw'r ward etholiadol, sy'n cynnwyd Dyffryn Cellwen a Banwen. Saif tua 12 milltir i'r gogledd-ddwyrain o dref Castell Nedd, ychydig i'r gogledd o Flaendulais, ar y briffordd A4109 a ger tarddle Afon Dulais.\nArdal lofaol oedd hon, gyda phump glofa o gwmpas y pentref ar un adeg. Mae traddodiad lleol i Sant Padrig gael ei eni yn yr ardal, a chynhelir gorymdaith ar 17 Mawrth i ddathlu hyn. Ceir gweddillion dwy gaer Rufeinif a ffordd Rufeinig gerllaw,"
                    }
                ]
            },
            {
                "id": "neath port talbot#pantdu",
                "name": "Pantdu",
                "lat": "51.6098976",
                "lon": "-3.7727938"
            },
            {
                "id": "neath port talbot#pen-common",
                "name": "Pen-common",
                "lat": "37.3247235",
                "lon": "-82.6424476",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Pen-common",
                    "_text": "Pentrefan yng nghymuned Ystradfellte, Powys, Cymru yw Pen-common, sydd 26.3 milltir (42.2km) o Gaerdydd a 149.6 milltir (240.7km) o Lundain.\n\nCynrychiolir Pen-common yn y Cynulliad Cenedlaethol gan Kirsty Williams (Y Democratiaid Rhyddfrydol) a'r Aelod Seneddol yw Roger Wiliams (Y Democratiaid Rhyddfrydol).\n↑ Gwefan y Cynulliad; adalwyd 24 Chwefror 2014\n↑ Gwefan parliament.uk; adalwyd 24 Chwefror 2014"
                }
            },
            {
                "id": "neath port talbot#pen-rhiw-fawr",
                "name": "Pen-Rhiw-fawr",
                "lat": "51.9021559",
                "lon": "-5.2572521"
            },
            {
                "id": "neath port talbot#pen-y-cae",
                "name": "Pen-y-cae",
                "lat": "51.810283",
                "lon": "-3.677291",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Pen-y-cae",
                    "_text": "Pen-y-cae may refer to one of these places in Wales:\nPen-y-cae, Bridgend\nPen-y-cae, Neath Port Talbot\nPen-y-cae, Powys\nPenycae, Wrexham"
                }
            },
            {
                "id": "neath port talbot#pencaerau",
                "name": "Pencaerau",
                "lat": "51.471266",
                "lon": "-3.2576602"
            },
            {
                "id": "neath port talbot#penrhiwtyn",
                "name": "Penrhiwtyn",
                "lat": "51.64852",
                "lon": "-3.811426"
            },
            {
                "id": "neath port talbot#pont-walby",
                "name": "Pont-Walby",
                "lat": "51.74768",
                "lon": "-3.604805"
            },
            {
                "id": "neath port talbot#pontardawe",
                "name": "Pontardawe",
                "lat": "51.720435",
                "lon": "-3.853215",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pontardawe",
                        "_text": "Pontardawe (Welsh pronunciation: [pɔntarˈdawɛ] – \"bridge on the Tawe\") is a town of some 5,000 inhabitants in the Swansea Valley (Welsh: Cwmtawe) in south Wales. The community of Pontardawe, comprising the electoral wards of Pontardawe and Trebanos, is served by an elected Town Council and forms part of the county borough of Neath Port Talbot.\nPontardawe first came into existence as a small settlement on the northwestern bank of the Tawe at the point where the drovers' road from Neath to Llandeilo crossed first the river and then the road running up the valley from Swansea towards Brecon. Its best known landmark today is the tall spire of St Peter's church which dominates the centre of the town from its site on a high point of the valley floor close to the Swansea Canal."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pontardawe",
                        "_text": "Lleolir tref Pontardawe yng Nghwm Tawe, ym mwrdeistref sirol Castell-nedd Port Talbot. Llifa'r Afon Tawe trwy ganol y dref, a enwir ar ôl y bont dros yr afon honno. Mae'r Afon Clydach Uchaf hefyd yn llifo trwy'r dre cyn ymuno â'r Tawe, ac mae rhan o Gamlas Abertawe (sydd pellach yn segur) i'w ganfod yno. Mae'n gartref i tua 5,000 o drigolion, gan ymestyn i mewn i bentrefi cysylltiedig Trebannws, Ynysmeudwy, Alltwen a Rhyd-y-fro."
                    }
                ]
            },
            {
                "id": "neath port talbot#pontneddfechan",
                "name": "Pontneddfechan",
                "lat": "51.757066",
                "lon": "-3.592109",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pontneddfechan",
                        "_text": "Pontneddfechan (\"bridge over the Little Neath\" in Welsh) is a village in the Vale of Neath in the far south of Powys, Wales. Locally, the name is conventionally pronounced as \/pɔntˌniðˈvɔːn\/ in English, and may be seen written as \"Pontneathvaughan\".\nThe village stands at the confluence of the Rivers Mellte and Nedd Fechan (\"Neath Vaughan\") and provides a convenient access points to the superb series of waterfalls that characterise the upper Neath valley. Dinas Rock, a steeply pitched anticline in the limestone rocks at Craig-y-Dinas, is a favourite spot for rock-climbers."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pontneddfechan",
                        "_text": "Pentref yn ne Powys yw Pontneddfechan. Fe'i lleolir yn ardal Brycheiniog yn rhan uchaf Glyn Nedd, ar bwys yr A465.\nEnwir y pentref ar ôl pont dros Afon Nedd Fechan ger ei chymer ag Afon Mellte. I'r gogledd o'r pentref cyfyd bryniau'r Fforest Fawr, sy'n rhan o Barc Cenedlaethol Bannau Brycheiniog. Mae'n rhan o blwyf eglwysig Nedd Uchaf."
                    }
                ]
            },
            {
                "id": "neath port talbot#pontrhydyfen",
                "name": "Pontrhydyfen",
                "lat": "51.633519",
                "lon": "-3.743294",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Pontrhydyfen",
                        "_text": "Pontrhydyfen (or Pont-rhyd-y-fen) is a small village in the Afan Valley, in Neath Port Talbot county borough in Wales. The majority of its inhabitants speak Welsh as their first language."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Pontrhydyfen",
                        "_text": "Pentref yng Nghwm Afan yw Pontrhydyfen (neu Pont-rhyd-y-fen), ar lethrau'r bryniau lle mae Afon Pelenna yn rhedeg i mewn i Afon Afan. Mae yna bont amlwg yng nghanol y pentref (un o sawl pont) a adeiladwyd gan John Reynolds ym 1825. Hon yw \"Y Bont Fawr\", a oedd ar un adeg yn dwyn rheilffordd fach dros y cwm. Yn ddiweddarach roedd yn dwyn camlas i gario dŵr i'r gwaith haearn ger ardal Penycae (Oakwood nawr).\nI'r de i lawr Cwm Afan mae pentref Cwmafan. I'r gogledd-ddwyrain lan y cwm mae Cynonville a pharc fforest Afan Argoed. I'r gorllewin mae tref Castell-nedd."
                    }
                ]
            },
            {
                "id": "neath port talbot#port talbot",
                "name": "Port Talbot",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Port Talbot",
                        "_text": "Port Talbot (\/pərˈtɔːlbət\/ or \/pərˈtælbət\/) is a town in the county borough of Neath Port Talbot, Wales. It had a population of 37,276 in 2011."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Port Talbot",
                        "_text": "Mae Port Talbot yn dref ddiwydiannol o dua 50,000 o bobol yng Nghastell-nedd Port Talbot ar ochr dwyreiniol Bae Abertawe yn ne Cymru. Saif ar lan Afon Afan. Mae Caerdydd 44.9 km i ffwrdd o Bort Talbot ac mae Llundain yn 256.1 km. Y ddinas agosaf ydy Abertawe sy'n 12 km i ffwrdd."
                    }
                ]
            },
            {
                "id": "neath port talbot#pwll-y-glaw",
                "name": "Pwll-y-glaw",
                "lat": "51.6231559",
                "lon": "-3.7460161",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Pwll-y-glaw",
                    "_text": "Pentref bychan yn ardal Castell-nedd Port Talbot yw Pwll-y-glaw. Fe'i lleolir ar y ffordd B4286 tua 4 milltir i'r gogledd-ddwyrain o Bort Talbot, ger Cwmafan."
                }
            },
            {
                "id": "neath port talbot#resolven",
                "name": "Resolven",
                "lat": "51.710349",
                "lon": "-3.693584",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Resolven",
                    "_text": "Resolven (Welsh: Resolfen) is a small village in Neath Port Talbot county borough, Wales. It is located in the heart of the Vale of Neath.\n\n"
                }
            },
            {
                "id": "neath port talbot#rhiwfawr",
                "name": "Rhiwfawr",
                "lat": "51.7815253",
                "lon": "-3.8128179",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Rhiwfawr",
                    "_text": "Rhiwfawr is a hamlet of 40 houses in the Swansea Valley, in Neath Port Talbot county borough, Wales.\n\n"
                }
            },
            {
                "id": "neath port talbot#rhos",
                "name": "Rhos",
                "lat": "51.712548",
                "lon": "-3.827005",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Rhos",
                        "_text": "Rhos (meaning \"moorland\" in Welsh) may refer to the following places in Wales:\nRhos, Neath Port Talbot a village in Neath Port Talbot, Wales\nRhos-on-Sea (or Llandrillo-yn-Rhos), a village on the outskirts of Colwyn Bay, north Wales\nRhosllannerchrugog, a village in the County Borough of Wrexham in northeast Wales\nHistoric subdivisions\nRhos (north Wales), a cantref and prior to that a small kingdom in medieval mid-north Wales\nRhos, later the Hundred of Roose, a cantref around Milford Haven in southwest Wales"
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Rhos",
                        "_text": "Am y cantref yn Sir Benfro, gweler Rhos. Gweler hefyd Rhos (gwahaniaethu)\nCantref yn Y Berfeddwlad yng ngogledd Cymru oedd Rhos (gorllewin Sir Ddinbych a dwyrain sir Conwy heddiw). Ymddengys yn bosibl fod Rhos yn un o fân deyrnasoedd Cymru yn y cyfnod ôl-Rufeinig a ddaeth yn rhan o deyrnas Gwynedd."
                    }
                ]
            },
            {
                "id": "neath port talbot#rhyd-y-fro",
                "name": "Rhyd-y-fro",
                "lat": "51.9393543",
                "lon": "-3.8814419",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Rhyd-y-fro",
                    "_text": "Pentref bychan yn sir Castell-nedd Port Talbot yw Rhyd-y-fro. Fe'i lleolir ar y briffordd A474 tua 2 filltir i'r gogledd o Bontardawe."
                }
            },
            {
                "id": "neath port talbot#rhydding",
                "name": "Rhydding",
                "lat": "51.6771628",
                "lon": "-3.8143487"
            },
            {
                "id": "neath port talbot#rock",
                "name": "Rock",
                "lat": "51.6794367",
                "lon": "-3.1886432",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Rock",
                    "_text": "Rock usually refers to:\nRock (geology), a naturally occurring solid aggregate of minerals or mineraloids\nRock music, a form of popular music\nRock or Rocks may also refer to:"
                }
            },
            {
                "id": "neath port talbot#sandfields",
                "name": "Sandfields",
                "lat": "51.5954646",
                "lon": "-3.8116339",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Sandfields",
                    "_text": "Sandfields may refer to:\nSandfields: a district in Swansea; Rhosafan in Welsh.\nSandfields, Port Talbot\nA suburb in the city of Lichfield, Staffordshire"
                }
            },
            {
                "id": "neath port talbot#seven sisters",
                "name": "Seven Sisters",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Seven Sisters",
                    "_text": "Seven Sisters is the common name for the Pleiades, a star cluster named for mythological characters.\nSeven Sisters may also refer to:"
                }
            },
            {
                "id": "neath port talbot#skewen",
                "name": "Skewen",
                "lat": "51.660932",
                "lon": "-3.841789",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Skewen",
                    "_text": "Skewen (Welsh: Sgiwen) is a village within the county borough of Neath Port Talbot, in Wales.\nThe village is served by Skewen railway station.\nSkewen supports its own rugby club."
                }
            },
            {
                "id": "neath port talbot#swansea canal",
                "name": "Swansea Canal",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Swansea Canal",
                    "_text": "The Swansea Canal (Welsh: Camlas Abertawe) was a canal constructed by the Swansea Canal Navigation Company between 1794 and 1798, running for some 16.5 miles (26.6 km) from Swansea to Hen Neuadd, Abercraf in South Wales. It was steeply graded, and 36 locks were needed to enable it to rise 373 feet (114 m) over its length. The main cargos were coal, iron and steel, and the enterprise was profitable.\nSold to the Great Western Railway in 1873, it continued to make a profit until 1895. A period of decline followed, with the last commercial traffic using the waterway in 1931. Subsequently, parts of it were closed and filled in under a succession of owners, but around 5 miles (8.0 km) remain in water. The Swansea Canal Society, formed in 1981, are actively involved in plans for its restoration."
                }
            },
            {
                "id": "neath port talbot#taibach",
                "name": "Taibach",
                "lat": "51.587731",
                "lon": "-3.771794",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Taibach",
                    "_text": "Taibach or Tai-Bach (English: Little Houses) is a suburban district of Port Talbot, Wales. It is a settlement centered on the main A48 road, sandwiched between The river Ffrwdwyllt and Margam."
                }
            },
            {
                "id": "neath port talbot#tairgwaith",
                "name": "Tairgwaith",
                "lat": "51.7924907",
                "lon": "-3.8639542",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Tairgwaith",
                    "_text": "Mae Tairgwaith wedi'i ddynodi'n Safle o Ddiddordeb Gwyddonol Arbennig yng Nghymru (SoDdGA neu SSSI) ers 06 Hydref 2003 fel ymgais gadwraethol i amddiffyn a gwarchod y safle. Mae ei arwynebedd yn 4.56 hectar. Cyfoeth Naturiol Cymru yw'r corff sy'n gyfrifol am y safle.\n↑ Gwefan Cyngor Cefn Gwlad Cymru (bellach 'Cyfoeth Naturiol Cymru'); adalwyd 25 Rhagfyr 2013"
                }
            },
            {
                "id": "neath port talbot#tawe",
                "name": "Tawe",
                "lat": "51.6193263",
                "lon": "-3.9334134"
            },
            {
                "id": "neath port talbot#tennant canal",
                "name": "Tennant Canal"
            },
            {
                "id": "neath port talbot#tonmawr",
                "name": "Tonmawr",
                "lat": "51.653812",
                "lon": "-3.733167",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Tonmawr",
                    "_text": "Tonmawr is a village in Neath Port Talbot county borough, south Wales. It is located around four miles east of Neath.\nThe village is home to a rugby union team (Tonmawr RFC), a primary school, a community centre, and the Pelenna Mountain Centre."
                }
            },
            {
                "id": "neath port talbot#tonna",
                "name": "Tonna",
                "lat": "51.676127",
                "lon": "-3.773785",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Tonna",
                    "_text": "Tonna may refer to:\nTonna, Antenna, a French antenna manufacturer, famous of manufacturing radioamateur antennas.\nTonna, Neath, a village in Wales, part of the county borough Neath Port Talbot\nTonna, Germany, a municipality in Thuringia, Germany\nTonna (gastropod), a genus of marine snails\nAn alternative spelling for the Japanese poet Ton'a"
                }
            },
            {
                "id": "neath port talbot#tre-forgan",
                "name": "Tre-Forgan",
                "lat": "51.7399154",
                "lon": "-3.7520335"
            },
            {
                "id": "neath port talbot#trebanos",
                "name": "Trebanos",
                "lat": "51.710991",
                "lon": "-3.863491",
                "wikipedia": {
                    "lang": "en",
                    "href": "https:\/\/en.wikipedia.org\/wiki\/Trebanos",
                    "_text": "Trebanos (Welsh: Trebannws) is a village in the Swansea Valley, Wales. It forms, together with Craig Trebanos and a part of Pontardawe, the Trebanos electoral ward of Neath Port Talbot county borough.\nControversy and opposition concerning the South Wales Gas Pipeline passing through the village led to media attention for the village and a protest camp in 2006 and 2007."
                }
            },
            {
                "id": "neath port talbot#tynewydd",
                "name": "Tynewydd",
                "lat": "51.679093",
                "lon": "-3.54632",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Tynewydd",
                        "_text": "Tynewydd is a village located in the County Borough of Rhondda Cynon Taf, south Wales. With Treherbert, Blaencwm, Blaenrhondda and Pen-yr-englyn it is part of a community of Treherbert. The village lies in the former industrial coal mining area at the head of Rhondda Fawr, the larger of the Rhondda Valleys."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Tynewydd",
                        "_text": "Pentref bychan yn Rhondda Cynon Taf yw Tynewydd. Mae'n gorwedd yn rhan uchaf Cwm Rhondda ger Blaencwm."
                    }
                ]
            },
            {
                "id": "neath port talbot#ynysmaerdy",
                "name": "Ynysmaerdy",
                "lat": "51.5506839",
                "lon": "-3.396995",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ynysmaerdy",
                        "_text": "Ynysmaerdy is a village near Talbot Green and Llantrisant in Rhondda Cynon Taf, Wales. Even though there is no direct access to the village of Llanharan, due to older parish boundaries it falls under the community of Llnaharan. It is home to the Royal Glamorgan Hospital."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ynysmaerdy",
                        "_text": "Pentref yn Rhondda Cynon Taf yw Ynysmaerdy. Fe'i lleolir ar yr A4119 ger Llantrisant, tua 5 milltir i'r de-orllewin o Bontypridd, yn ne'r sir. Llifa Afon Elái heibio i'r pentref.\nLleolir Ysbyty Brenhinol Morgannwg yn y pentref."
                    }
                ]
            },
            {
                "id": "neath port talbot#ynysmeudwy",
                "name": "Ynysmeudwy",
                "lat": "51.731747",
                "lon": "-3.834971",
                "wikipedia": {
                    "lang": "cy",
                    "href": "https:\/\/cy.wikipedia.org\/wiki\/Ynysmeudwy",
                    "_text": "Pentref bychan yn sir Castell-nedd Port Talbot yw Ynysmeudwy. Fe'i lleolir yng Nghwm Tawe ar bwys y briffordd A4067 tua 1.5 milltir i'r gogledd-ddwyrain o Bontardawe."
                }
            },
            {
                "id": "neath port talbot#ynysygwas",
                "name": "Ynysygwas",
                "lat": "51.639356",
                "lon": "-3.360219"
            },
            {
                "id": "neath port talbot#ystalyfera",
                "name": "Ystalyfera",
                "lat": "51.762364",
                "lon": "-3.791996",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ystalyfera",
                        "_text": "Ystalyfera is a former industrial village in the upper Swansea Valley, on the River Tawe, about 13 miles (21 km) north-east of Swansea. It is an electoral ward and a community in the unitary authority of Neath Port Talbot, Wales, comprising a resident population of just over 3,000 people, approximately 60% of whom speak Welsh.\nNational Cycle Route 43 passes though the village."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ystalyfera",
                        "_text": "Pentref a chymuned yng Nghastell-nedd Port Talbot yw Ystalyfera, wedi ei leoli ger cyd-lif yr afonydd Twrch a Thawe, tua 18 milltir i'r gogledd o Abertawe. Datblygodd Ystalyfera yn ystod y deunawfed ganrif, gyda gwaith haern pwysig a sawl pwll glo wedi eu lleoli yno. Fodd bynnag, gyda dirywiad diwydiant gwaithgynhyrchu, bu sawl newid cymdeithasol a demograffaidd yn Ystalyfera, sydd bellach ymlith y 100 cymuned mwyaf amddifad yng Nghymru yn ôl Mynegrif Aml-amddifadedd Cymru. [angen ffynhonnell]\nMae gan Ystalyfera nifer o gapeli a thafarndai adnabyddus, gan gynnwys y Wern Fawr, sydd wedi ennill gwobrau am y cwrw a fregir ar y safle. Mae dylanwad Buddy Holly yn gryf ar enwau'r cwrw hyn.\nAr ochr ddeheuol y pentref saif ardal Y Graig Arw a Phant-teg, sy'n cysylltu Ystalyfera â Godre'r-graig.\nYn y gorffennol, roedd cylch Ystalyfera yn enwog am lysenwau lliwgar y trigolion."
                    }
                ]
            },
            {
                "id": "neath port talbot#ystradowen",
                "name": "Ystradowen",
                "lat": "51.488889",
                "lon": "-3.424781",
                "wikipedia": [
                    {
                        "lang": "en",
                        "href": "https:\/\/en.wikipedia.org\/wiki\/Ystradowen",
                        "_text": "Ystradowen is a small village twelve miles west of Cardiff, located in the Vale of Glamorgan in south Wales; its nearest town is Cowbridge which is about three miles to the south. The village was served by Ystradowen railway station between 1865 and 1951.\nThe name Ystradowen means \"Owen's Valley\" in English.\nLocal amenities include St Owain's parish church, The White Lion public house, Tudor Garage and Seven Oaks fisheries.\nNotable residents: Tom Jones had a home in the village until 1998."
                    },
                    {
                        "lang": "cy",
                        "href": "https:\/\/cy.wikipedia.org\/wiki\/Ystradowen",
                        "_text": "Pentref bychan sy'n gorwedd i'r gogledd o'r Bont-faen ym Mro Morgannwg, de Cymru, tua 12 milltir i'r gorllewin o ddinas Caerdydd, yw Ystradowen.\nCeir eglwys yn y pentref a thafarn y White Lion. Hyd at 1998 bu gan y canwr enwog o'r Cymoedd Tom Jones dŷ yn Ystradowen."
                    }
                ]
            }
        ]
    }
}